{
  "book": "1CO",
  "book_name": "1 Corinthians",
  "chapter": 14,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/1CO.14",
  "verses": [
    {
      "verse": 1,
      "text": "Pursue love and strive for the spiritual gifts, and especially that you may prophesy."
    },
    {
      "verse": 2,
      "text": "For those who speak in a tongue do not speak to other people but to God; for nobody understands them, since they are speaking mysteries in the Spirit."
    },
    {
      "verse": 3,
      "text": "On the other hand, those who prophesy speak to other people for their upbuilding and encouragement and consolation."
    },
    {
      "verse": 4,
      "text": "Those who speak in a tongue build up themselves, but those who prophesy build up the church."
    },
    {
      "verse": 5,
      "text": "Now I would like all of you to speak in tongues, but even more to prophesy. One who prophesies is greater than one who speaks in tongues, unless someone interprets, so that the church may be built up."
    },
    {
      "verse": 6,
      "text": "Now, brothers and sisters, if I come to you speaking in tongues, how will I benefit you unless I speak to you in some revelation or knowledge or prophecy or teaching?"
    },
    {
      "verse": 7,
      "text": "It is the same way with lifeless instruments that produce sound, such as the flute or the harp. If they do not give distinct notes, how will anyone know what is being played?"
    },
    {
      "verse": 8,
      "text": "And if the bugle gives an indistinct sound, who will get ready for battle?"
    },
    {
      "verse": 9,
      "text": "So with yourselves; if in a tongue you utter speech that is not intelligible, how will anyone know what is being said? For you will be speaking into the air."
    },
    {
      "verse": 10,
      "text": "There are doubtless many different kinds of sounds in the world, and nothing is without sound."
    },
    {
      "verse": 11,
      "text": "If then I do not know the meaning of a sound, I will be a foreigner to the speaker and the speaker a foreigner to me."
    },
    {
      "verse": 12,
      "text": "So with yourselves; since you are eager for spiritual gifts, strive to excel in them for building up the church."
    },
    {
      "verse": 13,
      "text": "Therefore, one who speaks in a tongue should pray for the power to interpret."
    },
    {
      "verse": 14,
      "text": "For if I pray in a tongue, my spirit prays but my mind is unproductive."
    },
    {
      "verse": 15,
      "text": "What should I do then? I will pray with the spirit, but I will pray with the mind also; I will sing praise with the spirit, but I will sing praise with the mind also."
    },
    {
      "verse": 16,
      "text": "Otherwise, if you say a blessing with the spirit, how can anyone in the position of an outsider say the “Amen” to your thanksgiving, since the outsider does not know what you are saying?"
    },
    {
      "verse": 17,
      "text": "For you may give thanks well enough, but the other person is not built up."
    },
    {
      "verse": 18,
      "text": "I thank God that I speak in tongues more than all of you;"
    },
    {
      "verse": 19,
      "text": "nevertheless, in church I would rather speak five words with my mind, in order to instruct others also, than ten thousand words in a tongue."
    },
    {
      "verse": 20,
      "text": "Brothers and sisters, do not be children in your thinking; rather, be infants in evil, but in thinking be adults."
    },
    {
      "verse": 21,
      "text": "In the law it is written, “By people of strange tongues and by the lips of foreigners I will speak to this people; yet even then they will not listen to me,” says the Lord."
    },
    {
      "verse": 22,
      "text": "Tongues, then, are a sign not for believers but for unbelievers, while prophecy is not for unbelievers but for believers."
    },
    {
      "verse": 23,
      "text": "If, therefore, the whole church comes together and all speak in tongues, and outsiders or unbelievers enter, will they not say that you are out of your mind?"
    },
    {
      "verse": 24,
      "text": "But if all prophesy, an unbeliever or outsider who enters is reproved by all and called to account by all."
    },
    {
      "verse": 25,
      "text": "After the secrets of the unbeliever's heart are disclosed, that person will bow down before God and worship him, declaring, “God is really among you.”"
    },
    {
      "verse": 26,
      "text": "What should be done then, my friends? When you come together, each one has a hymn, a lesson, a revelation, a tongue, or an interpretation. Let all things be done for building up."
    },
    {
      "verse": 27,
      "text": "If anyone speaks in a tongue, let there be only two or at most three, and each in turn; and let one interpret."
    },
    {
      "verse": 28,
      "text": "But if there is no one to interpret, let them be silent in church and speak to themselves and to God."
    },
    {
      "verse": 29,
      "text": "Let two or three prophets speak, and let the others weigh what is said."
    },
    {
      "verse": 30,
      "text": "If a revelation is made to someone else sitting nearby, let the first person be silent."
    },
    {
      "verse": 31,
      "text": "For you can all prophesy one by one, so that all may learn and all be encouraged."
    },
    {
      "verse": 32,
      "text": "And the spirits of prophets are subject to the prophets,"
    },
    {
      "verse": 33,
      "text": "for God is a God not of disorder but of peace. (As in all the churches of the saints,"
    },
    {
      "verse": 34,
      "text": "women should be silent in the churches. For they are not permitted to speak, but should be subordinate, as the law also says."
    },
    {
      "verse": 35,
      "text": "If there is anything they desire to know, let them ask their husbands at home. For it is shameful for a woman to speak in church."
    },
    {
      "verse": 36,
      "text": "Or did the word of God originate with you? Or are you the only ones it has reached?)"
    },
    {
      "verse": 37,
      "text": "Anyone who claims to be a prophet, or to have spiritual powers, must acknowledge that what I am writing to you is a command of the Lord."
    },
    {
      "verse": 38,
      "text": "Anyone who does not recognize this is not to be recognized."
    },
    {
      "verse": 39,
      "text": "So, my friends, be eager to prophesy, and do not forbid speaking in tongues;"
    },
    {
      "verse": 40,
      "text": "but all things should be done decently and in order."
    }
  ],
  "timestamp": "2025-09-16T19:50:19.032953"
}