{
  "book": "1CO",
  "book_name": "1 Corinthians",
  "chapter": 4,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/1CO.4",
  "verses": [
    {
      "verse": 1,
      "text": "Think of us in this way, as servants of Christ and stewards of God's mysteries."
    },
    {
      "verse": 2,
      "text": "Moreover, it is required of stewards that they be found trustworthy."
    },
    {
      "verse": 3,
      "text": "But with me it is a very small thing that I should be judged by you or by any human court. I do not even judge myself."
    },
    {
      "verse": 4,
      "text": "I am not aware of anything against myself, but I am not thereby acquitted. It is the Lord who judges me."
    },
    {
      "verse": 5,
      "text": "Therefore do not pronounce judgment before the time, before the Lord comes, who will bring to light the things now hidden in darkness and will disclose the purposes of the heart. Then each one will receive commendation from God."
    },
    {
      "verse": 6,
      "text": "I have applied all this to Apollos and myself for your benefit, brothers and sisters, so that you may learn through us the meaning of the saying, “Nothing beyond what is written,” so that none of you will be puffed up in favor of one against another."
    },
    {
      "verse": 7,
      "text": "For who sees anything different in you? What do you have that you did not receive? And if you received it, why do you boast as if it were not a gift?"
    },
    {
      "verse": 8,
      "text": "Already you have all you want! Already you have become rich! Quite apart from us you have become kings! Indeed, I wish that you had become kings, so that we might be kings with you!"
    },
    {
      "verse": 9,
      "text": "For I think that God has exhibited us apostles as last of all, as though sentenced to death, because we have become a spectacle to the world, to angels and to mortals."
    },
    {
      "verse": 10,
      "text": "We are fools for the sake of Christ, but you are wise in Christ. We are weak, but you are strong. You are held in honor, but we in disrepute."
    },
    {
      "verse": 11,
      "text": "To the present hour we are hungry and thirsty, we are poorly clothed and beaten and homeless,"
    },
    {
      "verse": 12,
      "text": "and we grow weary from the work of our own hands. When reviled, we bless; when persecuted, we endure;"
    },
    {
      "verse": 13,
      "text": "when slandered, we speak kindly. We have become like the rubbish of the world, the dregs of all things, to this very day."
    },
    {
      "verse": 14,
      "text": "I am not writing this to make you ashamed, but to admonish you as my beloved children."
    },
    {
      "verse": 15,
      "text": "For though you might have ten thousand guardians in Christ, you do not have many fathers. Indeed, in Christ Jesus I became your father through the gospel."
    },
    {
      "verse": 16,
      "text": "I appeal to you, then, be imitators of me."
    },
    {
      "verse": 17,
      "text": "For this reason I sent you Timothy, who is my beloved and faithful child in the Lord, to remind you of my ways in Christ Jesus, as I teach them everywhere in every church."
    },
    {
      "verse": 18,
      "text": "But some of you, thinking that I am not coming to you, have become arrogant."
    },
    {
      "verse": 19,
      "text": "But I will come to you soon, if the Lord wills, and I will find out not the talk of these arrogant people but their power."
    },
    {
      "verse": 20,
      "text": "For the kingdom of God depends not on talk but on power."
    },
    {
      "verse": 21,
      "text": "What would you prefer? Am I to come to you with a stick, or with love in a spirit of gentleness?"
    }
  ],
  "timestamp": "2025-09-16T19:50:15.939034"
}