{
  "book": "1CO",
  "book_name": "1 Corinthians",
  "chapter": 15,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/1CO.15",
  "verses": [
    {
      "verse": 1,
      "text": "Now I would remind you, brothers and sisters, of the good news that I proclaimed to you, which you in turn received, in which also you stand,"
    },
    {
      "verse": 2,
      "text": "through which also you are being saved, if you hold firmly to the message that I proclaimed to you—unless you have come to believe in vain."
    },
    {
      "verse": 3,
      "text": "For I handed on to you as of first importance what I in turn had received: that Christ died for our sins in accordance with the scriptures,"
    },
    {
      "verse": 4,
      "text": "and that he was buried, and that he was raised on the third day in accordance with the scriptures,"
    },
    {
      "verse": 5,
      "text": "and that he appeared to Cephas, then to the twelve."
    },
    {
      "verse": 6,
      "text": "Then he appeared to more than five hundred brothers and sisters at one time, most of whom are still alive, though some have died."
    },
    {
      "verse": 7,
      "text": "Then he appeared to James, then to all the apostles."
    },
    {
      "verse": 8,
      "text": "Last of all, as to one untimely born, he appeared also to me."
    },
    {
      "verse": 9,
      "text": "For I am the least of the apostles, unfit to be called an apostle, because I persecuted the church of God."
    },
    {
      "verse": 10,
      "text": "But by the grace of God I am what I am, and his grace toward me has not been in vain. On the contrary, I worked harder than any of them—though it was not I, but the grace of God that is with me."
    },
    {
      "verse": 11,
      "text": "Whether then it was I or they, so we proclaim and so you have come to believe."
    },
    {
      "verse": 12,
      "text": "Now if Christ is proclaimed as raised from the dead, how can some of you say there is no resurrection of the dead?"
    },
    {
      "verse": 13,
      "text": "If there is no resurrection of the dead, then Christ has not been raised;"
    },
    {
      "verse": 14,
      "text": "and if Christ has not been raised, then our proclamation has been in vain and your faith has been in vain."
    },
    {
      "verse": 15,
      "text": "We are even found to be misrepresenting God, because we testified of God that he raised Christ—whom he did not raise if it is true that the dead are not raised."
    },
    {
      "verse": 16,
      "text": "For if the dead are not raised, then Christ has not been raised."
    },
    {
      "verse": 17,
      "text": "If Christ has not been raised, your faith is futile and you are still in your sins."
    },
    {
      "verse": 18,
      "text": "Then those also who have died in Christ have perished."
    },
    {
      "verse": 19,
      "text": "If for this life only we have hoped in Christ, we are of all people most to be pitied."
    },
    {
      "verse": 20,
      "text": "But in fact Christ has been raised from the dead, the first fruits of those who have died."
    },
    {
      "verse": 21,
      "text": "For since death came through a human being, the resurrection of the dead has also come through a human being;"
    },
    {
      "verse": 22,
      "text": "for as all die in Adam, so all will be made alive in Christ."
    },
    {
      "verse": 23,
      "text": "But each in his own order: Christ the first fruits, then at his coming those who belong to Christ."
    },
    {
      "verse": 24,
      "text": "Then comes the end, when he hands over the kingdom to God the Father, after he has destroyed every ruler and every authority and power."
    },
    {
      "verse": 25,
      "text": "For he must reign until he has put all his enemies under his feet."
    },
    {
      "verse": 26,
      "text": "The last enemy to be destroyed is death."
    },
    {
      "verse": 27,
      "text": "For “God has put all things in subjection under his feet.” But when it says, “All things are put in subjection,” it is plain that this does not include the one who put all things in subjection under him."
    },
    {
      "verse": 28,
      "text": "When all things are subjected to him, then the Son himself will also be subjected to the one who put all things in subjection under him, so that God may be all in all."
    },
    {
      "verse": 29,
      "text": "Otherwise, what will those people do who receive baptism on behalf of the dead? If the dead are not raised at all, why are people baptized on their behalf?"
    },
    {
      "verse": 30,
      "text": "And why are we putting ourselves in danger every hour?"
    },
    {
      "verse": 31,
      "text": "I die every day! That is as certain, brothers and sisters, as my boasting of you—a boast that I make in Christ Jesus our Lord."
    },
    {
      "verse": 32,
      "text": "If with merely human hopes I fought with wild animals at Ephesus, what would I have gained by it? If the dead are not raised, “Let us eat and drink, for tomorrow we die.”"
    },
    {
      "verse": 33,
      "text": "Do not be deceived: “Bad company ruins good morals.”"
    },
    {
      "verse": 34,
      "text": "Come to a sober and right mind, and sin no more; for some people have no knowledge of God. I say this to your shame."
    },
    {
      "verse": 35,
      "text": "But someone will ask, “How are the dead raised? With what kind of body do they come?”"
    },
    {
      "verse": 36,
      "text": "Fool! What you sow does not come to life unless it dies."
    },
    {
      "verse": 37,
      "text": "And as for what you sow, you do not sow the body that is to be, but a bare seed, perhaps of wheat or of some other grain."
    },
    {
      "verse": 38,
      "text": "But God gives it a body as he has chosen, and to each kind of seed its own body."
    },
    {
      "verse": 39,
      "text": "Not all flesh is alike, but there is one flesh for human beings, another for animals, another for birds, and another for fish."
    },
    {
      "verse": 40,
      "text": "There are both heavenly bodies and earthly bodies, but the glory of the heavenly is one thing, and that of the earthly is another."
    },
    {
      "verse": 41,
      "text": "There is one glory of the sun, and another glory of the moon, and another glory of the stars; indeed, star differs from star in glory."
    },
    {
      "verse": 42,
      "text": "So it is with the resurrection of the dead. What is sown is perishable, what is raised is imperishable."
    },
    {
      "verse": 43,
      "text": "It is sown in dishonor, it is raised in glory. It is sown in weakness, it is raised in power."
    },
    {
      "verse": 44,
      "text": "It is sown a physical body, it is raised a spiritual body. If there is a physical body, there is also a spiritual body."
    },
    {
      "verse": 45,
      "text": "Thus it is written, “The first man, Adam, became a living being”; the last Adam became a life-giving spirit."
    },
    {
      "verse": 46,
      "text": "But it is not the spiritual that is first, but the physical, and then the spiritual."
    },
    {
      "verse": 47,
      "text": "The first man was from the earth, a man of dust; the second man is from heaven."
    },
    {
      "verse": 48,
      "text": "As was the man of dust, so are those who are of the dust; and as is the man of heaven, so are those who are of heaven."
    },
    {
      "verse": 49,
      "text": "Just as we have borne the image of the man of dust, we will also bear the image of the man of heaven."
    },
    {
      "verse": 50,
      "text": "What I am saying, brothers and sisters, is this: flesh and blood cannot inherit the kingdom of God, nor does the perishable inherit the imperishable."
    },
    {
      "verse": 51,
      "text": "Listen, I will tell you a mystery! We will not all die, but we will all be changed,"
    },
    {
      "verse": 52,
      "text": "in a moment, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, and the dead will be raised imperishable, and we will be changed."
    },
    {
      "verse": 53,
      "text": "For this perishable body must put on imperishability, and this mortal body must put on immortality."
    },
    {
      "verse": 54,
      "text": "When this perishable body puts on imperishability, and this mortal body puts on immortality, then the saying that is written will be fulfilled: “Death has been swallowed up in victory.”"
    },
    {
      "verse": 55,
      "text": "“Where, O death, is your victory? Where, O death, is your sting?”"
    },
    {
      "verse": 56,
      "text": "The sting of death is sin, and the power of sin is the law."
    },
    {
      "verse": 57,
      "text": "But thanks be to God, who gives us the victory through our Lord Jesus Christ."
    },
    {
      "verse": 58,
      "text": "Therefore, my beloved, be steadfast, immovable, always excelling in the work of the Lord, because you know that in the Lord your labor is not in vain."
    }
  ],
  "timestamp": "2025-09-16T19:50:19.110461"
}