{
  "book": "1KI",
  "book_name": "1 Kings",
  "chapter": 7,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/1KI.7",
  "verses": [
    {
      "verse": 1,
      "text": "Solomon was building his own house thirteen years, and he finished his entire house."
    },
    {
      "verse": 2,
      "text": "He built the House of the Forest of the Lebanon one hundred cubits long, fifty cubits wide, and thirty cubits high, built on four rows of cedar pillars, with cedar beams on the pillars."
    },
    {
      "verse": 3,
      "text": "It was roofed with cedar on the forty-five rafters, fifteen in each row, which were on the pillars."
    },
    {
      "verse": 4,
      "text": "There were window frames in the three rows, facing each other in the three rows."
    },
    {
      "verse": 5,
      "text": "All the doorways and doorposts had four-sided frames, opposite, facing each other in the three rows."
    },
    {
      "verse": 6,
      "text": "He made the Hall of Pillars fifty cubits long and thirty cubits wide. There was a porch in front with pillars, and a canopy in front of them."
    },
    {
      "verse": 7,
      "text": "He made the Hall of the Throne where he was to pronounce judgment, the Hall of Justice, covered with cedar from floor to floor."
    },
    {
      "verse": 8,
      "text": "His own house where he would reside, in the other court back of the hall, was of the same construction. Solomon also made a house like this hall for Pharaoh's daughter, whom he had taken in marriage."
    },
    {
      "verse": 9,
      "text": "All these were made of costly stones, cut according to measure, sawed with saws, back and front, from the foundation to the coping, and from outside to the great court."
    },
    {
      "verse": 10,
      "text": "The foundation was of costly stones, huge stones, stones of eight and ten cubits."
    },
    {
      "verse": 11,
      "text": "There were costly stones above, cut to measure, and cedarwood."
    },
    {
      "verse": 12,
      "text": "The great court had three courses of dressed stone to one layer of cedar beams all around; so had the inner court of the house of the Lord, and the vestibule of the house."
    },
    {
      "verse": 13,
      "text": "Now King Solomon invited and received Hiram from Tyre."
    },
    {
      "verse": 14,
      "text": "He was the son of a widow of the tribe of Naphtali, whose father, a man of Tyre, had been an artisan in bronze; he was full of skill, intelligence, and knowledge in working bronze. He came to King Solomon, and did all his work."
    },
    {
      "verse": 15,
      "text": "He cast two pillars of bronze. Eighteen cubits was the height of the one, and a cord of twelve cubits would encircle it; the second pillar was the same."
    },
    {
      "verse": 16,
      "text": "He also made two capitals of molten bronze, to set on the tops of the pillars; the height of the one capital was five cubits, and the height of the other capital was five cubits."
    },
    {
      "verse": 17,
      "text": "There were nets of checker work with wreaths of chain work for the capitals on the tops of the pillars; seven for the one capital, and seven for the other capital."
    },
    {
      "verse": 18,
      "text": "He made the columns with two rows around each latticework to cover the capitals that were above the pomegranates; he did the same with the other capital."
    },
    {
      "verse": 19,
      "text": "Now the capitals that were on the tops of the pillars in the vestibule were of lily-work, four cubits high."
    },
    {
      "verse": 20,
      "text": "The capitals were on the two pillars and also above the rounded projection that was beside the latticework; there were two hundred pomegranates in rows all around; and so with the other capital."
    },
    {
      "verse": 21,
      "text": "He set up the pillars at the vestibule of the temple; he set up the pillar on the south and called it Jachin; and he set up the pillar on the north and called it Boaz."
    },
    {
      "verse": 22,
      "text": "On the tops of the pillars was lily-work. Thus the work of the pillars was finished."
    },
    {
      "verse": 23,
      "text": "Then he made the molten sea; it was round, ten cubits from brim to brim, and five cubits high. A line of thirty cubits would encircle it completely."
    },
    {
      "verse": 24,
      "text": "Under its brim were panels all around it, each of ten cubits, surrounding the sea; there were two rows of panels, cast when it was cast."
    },
    {
      "verse": 25,
      "text": "It stood on twelve oxen, three facing north, three facing west, three facing south, and three facing east; the sea was set on them. The hindquarters of each were toward the inside."
    },
    {
      "verse": 26,
      "text": "Its thickness was a handbreadth; its brim was made like the brim of a cup, like the flower of a lily; it held two thousand baths."
    },
    {
      "verse": 27,
      "text": "He also made the ten stands of bronze; each stand was four cubits long, four cubits wide, and three cubits high."
    },
    {
      "verse": 28,
      "text": "This was the construction of the stands: they had borders; the borders were within the frames;"
    },
    {
      "verse": 29,
      "text": "on the borders that were set in the frames were lions, oxen, and cherubim. On the frames, both above and below the lions and oxen, there were wreaths of beveled work."
    },
    {
      "verse": 30,
      "text": "Each stand had four bronze wheels and axles of bronze; at the four corners were supports for a basin. The supports were cast with wreaths at the side of each."
    },
    {
      "verse": 31,
      "text": "Its opening was within the crown whose height was one cubit; its opening was round, as a pedestal is made; it was a cubit and a half wide. At its opening there were carvings; its borders were four-sided, not round."
    },
    {
      "verse": 32,
      "text": "The four wheels were underneath the borders; the axles of the wheels were in the stands; and the height of a wheel was a cubit and a half."
    },
    {
      "verse": 33,
      "text": "The wheels were made like a chariot wheel; their axles, their rims, their spokes, and their hubs were all cast."
    },
    {
      "verse": 34,
      "text": "There were four supports at the four corners of each stand; the supports were of one piece with the stands."
    },
    {
      "verse": 35,
      "text": "On the top of the stand there was a round band half a cubit high; on the top of the stand, its stays and its borders were of one piece with it."
    },
    {
      "verse": 36,
      "text": "On the surfaces of its stays and on its borders he carved cherubim, lions, and palm trees, where each had space, with wreaths all around."
    },
    {
      "verse": 37,
      "text": "In this way he made the ten stands; all of them were cast alike, with the same size and the same form."
    },
    {
      "verse": 38,
      "text": "He made ten basins of bronze; each basin held forty baths, each basin measured four cubits; there was a basin for each of the ten stands."
    },
    {
      "verse": 39,
      "text": "He set five of the stands on the south side of the house, and five on the north side of the house; he set the sea on the southeast corner of the house."
    },
    {
      "verse": 40,
      "text": "Hiram also made the pots, the shovels, and the basins. So Hiram finished all the work that he did for King Solomon on the house of the Lord:"
    },
    {
      "verse": 41,
      "text": "the two pillars, the two bowls of the capitals that were on the tops of the pillars, the two latticeworks to cover the two bowls of the capitals that were on the tops of the pillars;"
    },
    {
      "verse": 42,
      "text": "the four hundred pomegranates for the two latticeworks, two rows of pomegranates for each latticework, to cover the two bowls of the capitals that were on the pillars;"
    },
    {
      "verse": 43,
      "text": "the ten stands, the ten basins on the stands;"
    },
    {
      "verse": 44,
      "text": "the one sea, and the twelve oxen underneath the sea."
    },
    {
      "verse": 45,
      "text": "The pots, the shovels, and the basins, all these vessels that Hiram made for King Solomon for the house of the Lord were of burnished bronze."
    },
    {
      "verse": 46,
      "text": "In the plain of the Jordan the king cast them, in the clay ground between Succoth and Zarethan."
    },
    {
      "verse": 47,
      "text": "Solomon left all the vessels unweighed, because there were so many of them; the weight of the bronze was not determined."
    },
    {
      "verse": 48,
      "text": "So Solomon made all the vessels that were in the house of the Lord: the golden altar, the golden table for the bread of the Presence,"
    },
    {
      "verse": 49,
      "text": "the lampstands of pure gold, five on the south side and five on the north, in front of the inner sanctuary; the flowers, the lamps, and the tongs, of gold;"
    },
    {
      "verse": 50,
      "text": "the cups, snuffers, basins, dishes for incense, and firepans, of pure gold; the sockets for the doors of the innermost part of the house, the most holy place, and for the doors of the nave of the temple, of gold."
    },
    {
      "verse": 51,
      "text": "Thus all the work that King Solomon did on the house of the Lord was finished. Solomon brought in the things that his father David had dedicated, the silver, the gold, and the vessels, and stored them in the treasuries of the house of the Lord."
    }
  ],
  "timestamp": "2025-09-16T19:45:05.732301"
}