{
  "book": "1PE",
  "book_name": "1 Peter",
  "chapter": 5,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/1PE.5",
  "verses": [
    {
      "verse": 2,
      "text": "to tend the flock of God that is in your charge, exercising the oversight, not under compulsion but willingly, as God would have you do it —not for sordid gain but eagerly."
    },
    {
      "verse": 3,
      "text": "Do not lord it over those in your charge, but be examples to the flock."
    },
    {
      "verse": 4,
      "text": "And when the chief shepherd appears, you will win the crown of glory that never fades away."
    },
    {
      "verse": 5,
      "text": "In the same way, you who are younger must accept the authority of the elders. And all of you must clothe yourselves with humility in your dealings with one another, for “God opposes the proud, but gives grace to the humble.”"
    },
    {
      "verse": 6,
      "text": "Humble yourselves therefore under the mighty hand of God, so that he may exalt you in due time."
    },
    {
      "verse": 7,
      "text": "Cast all your anxiety on him, because he cares for you."
    },
    {
      "verse": 8,
      "text": "Discipline yourselves, keep alert. Like a roaring lion your adversary the devil prowls around, looking for someone to devour."
    },
    {
      "verse": 9,
      "text": "Resist him, steadfast in your faith, for you know that your brothers and sisters in all the world are undergoing the same kinds of suffering."
    },
    {
      "verse": 10,
      "text": "And after you have suffered for a little while, the God of all grace, who has called you to his eternal glory in Christ, will himself restore, support, strengthen, and establish you."
    },
    {
      "verse": 11,
      "text": "To him be the power forever and ever. Amen."
    },
    {
      "verse": 12,
      "text": "Through Silvanus, whom I consider a faithful brother, I have written this short letter to encourage you and to testify that this is the true grace of God. Stand fast in it."
    },
    {
      "verse": 13,
      "text": "Your sister church in Babylon, chosen together with you, sends you greetings; and so does my son Mark."
    },
    {
      "verse": 14,
      "text": "Greet one another with a kiss of love. Peace to all of you who are in Christ."
    }
  ],
  "timestamp": "2025-09-16T19:51:01.329470"
}