{
  "book": "1TI",
  "book_name": "1 Timothy",
  "chapter": 4,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/1TI.4",
  "verses": [
    {
      "verse": 1,
      "text": "Now the Spirit expressly says that in later times some will renounce the faith by paying attention to deceitful spirits and teachings of demons,"
    },
    {
      "verse": 2,
      "text": "through the hypocrisy of liars whose consciences are seared with a hot iron."
    },
    {
      "verse": 3,
      "text": "They forbid marriage and demand abstinence from foods, which God created to be received with thanksgiving by those who believe and know the truth."
    },
    {
      "verse": 4,
      "text": "For everything created by God is good, and nothing is to be rejected, provided it is received with thanksgiving;"
    },
    {
      "verse": 5,
      "text": "for it is sanctified by God's word and by prayer."
    },
    {
      "verse": 6,
      "text": "If you put these instructions before the brothers and sisters, you will be a good servant of Christ Jesus, nourished on the words of the faith and of the sound teaching that you have followed."
    },
    {
      "verse": 7,
      "text": "Have nothing to do with profane myths and old wives' tales. Train yourself in godliness,"
    },
    {
      "verse": 8,
      "text": "for, while physical training is of some value, godliness is valuable in every way, holding promise for both the present life and the life to come."
    },
    {
      "verse": 9,
      "text": "The saying is sure and worthy of full acceptance."
    },
    {
      "verse": 10,
      "text": "For to this end we toil and struggle, because we have our hope set on the living God, who is the Savior of all people, especially of those who believe."
    },
    {
      "verse": 11,
      "text": "These are the things you must insist on and teach."
    },
    {
      "verse": 12,
      "text": "Let no one despise your youth, but set the believers an example in speech and conduct, in love, in faith, in purity."
    },
    {
      "verse": 13,
      "text": "Until I arrive, give attention to the public reading of scripture, to exhorting, to teaching."
    },
    {
      "verse": 14,
      "text": "Do not neglect the gift that is in you, which was given to you through prophecy with the laying on of hands by the council of elders."
    },
    {
      "verse": 15,
      "text": "Put these things into practice, devote yourself to them, so that all may see your progress."
    },
    {
      "verse": 16,
      "text": "Pay close attention to yourself and to your teaching; continue in these things, for in doing this you will save both yourself and your hearers."
    }
  ],
  "timestamp": "2025-09-16T19:50:43.251763"
}