{
  "book": "2CH",
  "book_name": "2 Chronicles",
  "chapter": 19,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2CH.19",
  "verses": [
    {
      "verse": 1,
      "text": "King Jehoshaphat of Judah returned in safety to his house in Jerusalem."
    },
    {
      "verse": 2,
      "text": "Jehu son of Hanani the seer went out to meet him and said to King Jehoshaphat, “Should you help the wicked and love those who hate the Lord? Because of this, wrath has gone out against you from the Lord."
    },
    {
      "verse": 3,
      "text": "Nevertheless, some good is found in you, for you destroyed the sacred poles out of the land, and have set your heart to seek God.”"
    },
    {
      "verse": 4,
      "text": "Jehoshaphat resided at Jerusalem; then he went out again among the people, from Beer-sheba to the hill country of Ephraim, and brought them back to the Lord, the God of their ancestors."
    },
    {
      "verse": 5,
      "text": "He appointed judges in the land in all the fortified cities of Judah, city by city,"
    },
    {
      "verse": 6,
      "text": "and said to the judges, “Consider what you are doing, for you judge not on behalf of human beings but on the Lord 's behalf; he is with you in giving judgment."
    },
    {
      "verse": 7,
      "text": "Now, let the fear of the Lord be upon you; take care what you do, for there is no perversion of justice with the Lord our God, or partiality, or taking of bribes.”"
    },
    {
      "verse": 8,
      "text": "Moreover in Jerusalem Jehoshaphat appointed certain Levites and priests and heads of families of Israel, to give judgment for the Lord and to decide disputed cases. They had their seat at Jerusalem."
    },
    {
      "verse": 9,
      "text": "He charged them: “This is how you shall act: in the fear of the Lord, in faithfulness, and with your whole heart;"
    },
    {
      "verse": 10,
      "text": "whenever a case comes to you from your kindred who live in their cities, concerning bloodshed, law or commandment, statutes or ordinances, then you shall instruct them, so that they may not incur guilt before the Lord and wrath may not come on you and your kindred. Do so, and you will not incur guilt."
    },
    {
      "verse": 11,
      "text": "See, Amariah the chief priest is over you in all matters of the Lord; and Zebadiah son of Ishmael, the governor of the house of Judah, in all the king's matters; and the Levites will serve you as officers. Deal courageously, and may the Lord be with the good!”"
    }
  ],
  "timestamp": "2025-09-16T19:45:40.636593"
}