{
  "book": "2CH",
  "book_name": "2 Chronicles",
  "chapter": 13,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2CH.13",
  "verses": [
    {
      "verse": 1,
      "text": "In the eighteenth year of King Jeroboam, Abijah began to reign over Judah."
    },
    {
      "verse": 2,
      "text": "He reigned for three years in Jerusalem. His mother's name was Micaiah daughter of Uriel of Gibeah. Now there was war between Abijah and Jeroboam."
    },
    {
      "verse": 3,
      "text": "Abijah engaged in battle, having an army of valiant warriors, four hundred thousand picked men; and Jeroboam drew up his line of battle against him with eight hundred thousand picked mighty warriors."
    },
    {
      "verse": 4,
      "text": "Then Abijah stood on the slope of Mount Zemaraim that is in the hill country of Ephraim, and said, “Listen to me, Jeroboam and all Israel!"
    },
    {
      "verse": 5,
      "text": "Do you not know that the Lord God of Israel gave the kingship over Israel forever to David and his sons by a covenant of salt?"
    },
    {
      "verse": 6,
      "text": "Yet Jeroboam son of Nebat, a servant of Solomon son of David, rose up and rebelled against his lord;"
    },
    {
      "verse": 7,
      "text": "and certain worthless scoundrels gathered around him and defied Rehoboam son of Solomon, when Rehoboam was young and irresolute and could not withstand them."
    },
    {
      "verse": 8,
      "text": "“And now you think that you can withstand the kingdom of the Lord in the hand of the sons of David, because you are a great multitude and have with you the golden calves that Jeroboam made as gods for you."
    },
    {
      "verse": 9,
      "text": "Have you not driven out the priests of the Lord, the descendants of Aaron, and the Levites, and made priests for yourselves like the peoples of other lands? Whoever comes to be consecrated with a young bull or seven rams becomes a priest of what are no gods."
    },
    {
      "verse": 10,
      "text": "But as for us, the Lord is our God, and we have not abandoned him. We have priests ministering to the Lord who are descendants of Aaron, and Levites for their service."
    },
    {
      "verse": 11,
      "text": "They offer to the Lord every morning and every evening burnt offerings and fragrant incense, set out the rows of bread on the table of pure gold, and care for the golden lampstand so that its lamps may burn every evening; for we keep the charge of the Lord our God, but you have abandoned him."
    },
    {
      "verse": 12,
      "text": "See, God is with us at our head, and his priests have their battle trumpets to sound the call to battle against you. O Israelites, do not fight against the Lord, the God of your ancestors; for you cannot succeed.”"
    },
    {
      "verse": 13,
      "text": "Jeroboam had sent an ambush around to come on them from behind; thus his troops were in front of Judah, and the ambush was behind them."
    },
    {
      "verse": 14,
      "text": "When Judah turned, the battle was in front of them and behind them. They cried out to the Lord, and the priests blew the trumpets."
    },
    {
      "verse": 15,
      "text": "Then the people of Judah raised the battle shout. And when the people of Judah shouted, God defeated Jeroboam and all Israel before Abijah and Judah."
    },
    {
      "verse": 16,
      "text": "The Israelites fled before Judah, and God gave them into their hands."
    },
    {
      "verse": 17,
      "text": "Abijah and his army defeated them with great slaughter; five hundred thousand picked men of Israel fell slain."
    },
    {
      "verse": 18,
      "text": "Thus the Israelites were subdued at that time, and the people of Judah prevailed, because they relied on the Lord, the God of their ancestors."
    },
    {
      "verse": 19,
      "text": "Abijah pursued Jeroboam, and took cities from him: Bethel with its villages and Jeshanah with its villages and Ephron with its villages."
    },
    {
      "verse": 20,
      "text": "Jeroboam did not recover his power in the days of Abijah; the Lord struck him down, and he died."
    },
    {
      "verse": 21,
      "text": "But Abijah grew strong. He took fourteen wives, and became the father of twenty-two sons and sixteen daughters."
    },
    {
      "verse": 22,
      "text": "The rest of the acts of Abijah, his behavior and his deeds, are written in the story of the prophet Iddo."
    }
  ],
  "timestamp": "2025-09-16T19:45:39.120558"
}