{
  "book": "2CH",
  "book_name": "2 Chronicles",
  "chapter": 31,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2CH.31",
  "verses": [
    {
      "verse": 1,
      "text": "Now when all this was finished, all Israel who were present went out to the cities of Judah and broke down the pillars, hewed down the sacred poles, and pulled down the high places and the altars throughout all Judah and Benjamin, and in Ephraim and Manasseh, until they had destroyed them all. Then all the people of Israel returned to their cities, all to their individual properties."
    },
    {
      "verse": 2,
      "text": "Hezekiah appointed the divisions of the priests and of the Levites, division by division, everyone according to his service, the priests and the Levites, for burnt offerings and offerings of well-being, to minister in the gates of the camp of the Lord and to give thanks and praise."
    },
    {
      "verse": 3,
      "text": "The contribution of the king from his own possessions was for the burnt offerings: the burnt offerings of morning and evening, and the burnt offerings for the sabbaths, the new moons, and the appointed festivals, as it is written in the law of the Lord."
    },
    {
      "verse": 4,
      "text": "He commanded the people who lived in Jerusalem to give the portion due to the priests and the Levites, so that they might devote themselves to the law of the Lord."
    },
    {
      "verse": 5,
      "text": "As soon as the word spread, the people of Israel gave in abundance the first fruits of grain, wine, oil, honey, and of all the produce of the field; and they brought in abundantly the tithe of everything."
    },
    {
      "verse": 6,
      "text": "The people of Israel and Judah who lived in the cities of Judah also brought in the tithe of cattle and sheep, and the tithe of the dedicated things that had been consecrated to the Lord their God, and laid them in heaps."
    },
    {
      "verse": 7,
      "text": "In the third month they began to pile up the heaps, and finished them in the seventh month."
    },
    {
      "verse": 8,
      "text": "When Hezekiah and the officials came and saw the heaps, they blessed the Lord and his people Israel."
    },
    {
      "verse": 9,
      "text": "Hezekiah questioned the priests and the Levites about the heaps."
    },
    {
      "verse": 10,
      "text": "The chief priest Azariah, who was of the house of Zadok, answered him, “Since they began to bring the contributions into the house of the Lord, we have had enough to eat and have plenty to spare; for the Lord has blessed his people, so that we have this great supply left over.”"
    },
    {
      "verse": 11,
      "text": "Then Hezekiah commanded them to prepare store-chambers in the house of the Lord; and they prepared them."
    },
    {
      "verse": 12,
      "text": "Faithfully they brought in the contributions, the tithes and the dedicated things. The chief officer in charge of them was Conaniah the Levite, with his brother Shimei as second;"
    },
    {
      "verse": 13,
      "text": "while Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismachiah, Mahath, and Benaiah were overseers assisting Conaniah and his brother Shimei, by the appointment of King Hezekiah and of Azariah the chief officer of the house of God."
    },
    {
      "verse": 14,
      "text": "Kore son of Imnah the Levite, keeper of the east gate, was in charge of the freewill offerings to God, to apportion the contribution reserved for the Lord and the most holy offerings."
    },
    {
      "verse": 15,
      "text": "Eden, Miniamin, Jeshua, Shemaiah, Amariah, and Shecaniah were faithfully assisting him in the cities of the priests, to distribute the portions to their kindred, old and young alike, by divisions,"
    },
    {
      "verse": 16,
      "text": "except those enrolled by genealogy, males from three years old and upwards, all who entered the house of the Lord as the duty of each day required, for their service according to their offices, by their divisions."
    },
    {
      "verse": 17,
      "text": "The enrollment of the priests was according to their ancestral houses; that of the Levites from twenty years old and upwards was according to their offices, by their divisions."
    },
    {
      "verse": 18,
      "text": "The priests were enrolled with all their little children, their wives, their sons, and their daughters, the whole multitude; for they were faithful in keeping themselves holy."
    },
    {
      "verse": 19,
      "text": "And for the descendants of Aaron, the priests, who were in the fields of common land belonging to their towns, town by town, the people designated by name were to distribute portions to every male among the priests and to everyone among the Levites who was enrolled."
    },
    {
      "verse": 20,
      "text": "Hezekiah did this throughout all Judah; he did what was good and right and faithful before the Lord his God."
    },
    {
      "verse": 21,
      "text": "And every work that he undertook in the service of the house of God, and in accordance with the law and the commandments, to seek his God, he did with all his heart; and he prospered."
    }
  ],
  "timestamp": "2025-09-16T19:45:44.622627"
}