{
  "book": "2CH",
  "book_name": "2 Chronicles",
  "chapter": 9,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2CH.9",
  "verses": [
    {
      "verse": 1,
      "text": "When the queen of Sheba heard of the fame of Solomon, she came to Jerusalem to test him with hard questions, having a very great retinue and camels bearing spices and very much gold and precious stones. When she came to Solomon, she discussed with him all that was on her mind."
    },
    {
      "verse": 2,
      "text": "Solomon answered all her questions; there was nothing hidden from Solomon that he could not explain to her."
    },
    {
      "verse": 3,
      "text": "When the queen of Sheba had observed the wisdom of Solomon, the house that he had built,"
    },
    {
      "verse": 4,
      "text": "the food of his table, the seating of his officials, and the attendance of his servants, and their clothing, his valets, and their clothing, and his burnt offerings that he offered at the house of the Lord, there was no more spirit left in her."
    },
    {
      "verse": 5,
      "text": "So she said to the king, “The report was true that I heard in my own land of your accomplishments and of your wisdom,"
    },
    {
      "verse": 6,
      "text": "but I did not believe the reports until I came and my own eyes saw it. Not even half of the greatness of your wisdom had been told to me; you far surpass the report that I had heard."
    },
    {
      "verse": 7,
      "text": "Happy are your people! Happy are these your servants, who continually attend you and hear your wisdom!"
    },
    {
      "verse": 8,
      "text": "Blessed be the Lord your God, who has delighted in you and set you on his throne as king for the Lord your God. Because your God loved Israel and would establish them forever, he has made you king over them, that you may execute justice and righteousness.”"
    },
    {
      "verse": 9,
      "text": "Then she gave the king one hundred twenty talents of gold, a very great quantity of spices, and precious stones: there were no spices such as those that the queen of Sheba gave to King Solomon."
    },
    {
      "verse": 10,
      "text": "Moreover the servants of Huram and the servants of Solomon who brought gold from Ophir brought algum wood and precious stones."
    },
    {
      "verse": 11,
      "text": "From the algum wood, the king made steps for the house of the Lord and for the king's house, lyres also and harps for the singers; there never was seen the like of them before in the land of Judah."
    },
    {
      "verse": 12,
      "text": "Meanwhile King Solomon granted the queen of Sheba every desire that she expressed, well beyond what she had brought to the king. Then she returned to her own land, with her servants."
    },
    {
      "verse": 13,
      "text": "The weight of gold that came to Solomon in one year was six hundred sixty-six talents of gold,"
    },
    {
      "verse": 14,
      "text": "besides that which the traders and merchants brought; and all the kings of Arabia and the governors of the land brought gold and silver to Solomon."
    },
    {
      "verse": 15,
      "text": "King Solomon made two hundred large shields of beaten gold; six hundred shekels of beaten gold went into each large shield."
    },
    {
      "verse": 16,
      "text": "He made three hundred shields of beaten gold; three hundred shekels of gold went into each shield; and the king put them in the House of the Forest of Lebanon."
    },
    {
      "verse": 17,
      "text": "The king also made a great ivory throne, and overlaid it with pure gold."
    },
    {
      "verse": 18,
      "text": "The throne had six steps and a footstool of gold, which were attached to the throne, and on each side of the seat were arm rests and two lions standing beside the arm rests,"
    },
    {
      "verse": 19,
      "text": "while twelve lions were standing, one on each end of a step on the six steps. The like of it was never made in any kingdom."
    },
    {
      "verse": 20,
      "text": "All King Solomon's drinking vessels were of gold, and all the vessels of the House of the Forest of Lebanon were of pure gold; silver was not considered as anything in the days of Solomon."
    },
    {
      "verse": 21,
      "text": "For the king's ships went to Tarshish with the servants of Huram; once every three years the ships of Tarshish used to come bringing gold, silver, ivory, apes, and peacocks."
    },
    {
      "verse": 22,
      "text": "Thus King Solomon excelled all the kings of the earth in riches and in wisdom."
    },
    {
      "verse": 23,
      "text": "All the kings of the earth sought the presence of Solomon to hear his wisdom, which God had put into his mind."
    },
    {
      "verse": 24,
      "text": "Every one of them brought a present, objects of silver and gold, garments, weaponry, spices, horses, and mules, so much year by year."
    },
    {
      "verse": 25,
      "text": "Solomon had four thousand stalls for horses and chariots, and twelve thousand horses, which he stationed in the chariot cities and with the king in Jerusalem."
    },
    {
      "verse": 26,
      "text": "He ruled over all the kings from the Euphrates to the land of the Philistines, and to the border of Egypt."
    },
    {
      "verse": 27,
      "text": "The king made silver as common in Jerusalem as stone, and cedar as plentiful as the sycamore of the Shephelah."
    },
    {
      "verse": 28,
      "text": "Horses were imported for Solomon from Egypt and from all lands."
    },
    {
      "verse": 29,
      "text": "Now the rest of the acts of Solomon, from first to last, are they not written in the history of the prophet Nathan, and in the prophecy of Ahijah the Shilonite, and in the visions of the seer Iddo concerning Jeroboam son of Nebat?"
    },
    {
      "verse": 30,
      "text": "Solomon reigned in Jerusalem over all Israel forty years."
    },
    {
      "verse": 31,
      "text": "Solomon slept with his ancestors and was buried in the city of his father David; and his son Rehoboam succeeded him."
    }
  ],
  "timestamp": "2025-09-16T19:45:37.689268"
}