{
  "book": "2CH",
  "book_name": "2 Chronicles",
  "chapter": 3,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2CH.3",
  "verses": [
    {
      "verse": 1,
      "text": "Solomon began to build the house of the Lord in Jerusalem on Mount Moriah, where the Lord had appeared to his father David, at the place that David had designated, on the threshing floor of Ornan the Jebusite."
    },
    {
      "verse": 2,
      "text": "He began to build on the second day of the second month of the fourth year of his reign."
    },
    {
      "verse": 3,
      "text": "These are Solomon's measurements for building the house of God: the length, in cubits of the old standard, was sixty cubits, and the width twenty cubits."
    },
    {
      "verse": 4,
      "text": "The vestibule in front of the nave of the house was twenty cubits long, across the width of the house; and its height was one hundred twenty cubits. He overlaid it on the inside with pure gold."
    },
    {
      "verse": 5,
      "text": "The nave he lined with cypress, covered it with fine gold, and made palms and chains on it."
    },
    {
      "verse": 6,
      "text": "He adorned the house with settings of precious stones. The gold was gold from Parvaim."
    },
    {
      "verse": 7,
      "text": "So he lined the house with gold—its beams, its thresholds, its walls, and its doors; and he carved cherubim on the walls."
    },
    {
      "verse": 8,
      "text": "He made the most holy place; its length, corresponding to the width of the house, was twenty cubits, and its width was twenty cubits; he overlaid it with six hundred talents of fine gold."
    },
    {
      "verse": 9,
      "text": "The weight of the nails was fifty shekels of gold. He overlaid the upper chambers with gold."
    },
    {
      "verse": 10,
      "text": "In the most holy place he made two carved cherubim and overlaid them with gold."
    },
    {
      "verse": 11,
      "text": "The wings of the cherubim together extended twenty cubits: one wing of the one, five cubits long, touched the wall of the house, and its other wing, five cubits long, touched the wing of the other cherub;"
    },
    {
      "verse": 12,
      "text": "and of this cherub, one wing, five cubits long, touched the wall of the house, and the other wing, also five cubits long, was joined to the wing of the first cherub."
    },
    {
      "verse": 13,
      "text": "The wings of these cherubim extended twenty cubits; the cherubim stood on their feet, facing the nave."
    },
    {
      "verse": 14,
      "text": "And Solomon made the curtain of blue and purple and crimson fabrics and fine linen, and worked cherubim into it."
    },
    {
      "verse": 15,
      "text": "In front of the house he made two pillars thirty-five cubits high, with a capital of five cubits on the top of each."
    },
    {
      "verse": 16,
      "text": "He made encircling chains and put them on the tops of the pillars; and he made one hundred pomegranates, and put them on the chains."
    },
    {
      "verse": 17,
      "text": "He set up the pillars in front of the temple, one on the right, the other on the left; the one on the right he called Jachin, and the one on the left, Boaz."
    }
  ],
  "timestamp": "2025-09-16T19:45:35.461112"
}