{
  "book": "2CO",
  "book_name": "2 Corinthians",
  "chapter": 2,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2CO.2",
  "verses": [
    {
      "verse": 1,
      "text": "So I made up my mind not to make you another painful visit."
    },
    {
      "verse": 2,
      "text": "For if I cause you pain, who is there to make me glad but the one whom I have pained?"
    },
    {
      "verse": 3,
      "text": "And I wrote as I did, so that when I came, I might not suffer pain from those who should have made me rejoice; for I am confident about all of you, that my joy would be the joy of all of you."
    },
    {
      "verse": 4,
      "text": "For I wrote you out of much distress and anguish of heart and with many tears, not to cause you pain, but to let you know the abundant love that I have for you."
    },
    {
      "verse": 5,
      "text": "But if anyone has caused pain, he has caused it not to me, but to some extent—not to exaggerate it—to all of you."
    },
    {
      "verse": 6,
      "text": "This punishment by the majority is enough for such a person;"
    },
    {
      "verse": 7,
      "text": "so now instead you should forgive and console him, so that he may not be overwhelmed by excessive sorrow."
    },
    {
      "verse": 8,
      "text": "So I urge you to reaffirm your love for him."
    },
    {
      "verse": 9,
      "text": "I wrote for this reason: to test you and to know whether you are obedient in everything."
    },
    {
      "verse": 10,
      "text": "Anyone whom you forgive, I also forgive. What I have forgiven, if I have forgiven anything, has been for your sake in the presence of Christ."
    },
    {
      "verse": 11,
      "text": "And we do this so that we may not be outwitted by Satan; for we are not ignorant of his designs."
    },
    {
      "verse": 12,
      "text": "When I came to Troas to proclaim the good news of Christ, a door was opened for me in the Lord;"
    },
    {
      "verse": 13,
      "text": "but my mind could not rest because I did not find my brother Titus there. So I said farewell to them and went on to Macedonia."
    },
    {
      "verse": 14,
      "text": "But thanks be to God, who in Christ always leads us in triumphal procession, and through us spreads in every place the fragrance that comes from knowing him."
    },
    {
      "verse": 15,
      "text": "For we are the aroma of Christ to God among those who are being saved and among those who are perishing;"
    },
    {
      "verse": 16,
      "text": "to the one a fragrance from death to death, to the other a fragrance from life to life. Who is sufficient for these things?"
    },
    {
      "verse": 17,
      "text": "For we are not peddlers of God's word like so many; but in Christ we speak as persons of sincerity, as persons sent from God and standing in his presence."
    }
  ],
  "timestamp": "2025-09-16T19:50:21.620474"
}