{
  "book": "2SA",
  "book_name": "2 Samuel",
  "chapter": 16,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2SA.16",
  "verses": [
    {
      "verse": 1,
      "text": "When David had passed a little beyond the summit, Ziba the servant of Mephibosheth met him, with a couple of donkeys saddled, carrying two hundred loaves of bread, one hundred bunches of raisins, one hundred of summer fruits, and one skin of wine."
    },
    {
      "verse": 2,
      "text": "The king said to Ziba, “Why have you brought these?” Ziba answered, “The donkeys are for the king's household to ride, the bread and summer fruit for the young men to eat, and the wine is for those to drink who faint in the wilderness.”"
    },
    {
      "verse": 3,
      "text": "The king said, “And where is your master's son?” Ziba said to the king, “He remains in Jerusalem; for he said, ‘Today the house of Israel will give me back my grandfather's kingdom.’ ”"
    },
    {
      "verse": 4,
      "text": "Then the king said to Ziba, “All that belonged to Mephibosheth is now yours.” Ziba said, “I do obeisance; let me find favor in your sight, my lord the king.”"
    },
    {
      "verse": 5,
      "text": "When King David came to Bahurim, a man of the family of the house of Saul came out whose name was Shimei son of Gera; he came out cursing."
    },
    {
      "verse": 6,
      "text": "He threw stones at David and at all the servants of King David; now all the people and all the warriors were on his right and on his left."
    },
    {
      "verse": 7,
      "text": "Shimei shouted while he cursed, “Out! Out! Murderer! Scoundrel!"
    },
    {
      "verse": 8,
      "text": "The Lord has avenged on all of you the blood of the house of Saul, in whose place you have reigned; and the Lord has given the kingdom into the hand of your son Absalom. See, disaster has overtaken you; for you are a man of blood.”"
    },
    {
      "verse": 9,
      "text": "Then Abishai son of Zeruiah said to the king, “Why should this dead dog curse my lord the king? Let me go over and take off his head.”"
    },
    {
      "verse": 10,
      "text": "But the king said, “What have I to do with you, you sons of Zeruiah? If he is cursing because the Lord has said to him, ‘Curse David,’ who then shall say, ‘Why have you done so?’ ”"
    },
    {
      "verse": 11,
      "text": "David said to Abishai and to all his servants, “My own son seeks my life; how much more now may this Benjaminite! Let him alone, and let him curse; for the Lord has bidden him."
    },
    {
      "verse": 12,
      "text": "It may be that the Lord will look on my distress, and the Lord will repay me with good for this cursing of me today.”"
    },
    {
      "verse": 13,
      "text": "So David and his men went on the road, while Shimei went along on the hillside opposite him and cursed as he went, throwing stones and flinging dust at him."
    },
    {
      "verse": 14,
      "text": "The king and all the people who were with him arrived weary at the Jordan; and there he refreshed himself."
    },
    {
      "verse": 15,
      "text": "Now Absalom and all the Israelites came to Jerusalem; Ahithophel was with him."
    },
    {
      "verse": 16,
      "text": "When Hushai the Archite, David's friend, came to Absalom, Hushai said to Absalom, “Long live the king! Long live the king!”"
    },
    {
      "verse": 17,
      "text": "Absalom said to Hushai, “Is this your loyalty to your friend? Why did you not go with your friend?”"
    },
    {
      "verse": 18,
      "text": "Hushai said to Absalom, “No; but the one whom the Lord and this people and all the Israelites have chosen, his I will be, and with him I will remain."
    },
    {
      "verse": 19,
      "text": "Moreover, whom should I serve? Should it not be his son? Just as I have served your father, so I will serve you.”"
    },
    {
      "verse": 20,
      "text": "Then Absalom said to Ahithophel, “Give us your counsel; what shall we do?”"
    },
    {
      "verse": 21,
      "text": "Ahithophel said to Absalom, “Go in to your father's concubines, the ones he has left to look after the house; and all Israel will hear that you have made yourself odious to your father, and the hands of all who are with you will be strengthened.”"
    },
    {
      "verse": 22,
      "text": "So they pitched a tent for Absalom upon the roof; and Absalom went in to his father's concubines in the sight of all Israel."
    },
    {
      "verse": 23,
      "text": "Now in those days the counsel that Ahithophel gave was as if one consulted the oracle of God; so all the counsel of Ahithophel was esteemed, both by David and by Absalom."
    }
  ],
  "timestamp": "2025-09-16T19:44:59.475889"
}