{
  "book": "2SA",
  "book_name": "2 Samuel",
  "chapter": 1,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2SA.1",
  "verses": [
    {
      "verse": 1,
      "text": "After the death of Saul, when David had returned from defeating the Amalekites, David remained two days in Ziklag."
    },
    {
      "verse": 2,
      "text": "On the third day, a man came from Saul's camp, with his clothes torn and dirt on his head. When he came to David, he fell to the ground and did obeisance."
    },
    {
      "verse": 3,
      "text": "David said to him, “Where have you come from?” He said to him, “I have escaped from the camp of Israel.”"
    },
    {
      "verse": 4,
      "text": "David said to him, “How did things go? Tell me!” He answered, “The army fled from the battle, but also many of the army fell and died; and Saul and his son Jonathan also died.”"
    },
    {
      "verse": 5,
      "text": "Then David asked the young man who was reporting to him, “How do you know that Saul and his son Jonathan died?”"
    },
    {
      "verse": 6,
      "text": "The young man reporting to him said, “I happened to be on Mount Gilboa; and there was Saul leaning on his spear, while the chariots and the horsemen drew close to him."
    },
    {
      "verse": 7,
      "text": "When he looked behind him, he saw me, and called to me. I answered, ‘Here sir.’"
    },
    {
      "verse": 8,
      "text": "And he said to me, ‘Who are you?’ I answered him, ‘I am an Amalekite.’"
    },
    {
      "verse": 9,
      "text": "He said to me, ‘Come, stand over me and kill me; for convulsions have seized me, and yet my life still lingers.’"
    },
    {
      "verse": 10,
      "text": "So I stood over him, and killed him, for I knew that he could not live after he had fallen. I took the crown that was on his head and the armlet that was on his arm, and I have brought them here to my lord.”"
    },
    {
      "verse": 11,
      "text": "Then David took hold of his clothes and tore them; and all the men who were with him did the same."
    },
    {
      "verse": 12,
      "text": "They mourned and wept, and fasted until evening for Saul and for his son Jonathan, and for the army of the Lord and for the house of Israel, because they had fallen by the sword."
    },
    {
      "verse": 13,
      "text": "David said to the young man who had reported to him, “Where do you come from?” He answered, “I am the son of a resident alien, an Amalekite.”"
    },
    {
      "verse": 14,
      "text": "David said to him, “Were you not afraid to lift your hand to destroy the Lord 's anointed?”"
    },
    {
      "verse": 15,
      "text": "Then David called one of the young men and said, “Come here and strike him down.” So he struck him down and he died."
    },
    {
      "verse": 16,
      "text": "David said to him, “Your blood be on your head; for your own mouth has testified against you, saying, ‘I have killed the Lord 's anointed.’ ”"
    },
    {
      "verse": 17,
      "text": "David intoned this lamentation over Saul and his son Jonathan."
    },
    {
      "verse": 18,
      "text": "(He ordered that The Song of the Bow be taught to the people of Judah; it is written in the Book of Jashar.) He said:"
    },
    {
      "verse": 19,
      "text": "Your glory, O Israel, lies slain upon your high places! How the mighty have fallen!"
    },
    {
      "verse": 20,
      "text": "Tell it not in Gath, proclaim it not in the streets of Ashkelon; or the daughters of the Philistines will rejoice, the daughters of the uncircumcised will exult."
    },
    {
      "verse": 21,
      "text": "You mountains of Gilboa, let there be no dew or rain upon you, nor bounteous fields! For there the shield of the mighty was defiled, the shield of Saul, anointed with oil no more."
    },
    {
      "verse": 22,
      "text": "From the blood of the slain, from the fat of the mighty, the bow of Jonathan did not turn back, nor the sword of Saul return empty."
    },
    {
      "verse": 23,
      "text": "Saul and Jonathan, beloved and lovely! In life and in death they were not divided; they were swifter than eagles, they were stronger than lions."
    },
    {
      "verse": 24,
      "text": "O daughters of Israel, weep over Saul, who clothed you with crimson, in luxury, who put ornaments of gold on your apparel."
    },
    {
      "verse": 25,
      "text": "How the mighty have fallen in the midst of the battle! Jonathan lies slain upon your high places."
    },
    {
      "verse": 26,
      "text": "I am distressed for you, my brother Jonathan; greatly beloved were you to me; your love to me was wonderful, passing the love of women."
    },
    {
      "verse": 27,
      "text": "How the mighty have fallen, and the weapons of war perished!"
    }
  ],
  "timestamp": "2025-09-16T19:44:54.793804"
}