{
  "book": "2SA",
  "book_name": "2 Samuel",
  "chapter": 21,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2SA.21",
  "verses": [
    {
      "verse": 1,
      "text": "Now there was a famine in the days of David for three years, year after year; and David inquired of the Lord. The Lord said, “There is bloodguilt on Saul and on his house, because he put the Gibeonites to death.”"
    },
    {
      "verse": 2,
      "text": "So the king called the Gibeonites and spoke to them. (Now the Gibeonites were not of the people of Israel, but of the remnant of the Amorites; although the people of Israel had sworn to spare them, Saul had tried to wipe them out in his zeal for the people of Israel and Judah.)"
    },
    {
      "verse": 3,
      "text": "David said to the Gibeonites, “What shall I do for you? How shall I make expiation, that you may bless the heritage of the Lord?”"
    },
    {
      "verse": 4,
      "text": "The Gibeonites said to him, “It is not a matter of silver or gold between us and Saul or his house; neither is it for us to put anyone to death in Israel.” He said, “What do you say that I should do for you?”"
    },
    {
      "verse": 5,
      "text": "They said to the king, “The man who consumed us and planned to destroy us, so that we should have no place in all the territory of Israel—"
    },
    {
      "verse": 6,
      "text": "let seven of his sons be handed over to us, and we will impale them before the Lord at Gibeon on the mountain of the Lord.” The king said, “I will hand them over.”"
    },
    {
      "verse": 7,
      "text": "But the king spared Mephibosheth, the son of Saul's son Jonathan, because of the oath of the Lord that was between them, between David and Jonathan son of Saul."
    },
    {
      "verse": 8,
      "text": "The king took the two sons of Rizpah daughter of Aiah, whom she bore to Saul, Armoni and Mephibosheth; and the five sons of Merab daughter of Saul, whom she bore to Adriel son of Barzillai the Meholathite;"
    },
    {
      "verse": 9,
      "text": "he gave them into the hands of the Gibeonites, and they impaled them on the mountain before the Lord. The seven of them perished together. They were put to death in the first days of harvest, at the beginning of barley harvest."
    },
    {
      "verse": 10,
      "text": "Then Rizpah the daughter of Aiah took sackcloth, and spread it on a rock for herself, from the beginning of harvest until rain fell on them from the heavens; she did not allow the birds of the air to come on the bodies by day, or the wild animals by night."
    },
    {
      "verse": 11,
      "text": "When David was told what Rizpah daughter of Aiah, the concubine of Saul, had done,"
    },
    {
      "verse": 12,
      "text": "David went and took the bones of Saul and the bones of his son Jonathan from the people of Jabesh-gilead, who had stolen them from the public square of Beth-shan, where the Philistines had hung them up, on the day the Philistines killed Saul on Gilboa."
    },
    {
      "verse": 13,
      "text": "He brought up from there the bones of Saul and the bones of his son Jonathan; and they gathered the bones of those who had been impaled."
    },
    {
      "verse": 14,
      "text": "They buried the bones of Saul and of his son Jonathan in the land of Benjamin in Zela, in the tomb of his father Kish; they did all that the king commanded. After that, God heeded supplications for the land."
    },
    {
      "verse": 15,
      "text": "The Philistines went to war again with Israel, and David went down together with his servants. They fought against the Philistines, and David grew weary."
    },
    {
      "verse": 16,
      "text": "Ishbi-benob, one of the descendants of the giants, whose spear weighed three hundred shekels of bronze, and who was fitted out with new weapons, said he would kill David."
    },
    {
      "verse": 17,
      "text": "But Abishai son of Zeruiah came to his aid, and attacked the Philistine and killed him. Then David's men swore to him, “You shall not go out with us to battle any longer, so that you do not quench the lamp of Israel.”"
    },
    {
      "verse": 18,
      "text": "After this a battle took place with the Philistines, at Gob; then Sibbecai the Hushathite killed Saph, who was one of the descendants of the giants."
    },
    {
      "verse": 19,
      "text": "Then there was another battle with the Philistines at Gob; and Elhanan son of Jaare-oregim, the Bethlehemite, killed Goliath the Gittite, the shaft of whose spear was like a weaver's beam."
    },
    {
      "verse": 20,
      "text": "There was again war at Gath, where there was a man of great size, who had six fingers on each hand, and six toes on each foot, twenty-four in number; he too was descended from the giants."
    },
    {
      "verse": 21,
      "text": "When he taunted Israel, Jonathan son of David's brother Shimei, killed him."
    },
    {
      "verse": 22,
      "text": "These four were descended from the giants in Gath; they fell by the hands of David and his servants."
    }
  ],
  "timestamp": "2025-09-16T19:45:00.872723"
}