{
  "book": "2SA",
  "book_name": "2 Samuel",
  "chapter": 2,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2SA.2",
  "verses": [
    {
      "verse": 1,
      "text": "After this David inquired of the Lord, “Shall I go up into any of the cities of Judah?” The Lord said to him, “Go up.” David said, “To which shall I go up?” He said, “To Hebron.”"
    },
    {
      "verse": 2,
      "text": "So David went up there, along with his two wives, Ahinoam of Jezreel, and Abigail the widow of Nabal of Carmel."
    },
    {
      "verse": 3,
      "text": "David brought up the men who were with him, every one with his household; and they settled in the towns of Hebron."
    },
    {
      "verse": 4,
      "text": "Then the people of Judah came, and there they anointed David king over the house of Judah. When they told David, “It was the people of Jabesh-gilead who buried Saul,”"
    },
    {
      "verse": 5,
      "text": "David sent messengers to the people of Jabesh-gilead, and said to them, “May you be blessed by the Lord, because you showed this loyalty to Saul your lord, and buried him!"
    },
    {
      "verse": 6,
      "text": "Now may the Lord show steadfast love and faithfulness to you! And I too will reward you because you have done this thing."
    },
    {
      "verse": 7,
      "text": "Therefore let your hands be strong, and be valiant; for Saul your lord is dead, and the house of Judah has anointed me king over them.”"
    },
    {
      "verse": 8,
      "text": "But Abner son of Ner, commander of Saul's army, had taken Ishbaal son of Saul, and brought him over to Mahanaim."
    },
    {
      "verse": 9,
      "text": "He made him king over Gilead, the Ashurites, Jezreel, Ephraim, Benjamin, and over all Israel."
    },
    {
      "verse": 10,
      "text": "Ishbaal, Saul's son, was forty years old when he began to reign over Israel, and he reigned two years. But the house of Judah followed David."
    },
    {
      "verse": 11,
      "text": "The time that David was king in Hebron over the house of Judah was seven years and six months."
    },
    {
      "verse": 12,
      "text": "Abner son of Ner, and the servants of Ishbaal son of Saul, went out from Mahanaim to Gibeon."
    },
    {
      "verse": 13,
      "text": "Joab son of Zeruiah, and the servants of David, went out and met them at the pool of Gibeon. One group sat on one side of the pool, while the other sat on the other side of the pool."
    },
    {
      "verse": 14,
      "text": "Abner said to Joab, “Let the young men come forward and have a contest before us.” Joab said, “Let them come forward.”"
    },
    {
      "verse": 15,
      "text": "So they came forward and were counted as they passed by, twelve for Benjamin and Ishbaal son of Saul, and twelve of the servants of David."
    },
    {
      "verse": 16,
      "text": "Each grasped his opponent by the head, and thrust his sword in his opponent's side; so they fell down together. Therefore that place was called Helkath-hazzurim, which is at Gibeon."
    },
    {
      "verse": 17,
      "text": "The battle was very fierce that day; and Abner and the men of Israel were beaten by the servants of David."
    },
    {
      "verse": 18,
      "text": "The three sons of Zeruiah were there, Joab, Abishai, and Asahel. Now Asahel was as swift of foot as a wild gazelle."
    },
    {
      "verse": 19,
      "text": "Asahel pursued Abner, turning neither to the right nor to the left as he followed him."
    },
    {
      "verse": 20,
      "text": "Then Abner looked back and said, “Is it you, Asahel?” He answered, “Yes, it is.”"
    },
    {
      "verse": 21,
      "text": "Abner said to him, “Turn to your right or to your left, and seize one of the young men, and take his spoil.” But Asahel would not turn away from following him."
    },
    {
      "verse": 22,
      "text": "Abner said again to Asahel, “Turn away from following me; why should I strike you to the ground? How then could I show my face to your brother Joab?”"
    },
    {
      "verse": 23,
      "text": "But he refused to turn away. So Abner struck him in the stomach with the butt of his spear, so that the spear came out at his back. He fell there, and died where he lay. And all those who came to the place where Asahel had fallen and died, stood still."
    },
    {
      "verse": 24,
      "text": "But Joab and Abishai pursued Abner. As the sun was going down they came to the hill of Ammah, which lies before Giah on the way to the wilderness of Gibeon."
    },
    {
      "verse": 25,
      "text": "The Benjaminites rallied around Abner and formed a single band; they took their stand on the top of a hill."
    },
    {
      "verse": 26,
      "text": "Then Abner called to Joab, “Is the sword to keep devouring forever? Do you not know that the end will be bitter? How long will it be before you order your people to turn from the pursuit of their kinsmen?”"
    },
    {
      "verse": 27,
      "text": "Joab said, “As God lives, if you had not spoken, the people would have continued to pursue their kinsmen, not stopping until morning.”"
    },
    {
      "verse": 28,
      "text": "Joab sounded the trumpet and all the people stopped; they no longer pursued Israel or engaged in battle any further."
    },
    {
      "verse": 29,
      "text": "Abner and his men traveled all that night through the Arabah; they crossed the Jordan, and, marching the whole forenoon, they came to Mahanaim."
    },
    {
      "verse": 30,
      "text": "Joab returned from the pursuit of Abner; and when he had gathered all the people together, there were missing of David's servants nineteen men besides Asahel."
    },
    {
      "verse": 31,
      "text": "But the servants of David had killed of Benjamin three hundred sixty of Abner's men."
    },
    {
      "verse": 32,
      "text": "They took up Asahel and buried him in the tomb of his father, which was at Bethlehem. Joab and his men marched all night, and the day broke upon them at Hebron."
    }
  ],
  "timestamp": "2025-09-16T19:44:55.725055"
}