{
  "book": "2SA",
  "book_name": "2 Samuel",
  "chapter": 23,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/2SA.23",
  "verses": [
    {
      "verse": 1,
      "text": "Now these are the last words of David: The oracle of David, son of Jesse, the oracle of the man whom God exalted, the anointed of the God of Jacob, the favorite of the Strong One of Israel:"
    },
    {
      "verse": 2,
      "text": "The spirit of the Lord speaks through me, his word is upon my tongue."
    },
    {
      "verse": 3,
      "text": "The God of Israel has spoken, the Rock of Israel has said to me: One who rules over people justly, ruling in the fear of God,"
    },
    {
      "verse": 4,
      "text": "is like the light of morning, like the sun rising on a cloudless morning, gleaming from the rain on the grassy land."
    },
    {
      "verse": 5,
      "text": "Is not my house like this with God? For he has made with me an everlasting covenant, ordered in all things and secure. Will he not cause to prosper all my help and my desire?"
    },
    {
      "verse": 6,
      "text": "But the godless are all like thorns that are thrown away; for they cannot be picked up with the hand;"
    },
    {
      "verse": 7,
      "text": "to touch them one uses an iron bar or the shaft of a spear. And they are entirely consumed in fire on the spot."
    },
    {
      "verse": 8,
      "text": "These are the names of the warriors whom David had: Josheb-basshebeth a Tahchemonite; he was chief of the Three; he wielded his spear against eight hundred whom he killed at one time."
    },
    {
      "verse": 9,
      "text": "Next to him among the three warriors was Eleazar son of Dodo son of Ahohi. He was with David when they defied the Philistines who were gathered there for battle. The Israelites withdrew,"
    },
    {
      "verse": 10,
      "text": "but he stood his ground. He struck down the Philistines until his arm grew weary, though his hand clung to the sword. The Lord brought about a great victory that day. Then the people came back to him—but only to strip the dead."
    },
    {
      "verse": 11,
      "text": "Next to him was Shammah son of Agee, the Hararite. The Philistines gathered together at Lehi, where there was a plot of ground full of lentils; and the army fled from the Philistines."
    },
    {
      "verse": 12,
      "text": "But he took his stand in the middle of the plot, defended it, and killed the Philistines; and the Lord brought about a great victory."
    },
    {
      "verse": 13,
      "text": "Towards the beginning of harvest three of the thirty chiefs went down to join David at the cave of Adullam, while a band of Philistines was encamped in the valley of Rephaim."
    },
    {
      "verse": 14,
      "text": "David was then in the stronghold; and the garrison of the Philistines was then at Bethlehem."
    },
    {
      "verse": 15,
      "text": "David said longingly, “O that someone would give me water to drink from the well of Bethlehem that is by the gate!”"
    },
    {
      "verse": 16,
      "text": "Then the three warriors broke through the camp of the Philistines, drew water from the well of Bethlehem that was by the gate, and brought it to David. But he would not drink of it; he poured it out to the Lord,"
    },
    {
      "verse": 17,
      "text": "for he said, “The Lord forbid that I should do this. Can I drink the blood of the men who went at the risk of their lives?” Therefore he would not drink it. The three warriors did these things."
    },
    {
      "verse": 18,
      "text": "Now Abishai son of Zeruiah, the brother of Joab, was chief of the Thirty. With his spear he fought against three hundred men and killed them, and won a name beside the Three."
    },
    {
      "verse": 19,
      "text": "He was the most renowned of the Thirty, and became their commander; but he did not attain to the Three."
    },
    {
      "verse": 20,
      "text": "Benaiah son of Jehoiada was a valiant warrior from Kabzeel, a doer of great deeds; he struck down two sons of Ariel of Moab. He also went down and killed a lion in a pit on a day when snow had fallen."
    },
    {
      "verse": 21,
      "text": "And he killed an Egyptian, a handsome man. The Egyptian had a spear in his hand; but Benaiah went against him with a staff, snatched the spear out of the Egyptian's hand, and killed him with his own spear."
    },
    {
      "verse": 22,
      "text": "Such were the things Benaiah son of Jehoiada did, and won a name beside the three warriors."
    },
    {
      "verse": 23,
      "text": "He was renowned among the Thirty, but he did not attain to the Three. And David put him in charge of his bodyguard."
    },
    {
      "verse": 24,
      "text": "Among the Thirty were Asahel brother of Joab; Elhanan son of Dodo of Bethlehem;"
    },
    {
      "verse": 25,
      "text": "Shammah of Harod; Elika of Harod;"
    },
    {
      "verse": 26,
      "text": "Helez the Paltite; Ira son of Ikkesh of Tekoa;"
    },
    {
      "verse": 27,
      "text": "Abiezer of Anathoth; Mebunnai the Hushathite;"
    },
    {
      "verse": 28,
      "text": "Zalmon the Ahohite; Maharai of Netophah;"
    },
    {
      "verse": 29,
      "text": "Heleb son of Baanah of Netophah; Ittai son of Ribai of Gibeah of the Benjaminites;"
    },
    {
      "verse": 30,
      "text": "Benaiah of Pirathon; Hiddai of the torrents of Gaash;"
    },
    {
      "verse": 31,
      "text": "Abi-albon the Arbathite; Azmaveth of Bahurim;"
    },
    {
      "verse": 32,
      "text": "Eliahba of Shaalbon; the sons of Jashen: Jonathan"
    },
    {
      "verse": 33,
      "text": "son of Shammah the Hararite; Ahiam son of Sharar the Hararite;"
    },
    {
      "verse": 34,
      "text": "Eliphelet son of Ahasbai of Maacah; Eliam son of Ahithophel the Gilonite;"
    },
    {
      "verse": 35,
      "text": "Hezro of Carmel; Paarai the Arbite;"
    },
    {
      "verse": 36,
      "text": "Igal son of Nathan of Zobah; Bani the Gadite;"
    },
    {
      "verse": 37,
      "text": "Zelek the Ammonite; Naharai of Beeroth, the armor-bearer of Joab son of Zeruiah;"
    },
    {
      "verse": 38,
      "text": "Ira the Ithrite; Gareb the Ithrite;"
    },
    {
      "verse": 39,
      "text": "Uriah the Hittite—thirty-seven in all."
    }
  ],
  "timestamp": "2025-09-16T19:45:01.408747"
}