{
  "book": "ACT",
  "book_name": "Acts",
  "chapter": 15,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/ACT.15",
  "verses": [
    {
      "verse": 1,
      "text": "Then certain individuals came down from Judea and were teaching the brothers, “Unless you are circumcised according to the custom of Moses, you cannot be saved.”"
    },
    {
      "verse": 2,
      "text": "And after Paul and Barnabas had no small dissension and debate with them, Paul and Barnabas and some of the others were appointed to go up to Jerusalem to discuss this question with the apostles and the elders."
    },
    {
      "verse": 3,
      "text": "So they were sent on their way by the church, and as they passed through both Phoenicia and Samaria, they reported the conversion of the Gentiles, and brought great joy to all the believers."
    },
    {
      "verse": 4,
      "text": "When they came to Jerusalem, they were welcomed by the church and the apostles and the elders, and they reported all that God had done with them."
    },
    {
      "verse": 5,
      "text": "But some believers who belonged to the sect of the Pharisees stood up and said, “It is necessary for them to be circumcised and ordered to keep the law of Moses.”"
    },
    {
      "verse": 6,
      "text": "The apostles and the elders met together to consider this matter."
    },
    {
      "verse": 7,
      "text": "After there had been much debate, Peter stood up and said to them, “My brothers, you know that in the early days God made a choice among you, that I should be the one through whom the Gentiles would hear the message of the good news and become believers."
    },
    {
      "verse": 8,
      "text": "And God, who knows the human heart, testified to them by giving them the Holy Spirit, just as he did to us;"
    },
    {
      "verse": 9,
      "text": "and in cleansing their hearts by faith he has made no distinction between them and us."
    },
    {
      "verse": 10,
      "text": "Now therefore why are you putting God to the test by placing on the neck of the disciples a yoke that neither our ancestors nor we have been able to bear?"
    },
    {
      "verse": 11,
      "text": "On the contrary, we believe that we will be saved through the grace of the Lord Jesus, just as they will.”"
    },
    {
      "verse": 12,
      "text": "The whole assembly kept silence, and listened to Barnabas and Paul as they told of all the signs and wonders that God had done through them among the Gentiles."
    },
    {
      "verse": 13,
      "text": "After they finished speaking, James replied, “My brothers, listen to me."
    },
    {
      "verse": 14,
      "text": "Simeon has related how God first looked favorably on the Gentiles, to take from among them a people for his name."
    },
    {
      "verse": 15,
      "text": "This agrees with the words of the prophets, as it is written,"
    },
    {
      "verse": 16,
      "text": "‘After this I will return, and I will rebuild the dwelling of David, which has fallen; from its ruins I will rebuild it, and I will set it up,"
    },
    {
      "verse": 17,
      "text": "so that all other peoples may seek the Lord— even all the Gentiles over whom my name has been called. Thus says the Lord, who has been making these things"
    },
    {
      "verse": 18,
      "text": "known from long ago.’"
    },
    {
      "verse": 19,
      "text": "Therefore I have reached the decision that we should not trouble those Gentiles who are turning to God,"
    },
    {
      "verse": 20,
      "text": "but we should write to them to abstain only from things polluted by idols and from fornication and from whatever has been strangled and from blood."
    },
    {
      "verse": 21,
      "text": "For in every city, for generations past, Moses has had those who proclaim him, for he has been read aloud every sabbath in the synagogues.”"
    },
    {
      "verse": 22,
      "text": "Then the apostles and the elders, with the consent of the whole church, decided to choose men from among their members and to send them to Antioch with Paul and Barnabas. They sent Judas called Barsabbas, and Silas, leaders among the brothers,"
    },
    {
      "verse": 23,
      "text": "with the following letter: “The brothers, both the apostles and the elders, to the believers of Gentile origin in Antioch and Syria and Cilicia, greetings."
    },
    {
      "verse": 24,
      "text": "Since we have heard that certain persons who have gone out from us, though with no instructions from us, have said things to disturb you and have unsettled your minds,"
    },
    {
      "verse": 25,
      "text": "we have decided unanimously to choose representatives and send them to you, along with our beloved Barnabas and Paul,"
    },
    {
      "verse": 26,
      "text": "who have risked their lives for the sake of our Lord Jesus Christ."
    },
    {
      "verse": 27,
      "text": "We have therefore sent Judas and Silas, who themselves will tell you the same things by word of mouth."
    },
    {
      "verse": 28,
      "text": "For it has seemed good to the Holy Spirit and to us to impose on you no further burden than these essentials:"
    },
    {
      "verse": 29,
      "text": "that you abstain from what has been sacrificed to idols and from blood and from what is strangled and from fornication. If you keep yourselves from these, you will do well. Farewell.”"
    },
    {
      "verse": 30,
      "text": "So they were sent off and went down to Antioch. When they gathered the congregation together, they delivered the letter."
    },
    {
      "verse": 31,
      "text": "When its members read it, they rejoiced at the exhortation."
    },
    {
      "verse": 32,
      "text": "Judas and Silas, who were themselves prophets, said much to encourage and strengthen the believers."
    },
    {
      "verse": 33,
      "text": "After they had been there for some time, they were sent off in peace by the believers to those who had sent them."
    },
    {
      "verse": 35,
      "text": "But Paul and Barnabas remained in Antioch, and there, with many others, they taught and proclaimed the word of the Lord."
    },
    {
      "verse": 36,
      "text": "After some days Paul said to Barnabas, “Come, let us return and visit the believers in every city where we proclaimed the word of the Lord and see how they are doing.”"
    },
    {
      "verse": 37,
      "text": "Barnabas wanted to take with them John called Mark."
    },
    {
      "verse": 38,
      "text": "But Paul decided not to take with them one who had deserted them in Pamphylia and had not accompanied them in the work."
    },
    {
      "verse": 39,
      "text": "The disagreement became so sharp that they parted company; Barnabas took Mark with him and sailed away to Cyprus."
    },
    {
      "verse": 40,
      "text": "But Paul chose Silas and set out, the believers commending him to the grace of the Lord."
    },
    {
      "verse": 41,
      "text": "He went through Syria and Cilicia, strengthening the churches."
    }
  ],
  "timestamp": "2025-09-16T19:50:00.925500"
}