{
  "book": "COL",
  "book_name": "Colossians",
  "chapter": 2,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/COL.2",
  "verses": [
    {
      "verse": 1,
      "text": "For I want you to know how much I am struggling for you, and for those in Laodicea, and for all who have not seen me face to face."
    },
    {
      "verse": 2,
      "text": "I want their hearts to be encouraged and united in love, so that they may have all the riches of assured understanding and have the knowledge of God's mystery, that is, Christ himself,"
    },
    {
      "verse": 3,
      "text": "in whom are hidden all the treasures of wisdom and knowledge."
    },
    {
      "verse": 4,
      "text": "I am saying this so that no one may deceive you with plausible arguments."
    },
    {
      "verse": 5,
      "text": "For though I am absent in body, yet I am with you in spirit, and I rejoice to see your morale and the firmness of your faith in Christ."
    },
    {
      "verse": 6,
      "text": "As you therefore have received Christ Jesus the Lord, continue to live your lives in him,"
    },
    {
      "verse": 7,
      "text": "rooted and built up in him and established in the faith, just as you were taught, abounding in thanksgiving."
    },
    {
      "verse": 8,
      "text": "See to it that no one takes you captive through philosophy and empty deceit, according to human tradition, according to the elemental spirits of the universe, and not according to Christ."
    },
    {
      "verse": 9,
      "text": "For in him the whole fullness of deity dwells bodily,"
    },
    {
      "verse": 10,
      "text": "and you have come to fullness in him, who is the head of every ruler and authority."
    },
    {
      "verse": 11,
      "text": "In him also you were circumcised with a spiritual circumcision, by putting off the body of the flesh in the circumcision of Christ;"
    },
    {
      "verse": 12,
      "text": "when you were buried with him in baptism, you were also raised with him through faith in the power of God, who raised him from the dead."
    },
    {
      "verse": 13,
      "text": "And when you were dead in trespasses and the uncircumcision of your flesh, God made you alive together with him, when he forgave us all our trespasses,"
    },
    {
      "verse": 14,
      "text": "erasing the record that stood against us with its legal demands. He set this aside, nailing it to the cross."
    },
    {
      "verse": 15,
      "text": "He disarmed the rulers and authorities and made a public example of them, triumphing over them in it."
    },
    {
      "verse": 16,
      "text": "Therefore do not let anyone condemn you in matters of food and drink or of observing festivals, new moons, or sabbaths."
    },
    {
      "verse": 17,
      "text": "These are only a shadow of what is to come, but the substance belongs to Christ."
    },
    {
      "verse": 18,
      "text": "Do not let anyone disqualify you, insisting on self-abasement and worship of angels, dwelling on visions, puffed up without cause by a human way of thinking,"
    },
    {
      "verse": 19,
      "text": "and not holding fast to the head, from whom the whole body, nourished and held together by its ligaments and sinews, grows with a growth that is from God."
    },
    {
      "verse": 20,
      "text": "If with Christ you died to the elemental spirits of the universe, why do you live as if you still belonged to the world? Why do you submit to regulations,"
    },
    {
      "verse": 21,
      "text": "“Do not handle, Do not taste, Do not touch”?"
    },
    {
      "verse": 22,
      "text": "All these regulations refer to things that perish with use; they are simply human commands and teachings."
    },
    {
      "verse": 23,
      "text": "These have indeed an appearance of wisdom in promoting self-imposed piety, humility, and severe treatment of the body, but they are of no value in checking self-indulgence."
    }
  ],
  "timestamp": "2025-09-16T19:50:34.437916"
}