{
  "book": "DEU",
  "book_name": "Deuteronomy",
  "chapter": 20,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/DEU.20",
  "verses": [
    {
      "verse": 1,
      "text": "When you go out to war against your enemies, and see horses and chariots, an army larger than your own, you shall not be afraid of them; for the Lord your God is with you, who brought you up from the land of Egypt."
    },
    {
      "verse": 2,
      "text": "Before you engage in battle, the priest shall come forward and speak to the troops,"
    },
    {
      "verse": 3,
      "text": "and shall say to them: “Hear, O Israel! Today you are drawing near to do battle against your enemies. Do not lose heart, or be afraid, or panic, or be in dread of them;"
    },
    {
      "verse": 4,
      "text": "for it is the Lord your God who goes with you, to fight for you against your enemies, to give you victory.”"
    },
    {
      "verse": 5,
      "text": "Then the officials shall address the troops, saying, “Has anyone built a new house but not dedicated it? He should go back to his house, or he might die in the battle and another dedicate it."
    },
    {
      "verse": 6,
      "text": "Has anyone planted a vineyard but not yet enjoyed its fruit? He should go back to his house, or he might die in the battle and another be first to enjoy its fruit."
    },
    {
      "verse": 7,
      "text": "Has anyone become engaged to a woman but not yet married her? He should go back to his house, or he might die in the battle and another marry her.”"
    },
    {
      "verse": 8,
      "text": "The officials shall continue to address the troops, saying, “Is anyone afraid or disheartened? He should go back to his house, or he might cause the heart of his comrades to melt like his own.”"
    },
    {
      "verse": 9,
      "text": "When the officials have finished addressing the troops, then the commanders shall take charge of them."
    },
    {
      "verse": 10,
      "text": "When you draw near to a town to fight against it, offer it terms of peace."
    },
    {
      "verse": 11,
      "text": "If it accepts your terms of peace and surrenders to you, then all the people in it shall serve you at forced labor."
    },
    {
      "verse": 12,
      "text": "If it does not submit to you peacefully, but makes war against you, then you shall besiege it;"
    },
    {
      "verse": 13,
      "text": "and when the Lord your God gives it into your hand, you shall put all its males to the sword."
    },
    {
      "verse": 14,
      "text": "You may, however, take as your booty the women, the children, livestock, and everything else in the town, all its spoil. You may enjoy the spoil of your enemies, which the Lord your God has given you."
    },
    {
      "verse": 15,
      "text": "Thus you shall treat all the towns that are very far from you, which are not towns of the nations here."
    },
    {
      "verse": 16,
      "text": "But as for the towns of these peoples that the Lord your God is giving you as an inheritance, you must not let anything that breathes remain alive."
    },
    {
      "verse": 17,
      "text": "You shall annihilate them—the Hittites and the Amorites, the Canaanites and the Perizzites, the Hivites and the Jebusites—just as the Lord your God has commanded,"
    },
    {
      "verse": 18,
      "text": "so that they may not teach you to do all the abhorrent things that they do for their gods, and you thus sin against the Lord your God."
    },
    {
      "verse": 19,
      "text": "If you besiege a town for a long time, making war against it in order to take it, you must not destroy its trees by wielding an ax against them. Although you may take food from them, you must not cut them down. Are trees in the field human beings that they should come under siege from you?"
    },
    {
      "verse": 20,
      "text": "You may destroy only the trees that you know do not produce food; you may cut them down for use in building siegeworks against the town that makes war with you, until it falls."
    }
  ],
  "timestamp": "2025-09-16T19:44:15.663731"
}