{
  "book": "DEU",
  "book_name": "Deuteronomy",
  "chapter": 11,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/DEU.11",
  "verses": [
    {
      "verse": 1,
      "text": "You shall love the Lord your God, therefore, and keep his charge, his decrees, his ordinances, and his commandments always."
    },
    {
      "verse": 2,
      "text": "Remember today that it was not your children (who have not known or seen the discipline of the Lord your God), but it is you who must acknowledge his greatness, his mighty hand and his outstretched arm,"
    },
    {
      "verse": 3,
      "text": "his signs and his deeds that he did in Egypt to Pharaoh, the king of Egypt, and to all his land;"
    },
    {
      "verse": 4,
      "text": "what he did to the Egyptian army, to their horses and chariots, how he made the water of the Red Sea flow over them as they pursued you, so that the Lord has destroyed them to this day;"
    },
    {
      "verse": 5,
      "text": "what he did to you in the wilderness, until you came to this place;"
    },
    {
      "verse": 6,
      "text": "and what he did to Dathan and Abiram, sons of Eliab son of Reuben, how in the midst of all Israel the earth opened its mouth and swallowed them up, along with their households, their tents, and every living being in their company;"
    },
    {
      "verse": 7,
      "text": "for it is your own eyes that have seen every great deed that the Lord did."
    },
    {
      "verse": 8,
      "text": "Keep, then, this entire commandment that I am commanding you today, so that you may have strength to go in and occupy the land that you are crossing over to occupy,"
    },
    {
      "verse": 9,
      "text": "and so that you may live long in the land that the Lord swore to your ancestors to give them and to their descendants, a land flowing with milk and honey."
    },
    {
      "verse": 10,
      "text": "For the land that you are about to enter to occupy is not like the land of Egypt, from which you have come, where you sow your seed and irrigate by foot like a vegetable garden."
    },
    {
      "verse": 11,
      "text": "But the land that you are crossing over to occupy is a land of hills and valleys, watered by rain from the sky,"
    },
    {
      "verse": 12,
      "text": "a land that the Lord your God looks after. The eyes of the Lord your God are always on it, from the beginning of the year to the end of the year."
    },
    {
      "verse": 13,
      "text": "If you will only heed his every commandment that I am commanding you today—loving the Lord your God, and serving him with all your heart and with all your soul—"
    },
    {
      "verse": 14,
      "text": "then he will give the rain for your land in its season, the early rain and the later rain, and you will gather in your grain, your wine, and your oil;"
    },
    {
      "verse": 15,
      "text": "and he will give grass in your fields for your livestock, and you will eat your fill."
    },
    {
      "verse": 16,
      "text": "Take care, or you will be seduced into turning away, serving other gods and worshiping them,"
    },
    {
      "verse": 17,
      "text": "for then the anger of the Lord will be kindled against you and he will shut up the heavens, so that there will be no rain and the land will yield no fruit; then you will perish quickly off the good land that the Lord is giving you."
    },
    {
      "verse": 18,
      "text": "You shall put these words of mine in your heart and soul, and you shall bind them as a sign on your hand, and fix them as an emblem on your forehead."
    },
    {
      "verse": 19,
      "text": "Teach them to your children, talking about them when you are at home and when you are away, when you lie down and when you rise."
    },
    {
      "verse": 20,
      "text": "Write them on the doorposts of your house and on your gates,"
    },
    {
      "verse": 21,
      "text": "so that your days and the days of your children may be multiplied in the land that the Lord swore to your ancestors to give them, as long as the heavens are above the earth."
    },
    {
      "verse": 22,
      "text": "If you will diligently observe this entire commandment that I am commanding you, loving the Lord your God, walking in all his ways, and holding fast to him,"
    },
    {
      "verse": 23,
      "text": "then the Lord will drive out all these nations before you, and you will dispossess nations larger and mightier than yourselves."
    },
    {
      "verse": 24,
      "text": "Every place on which you set foot shall be yours; your territory shall extend from the wilderness to the Lebanon and from the River, the river Euphrates, to the Western Sea."
    },
    {
      "verse": 25,
      "text": "No one will be able to stand against you; the Lord your God will put the fear and dread of you on all the land on which you set foot, as he promised you."
    },
    {
      "verse": 26,
      "text": "See, I am setting before you today a blessing and a curse:"
    },
    {
      "verse": 27,
      "text": "the blessing, if you obey the commandments of the Lord your God that I am commanding you today;"
    },
    {
      "verse": 28,
      "text": "and the curse, if you do not obey the commandments of the Lord your God, but turn from the way that I am commanding you today, to follow other gods that you have not known."
    },
    {
      "verse": 29,
      "text": "When the Lord your God has brought you into the land that you are entering to occupy, you shall set the blessing on Mount Gerizim and the curse on Mount Ebal."
    },
    {
      "verse": 30,
      "text": "As you know, they are beyond the Jordan, some distance to the west, in the land of the Canaanites who live in the Arabah, opposite Gilgal, beside the oak of Moreh."
    },
    {
      "verse": 31,
      "text": "When you cross the Jordan to go in to occupy the land that the Lord your God is giving you, and when you occupy it and live in it,"
    },
    {
      "verse": 32,
      "text": "you must diligently observe all the statutes and ordinances that I am setting before you today."
    }
  ],
  "timestamp": "2025-09-16T19:44:11.583035"
}