{
  "book": "DEU",
  "book_name": "Deuteronomy",
  "chapter": 30,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/DEU.30",
  "verses": [
    {
      "verse": 1,
      "text": "When all these things have happened to you, the blessings and the curses that I have set before you, if you call them to mind among all the nations where the Lord your God has driven you,"
    },
    {
      "verse": 2,
      "text": "and return to the Lord your God, and you and your children obey him with all your heart and with all your soul, just as I am commanding you today,"
    },
    {
      "verse": 3,
      "text": "then the Lord your God will restore your fortunes and have compassion on you, gathering you again from all the peoples among whom the Lord your God has scattered you."
    },
    {
      "verse": 4,
      "text": "Even if you are exiled to the ends of the world, from there the Lord your God will gather you, and from there he will bring you back."
    },
    {
      "verse": 5,
      "text": "The Lord your God will bring you into the land that your ancestors possessed, and you will possess it; he will make you more prosperous and numerous than your ancestors."
    },
    {
      "verse": 6,
      "text": "Moreover, the Lord your God will circumcise your heart and the heart of your descendants, so that you will love the Lord your God with all your heart and with all your soul, in order that you may live."
    },
    {
      "verse": 7,
      "text": "The Lord your God will put all these curses on your enemies and on the adversaries who took advantage of you."
    },
    {
      "verse": 8,
      "text": "Then you shall again obey the Lord, observing all his commandments that I am commanding you today,"
    },
    {
      "verse": 9,
      "text": "and the Lord your God will make you abundantly prosperous in all your undertakings, in the fruit of your body, in the fruit of your livestock, and in the fruit of your soil. For the Lord will again take delight in prospering you, just as he delighted in prospering your ancestors,"
    },
    {
      "verse": 10,
      "text": "when you obey the Lord your God by observing his commandments and decrees that are written in this book of the law, because you turn to the Lord your God with all your heart and with all your soul."
    },
    {
      "verse": 11,
      "text": "Surely, this commandment that I am commanding you today is not too hard for you, nor is it too far away."
    },
    {
      "verse": 12,
      "text": "It is not in heaven, that you should say, “Who will go up to heaven for us, and get it for us so that we may hear it and observe it?”"
    },
    {
      "verse": 13,
      "text": "Neither is it beyond the sea, that you should say, “Who will cross to the other side of the sea for us, and get it for us so that we may hear it and observe it?”"
    },
    {
      "verse": 14,
      "text": "No, the word is very near to you; it is in your mouth and in your heart for you to observe."
    },
    {
      "verse": 15,
      "text": "See, I have set before you today life and prosperity, death and adversity."
    },
    {
      "verse": 16,
      "text": "If you obey the commandments of the Lord your God that I am commanding you today, by loving the Lord your God, walking in his ways, and observing his commandments, decrees, and ordinances, then you shall live and become numerous, and the Lord your God will bless you in the land that you are entering to possess."
    },
    {
      "verse": 17,
      "text": "But if your heart turns away and you do not hear, but are led astray to bow down to other gods and serve them,"
    },
    {
      "verse": 18,
      "text": "I declare to you today that you shall perish; you shall not live long in the land that you are crossing the Jordan to enter and possess."
    },
    {
      "verse": 19,
      "text": "I call heaven and earth to witness against you today that I have set before you life and death, blessings and curses. Choose life so that you and your descendants may live,"
    },
    {
      "verse": 20,
      "text": "loving the Lord your God, obeying him, and holding fast to him; for that means life to you and length of days, so that you may live in the land that the Lord swore to give to your ancestors, to Abraham, to Isaac, and to Jacob."
    }
  ],
  "timestamp": "2025-09-16T19:44:20.158948"
}