{
  "book": "ECC",
  "book_name": "Ecclesiastes",
  "chapter": 10,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/ECC.10",
  "verses": [
    {
      "verse": 1,
      "text": "Dead flies make the perfumer's ointment give off a foul odor; so a little folly outweighs wisdom and honor."
    },
    {
      "verse": 2,
      "text": "The heart of the wise inclines to the right, but the heart of a fool to the left."
    },
    {
      "verse": 3,
      "text": "Even when fools walk on the road, they lack sense, and show to everyone that they are fools."
    },
    {
      "verse": 4,
      "text": "If the anger of the ruler rises against you, do not leave your post, for calmness will undo great offenses."
    },
    {
      "verse": 5,
      "text": "There is an evil that I have seen under the sun, as great an error as if it proceeded from the ruler:"
    },
    {
      "verse": 6,
      "text": "folly is set in many high places, and the rich sit in a low place."
    },
    {
      "verse": 7,
      "text": "I have seen slaves on horseback, and princes walking on foot like slaves."
    },
    {
      "verse": 8,
      "text": "Whoever digs a pit will fall into it; and whoever breaks through a wall will be bitten by a snake."
    },
    {
      "verse": 9,
      "text": "Whoever quarries stones will be hurt by them; and whoever splits logs will be endangered by them."
    },
    {
      "verse": 10,
      "text": "If the iron is blunt, and one does not whet the edge, then more strength must be exerted; but wisdom helps one to succeed."
    },
    {
      "verse": 11,
      "text": "If the snake bites before it is charmed, there is no advantage in a charmer."
    },
    {
      "verse": 12,
      "text": "Words spoken by the wise bring them favor, but the lips of fools consume them."
    },
    {
      "verse": 13,
      "text": "The words of their mouths begin in foolishness, and their talk ends in wicked madness;"
    },
    {
      "verse": 14,
      "text": "yet fools talk on and on. No one knows what is to happen, and who can tell anyone what the future holds?"
    },
    {
      "verse": 15,
      "text": "The toil of fools wears them out, for they do not even know the way to town."
    },
    {
      "verse": 16,
      "text": "Alas for you, O land, when your king is a servant, and your princes feast in the morning!"
    },
    {
      "verse": 17,
      "text": "Happy are you, O land, when your king is a nobleman, and your princes feast at the proper time— for strength, and not for drunkenness!"
    },
    {
      "verse": 18,
      "text": "Through sloth the roof sinks in, and through indolence the house leaks."
    },
    {
      "verse": 19,
      "text": "Feasts are made for laughter; wine gladdens life, and money meets every need."
    },
    {
      "verse": 20,
      "text": "Do not curse the king, even in your thoughts, or curse the rich, even in your bedroom; for a bird of the air may carry your voice, or some winged creature tell the matter."
    }
  ],
  "timestamp": "2025-09-16T19:47:26.432764"
}