{
  "book": "EPH",
  "book_name": "Ephesians",
  "chapter": 3,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EPH.3",
  "verses": [
    {
      "verse": 1,
      "text": "This is the reason that I Paul am a prisoner for Christ Jesus for the sake of you Gentiles—"
    },
    {
      "verse": 2,
      "text": "for surely you have already heard of the commission of God's grace that was given me for you,"
    },
    {
      "verse": 3,
      "text": "and how the mystery was made known to me by revelation, as I wrote above in a few words,"
    },
    {
      "verse": 4,
      "text": "a reading of which will enable you to perceive my understanding of the mystery of Christ."
    },
    {
      "verse": 5,
      "text": "In former generations this mystery was not made known to humankind, as it has now been revealed to his holy apostles and prophets by the Spirit:"
    },
    {
      "verse": 7,
      "text": "Of this gospel I have become a servant according to the gift of God's grace that was given me by the working of his power."
    },
    {
      "verse": 8,
      "text": "Although I am the very least of all the saints, this grace was given to me to bring to the Gentiles the news of the boundless riches of Christ,"
    },
    {
      "verse": 9,
      "text": "and to make everyone see what is the plan of the mystery hidden for ages in God who created all things;"
    },
    {
      "verse": 10,
      "text": "so that through the church the wisdom of God in its rich variety might now be made known to the rulers and authorities in the heavenly places."
    },
    {
      "verse": 11,
      "text": "This was in accordance with the eternal purpose that he has carried out in Christ Jesus our Lord,"
    },
    {
      "verse": 12,
      "text": "in whom we have access to God in boldness and confidence through faith in him."
    },
    {
      "verse": 13,
      "text": "I pray therefore that you may not lose heart over my sufferings for you; they are your glory."
    },
    {
      "verse": 14,
      "text": "For this reason I bow my knees before the Father,"
    },
    {
      "verse": 15,
      "text": "from whom every family in heaven and on earth takes its name."
    },
    {
      "verse": 16,
      "text": "I pray that, according to the riches of his glory, he may grant that you may be strengthened in your inner being with power through his Spirit,"
    },
    {
      "verse": 17,
      "text": "and that Christ may dwell in your hearts through faith, as you are being rooted and grounded in love."
    },
    {
      "verse": 18,
      "text": "I pray that you may have the power to comprehend, with all the saints, what is the breadth and length and height and depth,"
    },
    {
      "verse": 19,
      "text": "and to know the love of Christ that surpasses knowledge, so that you may be filled with all the fullness of God."
    },
    {
      "verse": 20,
      "text": "Now to him who by the power at work within us is able to accomplish abundantly far more than all we can ask or imagine,"
    },
    {
      "verse": 21,
      "text": "to him be glory in the church and in Christ Jesus to all generations, forever and ever. Amen."
    }
  ],
  "timestamp": "2025-09-16T19:50:29.687977"
}