{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 23,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EXO.23",
  "verses": [
    {
      "verse": 1,
      "text": "You shall not spread a false report. You shall not join hands with the wicked to act as a malicious witness."
    },
    {
      "verse": 2,
      "text": "You shall not follow a majority in wrongdoing; when you bear witness in a lawsuit, you shall not side with the majority so as to pervert justice;"
    },
    {
      "verse": 3,
      "text": "nor shall you be partial to the poor in a lawsuit."
    },
    {
      "verse": 4,
      "text": "When you come upon your enemy's ox or donkey going astray, you shall bring it back."
    },
    {
      "verse": 5,
      "text": "When you see the donkey of one who hates you lying under its burden and you would hold back from setting it free, you must help to set it free."
    },
    {
      "verse": 6,
      "text": "You shall not pervert the justice due to your poor in their lawsuits."
    },
    {
      "verse": 7,
      "text": "Keep far from a false charge, and do not kill the innocent and those in the right, for I will not acquit the guilty."
    },
    {
      "verse": 8,
      "text": "You shall take no bribe, for a bribe blinds the officials, and subverts the cause of those who are in the right."
    },
    {
      "verse": 9,
      "text": "You shall not oppress a resident alien; you know the heart of an alien, for you were aliens in the land of Egypt."
    },
    {
      "verse": 10,
      "text": "For six years you shall sow your land and gather in its yield;"
    },
    {
      "verse": 11,
      "text": "but the seventh year you shall let it rest and lie fallow, so that the poor of your people may eat; and what they leave the wild animals may eat. You shall do the same with your vineyard, and with your olive orchard."
    },
    {
      "verse": 12,
      "text": "Six days you shall do your work, but on the seventh day you shall rest, so that your ox and your donkey may have relief, and your homeborn slave and the resident alien may be refreshed."
    },
    {
      "verse": 13,
      "text": "Be attentive to all that I have said to you. Do not invoke the names of other gods; do not let them be heard on your lips."
    },
    {
      "verse": 14,
      "text": "Three times in the year you shall hold a festival for me."
    },
    {
      "verse": 15,
      "text": "You shall observe the festival of unleavened bread; as I commanded you, you shall eat unleavened bread for seven days at the appointed time in the month of Abib, for in it you came out of Egypt. No one shall appear before me empty-handed."
    },
    {
      "verse": 16,
      "text": "You shall observe the festival of harvest, of the first fruits of your labor, of what you sow in the field. You shall observe the festival of ingathering at the end of the year, when you gather in from the field the fruit of your labor."
    },
    {
      "verse": 17,
      "text": "Three times in the year all your males shall appear before the Lord God."
    },
    {
      "verse": 18,
      "text": "You shall not offer the blood of my sacrifice with anything leavened, or let the fat of my festival remain until the morning."
    },
    {
      "verse": 19,
      "text": "The choicest of the first fruits of your ground you shall bring into the house of the Lord your God. You shall not boil a kid in its mother's milk."
    },
    {
      "verse": 20,
      "text": "I am going to send an angel in front of you, to guard you on the way and to bring you to the place that I have prepared."
    },
    {
      "verse": 21,
      "text": "Be attentive to him and listen to his voice; do not rebel against him, for he will not pardon your transgression; for my name is in him."
    },
    {
      "verse": 22,
      "text": "But if you listen attentively to his voice and do all that I say, then I will be an enemy to your enemies and a foe to your foes."
    },
    {
      "verse": 23,
      "text": "When my angel goes in front of you, and brings you to the Amorites, the Hittites, the Perizzites, the Canaanites, the Hivites, and the Jebusites, and I blot them out,"
    },
    {
      "verse": 24,
      "text": "you shall not bow down to their gods, or worship them, or follow their practices, but you shall utterly demolish them and break their pillars in pieces."
    },
    {
      "verse": 25,
      "text": "You shall worship the Lord your God, and I will bless your bread and your water; and I will take sickness away from among you."
    },
    {
      "verse": 26,
      "text": "No one shall miscarry or be barren in your land; I will fulfill the number of your days."
    },
    {
      "verse": 27,
      "text": "I will send my terror in front of you, and will throw into confusion all the people against whom you shall come, and I will make all your enemies turn their backs to you."
    },
    {
      "verse": 28,
      "text": "And I will send the pestilence in front of you, which shall drive out the Hivites, the Canaanites, and the Hittites from before you."
    },
    {
      "verse": 29,
      "text": "I will not drive them out from before you in one year, or the land would become desolate and the wild animals would multiply against you."
    },
    {
      "verse": 30,
      "text": "Little by little I will drive them out from before you, until you have increased and possess the land."
    },
    {
      "verse": 31,
      "text": "I will set your borders from the Red Sea to the sea of the Philistines, and from the wilderness to the Euphrates; for I will hand over to you the inhabitants of the land, and you shall drive them out before you."
    },
    {
      "verse": 32,
      "text": "You shall make no covenant with them and their gods."
    },
    {
      "verse": 33,
      "text": "They shall not live in your land, or they will make you sin against me; for if you worship their gods, it will surely be a snare to you."
    }
  ],
  "timestamp": "2025-09-16T19:43:35.931456"
}