{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 21,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EXO.21",
  "verses": [
    {
      "verse": 1,
      "text": "These are the ordinances that you shall set before them:"
    },
    {
      "verse": 2,
      "text": "When you buy a male Hebrew slave, he shall serve six years, but in the seventh he shall go out a free person, without debt."
    },
    {
      "verse": 3,
      "text": "If he comes in single, he shall go out single; if he comes in married, then his wife shall go out with him."
    },
    {
      "verse": 4,
      "text": "If his master gives him a wife and she bears him sons or daughters, the wife and her children shall be her master's and he shall go out alone."
    },
    {
      "verse": 5,
      "text": "But if the slave declares, “I love my master, my wife, and my children; I will not go out a free person,”"
    },
    {
      "verse": 6,
      "text": "then his master shall bring him before God. He shall be brought to the door or the doorpost; and his master shall pierce his ear with an awl; and he shall serve him for life."
    },
    {
      "verse": 7,
      "text": "When a man sells his daughter as a slave, she shall not go out as the male slaves do."
    },
    {
      "verse": 8,
      "text": "If she does not please her master, who designated her for himself, then he shall let her be redeemed; he shall have no right to sell her to a foreign people, since he has dealt unfairly with her."
    },
    {
      "verse": 9,
      "text": "If he designates her for his son, he shall deal with her as with a daughter."
    },
    {
      "verse": 10,
      "text": "If he takes another wife to himself, he shall not diminish the food, clothing, or marital rights of the first wife."
    },
    {
      "verse": 11,
      "text": "And if he does not do these three things for her, she shall go out without debt, without payment of money."
    },
    {
      "verse": 12,
      "text": "Whoever strikes a person mortally shall be put to death."
    },
    {
      "verse": 13,
      "text": "If it was not premeditated, but came about by an act of God, then I will appoint for you a place to which the killer may flee."
    },
    {
      "verse": 14,
      "text": "But if someone willfully attacks and kills another by treachery, you shall take the killer from my altar for execution."
    },
    {
      "verse": 15,
      "text": "Whoever strikes father or mother shall be put to death."
    },
    {
      "verse": 16,
      "text": "Whoever kidnaps a person, whether that person has been sold or is still held in possession, shall be put to death."
    },
    {
      "verse": 17,
      "text": "Whoever curses father or mother shall be put to death."
    },
    {
      "verse": 18,
      "text": "When individuals quarrel and one strikes the other with a stone or fist so that the injured party, though not dead, is confined to bed,"
    },
    {
      "verse": 19,
      "text": "but recovers and walks around outside with the help of a staff, then the assailant shall be free of liability, except to pay for the loss of time, and to arrange for full recovery."
    },
    {
      "verse": 20,
      "text": "When a slaveowner strikes a male or female slave with a rod and the slave dies immediately, the owner shall be punished."
    },
    {
      "verse": 21,
      "text": "But if the slave survives a day or two, there is no punishment; for the slave is the owner's property."
    },
    {
      "verse": 22,
      "text": "When people who are fighting injure a pregnant woman so that there is a miscarriage, and yet no further harm follows, the one responsible shall be fined what the woman's husband demands, paying as much as the judges determine."
    },
    {
      "verse": 23,
      "text": "If any harm follows, then you shall give life for life,"
    },
    {
      "verse": 24,
      "text": "eye for eye, tooth for tooth, hand for hand, foot for foot,"
    },
    {
      "verse": 25,
      "text": "burn for burn, wound for wound, stripe for stripe."
    },
    {
      "verse": 26,
      "text": "When a slaveowner strikes the eye of a male or female slave, destroying it, the owner shall let the slave go, a free person, to compensate for the eye."
    },
    {
      "verse": 27,
      "text": "If the owner knocks out a tooth of a male or female slave, the slave shall be let go, a free person, to compensate for the tooth."
    },
    {
      "verse": 28,
      "text": "When an ox gores a man or a woman to death, the ox shall be stoned, and its flesh shall not be eaten; but the owner of the ox shall not be liable."
    },
    {
      "verse": 29,
      "text": "If the ox has been accustomed to gore in the past, and its owner has been warned but has not restrained it, and it kills a man or a woman, the ox shall be stoned, and its owner also shall be put to death."
    },
    {
      "verse": 30,
      "text": "If a ransom is imposed on the owner, then the owner shall pay whatever is imposed for the redemption of the victim's life."
    },
    {
      "verse": 31,
      "text": "If it gores a boy or a girl, the owner shall be dealt with according to this same rule."
    },
    {
      "verse": 32,
      "text": "If the ox gores a male or female slave, the owner shall pay to the slaveowner thirty shekels of silver, and the ox shall be stoned."
    },
    {
      "verse": 33,
      "text": "If someone leaves a pit open, or digs a pit and does not cover it, and an ox or a donkey falls into it,"
    },
    {
      "verse": 34,
      "text": "the owner of the pit shall make restitution, giving money to its owner, but keeping the dead animal."
    },
    {
      "verse": 35,
      "text": "If someone's ox hurts the ox of another, so that it dies, then they shall sell the live ox and divide the price of it; and the dead animal they shall also divide."
    },
    {
      "verse": 36,
      "text": "But if it was known that the ox was accustomed to gore in the past, and its owner has not restrained it, the owner shall restore ox for ox, but keep the dead animal."
    }
  ],
  "timestamp": "2025-09-16T19:43:34.628409"
}