{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 4,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EXO.4",
  "verses": [
    {
      "verse": 1,
      "text": "Then Moses answered, “But suppose they do not believe me or listen to me, but say, ‘The Lord did not appear to you.’ ”"
    },
    {
      "verse": 2,
      "text": "The Lord said to him, “What is that in your hand?” He said, “A staff.”"
    },
    {
      "verse": 3,
      "text": "And he said, “Throw it on the ground.” So he threw the staff on the ground, and it became a snake; and Moses drew back from it."
    },
    {
      "verse": 4,
      "text": "Then the Lord said to Moses, “Reach out your hand, and seize it by the tail”—so he reached out his hand and grasped it, and it became a staff in his hand—"
    },
    {
      "verse": 5,
      "text": "“so that they may believe that the Lord, the God of their ancestors, the God of Abraham, the God of Isaac, and the God of Jacob, has appeared to you.”"
    },
    {
      "verse": 6,
      "text": "Again, the Lord said to him, “Put your hand inside your cloak.” He put his hand into his cloak; and when he took it out, his hand was leprous, as white as snow."
    },
    {
      "verse": 7,
      "text": "Then God said, “Put your hand back into your cloak”—so he put his hand back into his cloak, and when he took it out, it was restored like the rest of his body—"
    },
    {
      "verse": 8,
      "text": "“If they will not believe you or heed the first sign, they may believe the second sign."
    },
    {
      "verse": 9,
      "text": "If they will not believe even these two signs or heed you, you shall take some water from the Nile and pour it on the dry ground; and the water that you shall take from the Nile will become blood on the dry ground.”"
    },
    {
      "verse": 10,
      "text": "But Moses said to the Lord, “O my Lord, I have never been eloquent, neither in the past nor even now that you have spoken to your servant; but I am slow of speech and slow of tongue.”"
    },
    {
      "verse": 11,
      "text": "Then the Lord said to him, “Who gives speech to mortals? Who makes them mute or deaf, seeing or blind? Is it not I, the Lord?"
    },
    {
      "verse": 12,
      "text": "Now go, and I will be with your mouth and teach you what you are to speak.”"
    },
    {
      "verse": 13,
      "text": "But he said, “O my Lord, please send someone else.”"
    },
    {
      "verse": 14,
      "text": "Then the anger of the Lord was kindled against Moses and he said, “What of your brother Aaron, the Levite? I know that he can speak fluently; even now he is coming out to meet you, and when he sees you his heart will be glad."
    },
    {
      "verse": 15,
      "text": "You shall speak to him and put the words in his mouth; and I will be with your mouth and with his mouth, and will teach you what you shall do."
    },
    {
      "verse": 16,
      "text": "He indeed shall speak for you to the people; he shall serve as a mouth for you, and you shall serve as God for him."
    },
    {
      "verse": 17,
      "text": "Take in your hand this staff, with which you shall perform the signs.”"
    },
    {
      "verse": 18,
      "text": "Moses went back to his father-in-law Jethro and said to him, “Please let me go back to my kindred in Egypt and see whether they are still living.” And Jethro said to Moses, “Go in peace.”"
    },
    {
      "verse": 19,
      "text": "The Lord said to Moses in Midian, “Go back to Egypt; for all those who were seeking your life are dead.”"
    },
    {
      "verse": 20,
      "text": "So Moses took his wife and his sons, put them on a donkey and went back to the land of Egypt; and Moses carried the staff of God in his hand."
    },
    {
      "verse": 21,
      "text": "And the Lord said to Moses, “When you go back to Egypt, see that you perform before Pharaoh all the wonders that I have put in your power; but I will harden his heart, so that he will not let the people go."
    },
    {
      "verse": 22,
      "text": "Then you shall say to Pharaoh, ‘Thus says the Lord: Israel is my firstborn son."
    },
    {
      "verse": 23,
      "text": "I said to you, “Let my son go that he may worship me.” But you refused to let him go; now I will kill your firstborn son.’ ”"
    },
    {
      "verse": 24,
      "text": "On the way, at a place where they spent the night, the Lord met him and tried to kill him."
    },
    {
      "verse": 25,
      "text": "But Zipporah took a flint and cut off her son's foreskin, and touched Moses' feet with it, and said, “Truly you are a bridegroom of blood to me!”"
    },
    {
      "verse": 26,
      "text": "So he let him alone. It was then she said, “A bridegroom of blood by circumcision.”"
    },
    {
      "verse": 27,
      "text": "The Lord said to Aaron, “Go into the wilderness to meet Moses.” So he went; and he met him at the mountain of God and kissed him."
    },
    {
      "verse": 28,
      "text": "Moses told Aaron all the words of the Lord with which he had sent him, and all the signs with which he had charged him."
    },
    {
      "verse": 29,
      "text": "Then Moses and Aaron went and assembled all the elders of the Israelites."
    },
    {
      "verse": 30,
      "text": "Aaron spoke all the words that the Lord had spoken to Moses, and performed the signs in the sight of the people."
    },
    {
      "verse": 31,
      "text": "The people believed; and when they heard that the Lord had given heed to the Israelites and that he had seen their misery, they bowed down and worshiped."
    }
  ],
  "timestamp": "2025-09-16T19:43:26.840482"
}