{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 40,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EXO.40",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord spoke to Moses:"
    },
    {
      "verse": 2,
      "text": "On the first day of the first month you shall set up the tabernacle of the tent of meeting."
    },
    {
      "verse": 3,
      "text": "You shall put in it the ark of the covenant, and you shall screen the ark with the curtain."
    },
    {
      "verse": 4,
      "text": "You shall bring in the table, and arrange its setting; and you shall bring in the lampstand, and set up its lamps."
    },
    {
      "verse": 5,
      "text": "You shall put the golden altar for incense before the ark of the covenant, and set up the screen for the entrance of the tabernacle."
    },
    {
      "verse": 6,
      "text": "You shall set the altar of burnt offering before the entrance of the tabernacle of the tent of meeting,"
    },
    {
      "verse": 7,
      "text": "and place the basin between the tent of meeting and the altar, and put water in it."
    },
    {
      "verse": 8,
      "text": "You shall set up the court all around, and hang up the screen for the gate of the court."
    },
    {
      "verse": 9,
      "text": "Then you shall take the anointing oil, and anoint the tabernacle and all that is in it, and consecrate it and all its furniture, so that it shall become holy."
    },
    {
      "verse": 10,
      "text": "You shall also anoint the altar of burnt offering and all its utensils, and consecrate the altar, so that the altar shall be most holy."
    },
    {
      "verse": 11,
      "text": "You shall also anoint the basin with its stand, and consecrate it."
    },
    {
      "verse": 12,
      "text": "Then you shall bring Aaron and his sons to the entrance of the tent of meeting, and shall wash them with water,"
    },
    {
      "verse": 13,
      "text": "and put on Aaron the sacred vestments, and you shall anoint him and consecrate him, so that he may serve me as priest."
    },
    {
      "verse": 14,
      "text": "You shall bring his sons also and put tunics on them,"
    },
    {
      "verse": 15,
      "text": "and anoint them, as you anointed their father, that they may serve me as priests: and their anointing shall admit them to a perpetual priesthood throughout all generations to come."
    },
    {
      "verse": 16,
      "text": "Moses did everything just as the Lord had commanded him."
    },
    {
      "verse": 17,
      "text": "In the first month in the second year, on the first day of the month, the tabernacle was set up."
    },
    {
      "verse": 18,
      "text": "Moses set up the tabernacle; he laid its bases, and set up its frames, and put in its poles, and raised up its pillars;"
    },
    {
      "verse": 19,
      "text": "and he spread the tent over the tabernacle, and put the covering of the tent over it; as the Lord had commanded Moses."
    },
    {
      "verse": 20,
      "text": "He took the covenant and put it into the ark, and put the poles on the ark, and set the mercy seat above the ark;"
    },
    {
      "verse": 21,
      "text": "and he brought the ark into the tabernacle, and set up the curtain for screening, and screened the ark of the covenant; as the Lord had commanded Moses."
    },
    {
      "verse": 22,
      "text": "He put the table in the tent of meeting, on the north side of the tabernacle, outside the curtain,"
    },
    {
      "verse": 23,
      "text": "and set the bread in order on it before the Lord; as the Lord had commanded Moses."
    },
    {
      "verse": 24,
      "text": "He put the lampstand in the tent of meeting, opposite the table on the south side of the tabernacle,"
    },
    {
      "verse": 25,
      "text": "and set up the lamps before the Lord; as the Lord had commanded Moses."
    },
    {
      "verse": 26,
      "text": "He put the golden altar in the tent of meeting before the curtain,"
    },
    {
      "verse": 27,
      "text": "and offered fragrant incense on it; as the Lord had commanded Moses."
    },
    {
      "verse": 28,
      "text": "He also put in place the screen for the entrance of the tabernacle."
    },
    {
      "verse": 29,
      "text": "He set the altar of burnt offering at the entrance of the tabernacle of the tent of meeting, and offered on it the burnt offering and the grain offering as the Lord had commanded Moses."
    },
    {
      "verse": 30,
      "text": "He set the basin between the tent of meeting and the altar, and put water in it for washing,"
    },
    {
      "verse": 31,
      "text": "with which Moses and Aaron and his sons washed their hands and their feet."
    },
    {
      "verse": 32,
      "text": "When they went into the tent of meeting, and when they approached the altar, they washed; as the Lord had commanded Moses."
    },
    {
      "verse": 33,
      "text": "He set up the court around the tabernacle and the altar, and put up the screen at the gate of the court. So Moses finished the work."
    },
    {
      "verse": 34,
      "text": "Then the cloud covered the tent of meeting, and the glory of the Lord filled the tabernacle."
    },
    {
      "verse": 35,
      "text": "Moses was not able to enter the tent of meeting because the cloud settled upon it, and the glory of the Lord filled the tabernacle."
    },
    {
      "verse": 36,
      "text": "Whenever the cloud was taken up from the tabernacle, the Israelites would set out on each stage of their journey;"
    },
    {
      "verse": 37,
      "text": "but if the cloud was not taken up, then they did not set out until the day that it was taken up."
    },
    {
      "verse": 38,
      "text": "For the cloud of the Lord was on the tabernacle by day, and fire was in the cloud by night, before the eyes of all the house of Israel at each stage of their journey."
    }
  ],
  "timestamp": "2025-09-16T19:43:45.032481"
}