{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 11,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EXO.11",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord said to Moses, “I will bring one more plague upon Pharaoh and upon Egypt; afterwards he will let you go from here; indeed, when he lets you go, he will drive you away."
    },
    {
      "verse": 2,
      "text": "Tell the people that every man is to ask his neighbor and every woman is to ask her neighbor for objects of silver and gold.”"
    },
    {
      "verse": 3,
      "text": "The Lord gave the people favor in the sight of the Egyptians. Moreover, Moses himself was a man of great importance in the land of Egypt, in the sight of Pharaoh's officials and in the sight of the people."
    },
    {
      "verse": 4,
      "text": "Moses said, “Thus says the Lord: About midnight I will go out through Egypt."
    },
    {
      "verse": 5,
      "text": "Every firstborn in the land of Egypt shall die, from the firstborn of Pharaoh who sits on his throne to the firstborn of the female slave who is behind the handmill, and all the firstborn of the livestock."
    },
    {
      "verse": 6,
      "text": "Then there will be a loud cry throughout the whole land of Egypt, such as has never been or will ever be again."
    },
    {
      "verse": 7,
      "text": "But not a dog shall growl at any of the Israelites—not at people, not at animals—so that you may know that the Lord makes a distinction between Egypt and Israel."
    },
    {
      "verse": 8,
      "text": "Then all these officials of yours shall come down to me, and bow low to me, saying, ‘Leave us, you and all the people who follow you.’ After that I will leave.” And in hot anger he left Pharaoh."
    },
    {
      "verse": 9,
      "text": "The Lord said to Moses, “Pharaoh will not listen to you, in order that my wonders may be multiplied in the land of Egypt.”"
    },
    {
      "verse": 10,
      "text": "Moses and Aaron performed all these wonders before Pharaoh; but the Lord hardened Pharaoh's heart, and he did not let the people of Israel go out of his land."
    }
  ],
  "timestamp": "2025-09-16T19:43:29.156119"
}