{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 39,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EXO.39",
  "verses": [
    {
      "verse": 1,
      "text": "Of the blue, purple, and crimson yarns they made finely worked vestments, for ministering in the holy place; they made the sacred vestments for Aaron; as the Lord had commanded Moses."
    },
    {
      "verse": 2,
      "text": "He made the ephod of gold, of blue, purple, and crimson yarns, and of fine twisted linen."
    },
    {
      "verse": 3,
      "text": "Gold leaf was hammered out and cut into threads to work into the blue, purple, and crimson yarns and into the fine twisted linen, in skilled design."
    },
    {
      "verse": 4,
      "text": "They made for the ephod shoulder-pieces, joined to it at its two edges."
    },
    {
      "verse": 5,
      "text": "The decorated band on it was of the same materials and workmanship, of gold, of blue, purple, and crimson yarns, and of fine twisted linen; as the Lord had commanded Moses."
    },
    {
      "verse": 6,
      "text": "The onyx stones were prepared, enclosed in settings of gold filigree and engraved like the engravings of a signet, according to the names of the sons of Israel."
    },
    {
      "verse": 7,
      "text": "He set them on the shoulder-pieces of the ephod, to be stones of remembrance for the sons of Israel; as the Lord had commanded Moses."
    },
    {
      "verse": 8,
      "text": "He made the breastpiece, in skilled work, like the work of the ephod, of gold, of blue, purple, and crimson yarns, and of fine twisted linen."
    },
    {
      "verse": 9,
      "text": "It was square; the breastpiece was made double, a span in length and a span in width when doubled."
    },
    {
      "verse": 10,
      "text": "They set in it four rows of stones. A row of carnelian, chrysolite, and emerald was the first row;"
    },
    {
      "verse": 11,
      "text": "and the second row, a turquoise, a sapphire, and a moonstone;"
    },
    {
      "verse": 12,
      "text": "and the third row, a jacinth, an agate, and an amethyst;"
    },
    {
      "verse": 13,
      "text": "and the fourth row, a beryl, an onyx, and a jasper; they were enclosed in settings of gold filigree."
    },
    {
      "verse": 14,
      "text": "There were twelve stones with names corresponding to the names of the sons of Israel; they were like signets, each engraved with its name, for the twelve tribes."
    },
    {
      "verse": 15,
      "text": "They made on the breastpiece chains of pure gold, twisted like cords;"
    },
    {
      "verse": 16,
      "text": "and they made two settings of gold filigree and two gold rings, and put the two rings on the two edges of the breastpiece;"
    },
    {
      "verse": 17,
      "text": "and they put the two cords of gold in the two rings at the edges of the breastpiece."
    },
    {
      "verse": 18,
      "text": "Two ends of the two cords they had attached to the two settings of filigree; in this way they attached it in front to the shoulder-pieces of the ephod."
    },
    {
      "verse": 19,
      "text": "Then they made two rings of gold, and put them at the two ends of the breastpiece, on its inside edge next to the ephod."
    },
    {
      "verse": 20,
      "text": "They made two rings of gold, and attached them in front to the lower part of the two shoulder-pieces of the ephod, at its joining above the decorated band of the ephod."
    },
    {
      "verse": 21,
      "text": "They bound the breastpiece by its rings to the rings of the ephod with a blue cord, so that it should lie on the decorated band of the ephod, and that the breastpiece should not come loose from the ephod; as the Lord had commanded Moses."
    },
    {
      "verse": 22,
      "text": "He also made the robe of the ephod woven all of blue yarn;"
    },
    {
      "verse": 23,
      "text": "and the opening of the robe in the middle of it was like the opening in a coat of mail, with a binding around the opening, so that it might not be torn."
    },
    {
      "verse": 24,
      "text": "On the lower hem of the robe they made pomegranates of blue, purple, and crimson yarns, and of fine twisted linen."
    },
    {
      "verse": 25,
      "text": "They also made bells of pure gold, and put the bells between the pomegranates on the lower hem of the robe all around, between the pomegranates;"
    },
    {
      "verse": 26,
      "text": "a bell and a pomegranate, a bell and a pomegranate all around on the lower hem of the robe for ministering; as the Lord had commanded Moses."
    },
    {
      "verse": 27,
      "text": "They also made the tunics, woven of fine linen, for Aaron and his sons,"
    },
    {
      "verse": 28,
      "text": "and the turban of fine linen, and the headdresses of fine linen, and the linen undergarments of fine twisted linen,"
    },
    {
      "verse": 29,
      "text": "and the sash of fine twisted linen, and of blue, purple, and crimson yarns, embroidered with needlework; as the Lord had commanded Moses."
    },
    {
      "verse": 30,
      "text": "They made the rosette of the holy diadem of pure gold, and wrote on it an inscription, like the engraving of a signet, “Holy to the Lord.”"
    },
    {
      "verse": 31,
      "text": "They tied to it a blue cord, to fasten it on the turban above; as the Lord had commanded Moses."
    },
    {
      "verse": 32,
      "text": "In this way all the work of the tabernacle of the tent of meeting was finished; the Israelites had done everything just as the Lord had commanded Moses."
    },
    {
      "verse": 33,
      "text": "Then they brought the tabernacle to Moses, the tent and all its utensils, its hooks, its frames, its bars, its pillars, and its bases;"
    },
    {
      "verse": 34,
      "text": "the covering of tanned rams' skins and the covering of fine leather, and the curtain for the screen;"
    },
    {
      "verse": 35,
      "text": "the ark of the covenant with its poles and the mercy seat;"
    },
    {
      "verse": 36,
      "text": "the table with all its utensils, and the bread of the Presence;"
    },
    {
      "verse": 37,
      "text": "the pure lampstand with its lamps set on it and all its utensils, and the oil for the light;"
    },
    {
      "verse": 38,
      "text": "the golden altar, the anointing oil and the fragrant incense, and the screen for the entrance of the tent;"
    },
    {
      "verse": 39,
      "text": "the bronze altar, and its grating of bronze, its poles, and all its utensils; the basin with its stand;"
    },
    {
      "verse": 40,
      "text": "the hangings of the court, its pillars, and its bases, and the screen for the gate of the court, its cords, and its pegs; and all the utensils for the service of the tabernacle, for the tent of meeting;"
    },
    {
      "verse": 41,
      "text": "the finely worked vestments for ministering in the holy place, the sacred vestments for the priest Aaron, and the vestments of his sons to serve as priests."
    },
    {
      "verse": 42,
      "text": "The Israelites had done all of the work just as the Lord had commanded Moses."
    },
    {
      "verse": 43,
      "text": "When Moses saw that they had done all the work just as the Lord had commanded, he blessed them."
    }
  ],
  "timestamp": "2025-09-16T19:43:44.426784"
}