{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 30,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EXO.30",
  "verses": [
    {
      "verse": 1,
      "text": "You shall make an altar on which to offer incense; you shall make it of acacia wood."
    },
    {
      "verse": 2,
      "text": "It shall be one cubit long, and one cubit wide; it shall be square, and shall be two cubits high; its horns shall be of one piece with it."
    },
    {
      "verse": 3,
      "text": "You shall overlay it with pure gold, its top, and its sides all around and its horns; and you shall make for it a molding of gold all around."
    },
    {
      "verse": 4,
      "text": "And you shall make two golden rings for it; under its molding on two opposite sides of it you shall make them, and they shall hold the poles with which to carry it."
    },
    {
      "verse": 5,
      "text": "You shall make the poles of acacia wood, and overlay them with gold."
    },
    {
      "verse": 6,
      "text": "You shall place it in front of the curtain that is above the ark of the covenant, in front of the mercy seat that is over the covenant, where I will meet with you."
    },
    {
      "verse": 7,
      "text": "Aaron shall offer fragrant incense on it; every morning when he dresses the lamps he shall offer it,"
    },
    {
      "verse": 8,
      "text": "and when Aaron sets up the lamps in the evening, he shall offer it, a regular incense offering before the Lord throughout your generations."
    },
    {
      "verse": 9,
      "text": "You shall not offer unholy incense on it, or a burnt offering, or a grain offering; and you shall not pour a drink offering on it."
    },
    {
      "verse": 10,
      "text": "Once a year Aaron shall perform the rite of atonement on its horns. Throughout your generations he shall perform the atonement for it once a year with the blood of the atoning sin offering. It is most holy to the Lord."
    },
    {
      "verse": 11,
      "text": "The Lord spoke to Moses:"
    },
    {
      "verse": 12,
      "text": "When you take a census of the Israelites to register them, at registration all of them shall give a ransom for their lives to the Lord, so that no plague may come upon them for being registered."
    },
    {
      "verse": 13,
      "text": "This is what each one who is registered shall give: half a shekel according to the shekel of the sanctuary (the shekel is twenty gerahs), half a shekel as an offering to the Lord."
    },
    {
      "verse": 14,
      "text": "Each one who is registered, from twenty years old and upward, shall give the Lord 's offering."
    },
    {
      "verse": 15,
      "text": "The rich shall not give more, and the poor shall not give less, than the half shekel, when you bring this offering to the Lord to make atonement for your lives."
    },
    {
      "verse": 16,
      "text": "You shall take the atonement money from the Israelites and shall designate it for the service of the tent of meeting; before the Lord it will be a reminder to the Israelites of the ransom given for your lives."
    },
    {
      "verse": 17,
      "text": "The Lord spoke to Moses:"
    },
    {
      "verse": 18,
      "text": "You shall make a bronze basin with a bronze stand for washing. You shall put it between the tent of meeting and the altar, and you shall put water in it;"
    },
    {
      "verse": 19,
      "text": "with the water Aaron and his sons shall wash their hands and their feet."
    },
    {
      "verse": 20,
      "text": "When they go into the tent of meeting, or when they come near the altar to minister, to make an offering by fire to the Lord, they shall wash with water, so that they may not die."
    },
    {
      "verse": 21,
      "text": "They shall wash their hands and their feet, so that they may not die: it shall be a perpetual ordinance for them, for him and for his descendants throughout their generations."
    },
    {
      "verse": 22,
      "text": "The Lord spoke to Moses:"
    },
    {
      "verse": 23,
      "text": "Take the finest spices: of liquid myrrh five hundred shekels, and of sweet-smelling cinnamon half as much, that is, two hundred fifty, and two hundred fifty of aromatic cane,"
    },
    {
      "verse": 24,
      "text": "and five hundred of cassia—measured by the sanctuary shekel—and a hin of olive oil;"
    },
    {
      "verse": 25,
      "text": "and you shall make of these a sacred anointing oil blended as by the perfumer; it shall be a holy anointing oil."
    },
    {
      "verse": 26,
      "text": "With it you shall anoint the tent of meeting and the ark of the covenant,"
    },
    {
      "verse": 27,
      "text": "and the table and all its utensils, and the lampstand and its utensils, and the altar of incense,"
    },
    {
      "verse": 28,
      "text": "and the altar of burnt offering with all its utensils, and the basin with its stand;"
    },
    {
      "verse": 29,
      "text": "you shall consecrate them, so that they may be most holy; whatever touches them will become holy."
    },
    {
      "verse": 30,
      "text": "You shall anoint Aaron and his sons, and consecrate them, in order that they may serve me as priests."
    },
    {
      "verse": 31,
      "text": "You shall say to the Israelites, “This shall be my holy anointing oil throughout your generations."
    },
    {
      "verse": 32,
      "text": "It shall not be used in any ordinary anointing of the body, and you shall make no other like it in composition; it is holy, and it shall be holy to you."
    },
    {
      "verse": 33,
      "text": "Whoever compounds any like it or whoever puts any of it on an unqualified person shall be cut off from the people.”"
    },
    {
      "verse": 34,
      "text": "The Lord said to Moses: Take sweet spices, stacte, and onycha, and galbanum, sweet spices with pure frankincense (an equal part of each),"
    },
    {
      "verse": 35,
      "text": "and make an incense blended as by the perfumer, seasoned with salt, pure and holy;"
    },
    {
      "verse": 36,
      "text": "and you shall beat some of it into powder, and put part of it before the covenant in the tent of meeting where I shall meet with you; it shall be for you most holy."
    },
    {
      "verse": 37,
      "text": "When you make incense according to this composition, you shall not make it for yourselves; it shall be regarded by you as holy to the Lord."
    },
    {
      "verse": 38,
      "text": "Whoever makes any like it to use as perfume shall be cut off from the people."
    }
  ],
  "timestamp": "2025-09-16T19:43:39.721861"
}