{
  "book": "EZK",
  "book_name": "Ezekiel",
  "chapter": 21,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EZK.21",
  "verses": [
    {
      "verse": 1,
      "text": "The word of the Lord came to me:"
    },
    {
      "verse": 2,
      "text": "Mortal, set your face toward Jerusalem and preach against the sanctuaries; prophesy against the land of Israel"
    },
    {
      "verse": 3,
      "text": "and say to the land of Israel, Thus says the Lord: I am coming against you, and will draw my sword out of its sheath, and will cut off from you both righteous and wicked."
    },
    {
      "verse": 4,
      "text": "Because I will cut off from you both righteous and wicked, therefore my sword shall go out of its sheath against all flesh from south to north;"
    },
    {
      "verse": 5,
      "text": "and all flesh shall know that I the Lord have drawn my sword out of its sheath; it shall not be sheathed again."
    },
    {
      "verse": 6,
      "text": "Moan therefore, mortal; moan with breaking heart and bitter grief before their eyes."
    },
    {
      "verse": 7,
      "text": "And when they say to you, “Why do you moan?” you shall say, “Because of the news that has come. Every heart will melt and all hands will be feeble, every spirit will faint and all knees will turn to water. See, it comes and it will be fulfilled,” says the Lord God."
    },
    {
      "verse": 8,
      "text": "And the word of the Lord came to me:"
    },
    {
      "verse": 9,
      "text": "Mortal, prophesy and say: Thus says the Lord; Say: A sword, a sword is sharpened, it is also polished;"
    },
    {
      "verse": 10,
      "text": "It is sharpened for slaughter, honed to flash like lightning! How can we make merry? You have despised the rod, and all discipline."
    },
    {
      "verse": 11,
      "text": "The sword is given to be polished, to be grasped in the hand; It is sharpened, the sword is polished, to be placed in the slayer's hand."
    },
    {
      "verse": 12,
      "text": "Cry and wail, O mortal, for it is against my people; it is against all Israel's princes; they are thrown to the sword, together with my people. Ah! Strike the thigh!"
    },
    {
      "verse": 13,
      "text": "For consider: What! If you despise the rod, will it not happen? says the Lord God."
    },
    {
      "verse": 14,
      "text": "And you, mortal, prophesy; Strike hand to hand. Let the sword fall twice, thrice; it is a sword for killing. A sword for great slaughter— it surrounds them;"
    },
    {
      "verse": 15,
      "text": "therefore hearts melt and many stumble. At all their gates I have set the point of the sword. Ah! It is made for flashing, it is polished for slaughter."
    },
    {
      "verse": 16,
      "text": "Attack to the right! Engage to the left! Wherever your edge is directed."
    },
    {
      "verse": 17,
      "text": "I too will strike hand to hand, I will satisfy my fury; I the Lord have spoken."
    },
    {
      "verse": 18,
      "text": "The word of the Lord came to me:"
    },
    {
      "verse": 19,
      "text": "Mortal, mark out two roads for the sword of the king of Babylon to come; both of them shall issue from the same land. And make a signpost, make it for a fork in the road leading to a city;"
    },
    {
      "verse": 20,
      "text": "mark out the road for the sword to come to Rabbah of the Ammonites or to Judah and to Jerusalem the fortified."
    },
    {
      "verse": 21,
      "text": "For the king of Babylon stands at the parting of the way, at the fork in the two roads, to use divination; he shakes the arrows, he consults the teraphim, he inspects the liver."
    },
    {
      "verse": 22,
      "text": "Into his right hand comes the lot for Jerusalem, to set battering rams, to call out for slaughter, for raising the battle cry, to set battering rams against the gates, to cast up ramps, to build siege towers."
    },
    {
      "verse": 23,
      "text": "But to them it will seem like a false divination; they have sworn solemn oaths; but he brings their guilt to remembrance, bringing about their capture."
    },
    {
      "verse": 24,
      "text": "Therefore thus says the Lord God: Because you have brought your guilt to remembrance, in that your transgressions are uncovered, so that in all your deeds your sins appear—because you have come to remembrance, you shall be taken in hand."
    },
    {
      "verse": 25,
      "text": "As for you, vile, wicked prince of Israel, you whose day has come, the time of final punishment,"
    },
    {
      "verse": 26,
      "text": "thus says the Lord God: Remove the turban, take off the crown; things shall not remain as they are. Exalt that which is low, abase that which is high."
    },
    {
      "verse": 27,
      "text": "A ruin, a ruin, a ruin— I will make it! (Such has never occurred.) Until he comes whose right it is; to him I will give it."
    },
    {
      "verse": 28,
      "text": "As for you, mortal, prophesy, and say, Thus says the Lord God concerning the Ammonites, and concerning their reproach; say: A sword, a sword! Drawn for slaughter Polished to consume, to flash like lightning."
    },
    {
      "verse": 29,
      "text": "Offering false visions for you, divining lies for you, they place you over the necks of the vile, wicked ones— those whose day has come, the time of final punishment."
    },
    {
      "verse": 30,
      "text": "Return it to its sheath! In the place where you were created, in the land of your origin, I will judge you."
    },
    {
      "verse": 31,
      "text": "I will pour out my indignation upon you, with the fire of my wrath I will blow upon you. I will deliver you into brutish hands, those skillful to destroy."
    },
    {
      "verse": 32,
      "text": "You shall be fuel for the fire, your blood shall enter the earth; You shall be remembered no more, for I the Lord have spoken."
    }
  ],
  "timestamp": "2025-09-16T19:48:27.989731"
}