{
  "book": "EZK",
  "book_name": "Ezekiel",
  "chapter": 34,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EZK.34",
  "verses": [
    {
      "verse": 1,
      "text": "The word of the Lord came to me:"
    },
    {
      "verse": 2,
      "text": "Mortal, prophesy against the shepherds of Israel: prophesy, and say to them—to the shepherds: Thus says the Lord God: Ah, you shepherds of Israel who have been feeding yourselves! Should not shepherds feed the sheep?"
    },
    {
      "verse": 3,
      "text": "You eat the fat, you clothe yourselves with the wool, you slaughter the fatlings; but you do not feed the sheep."
    },
    {
      "verse": 4,
      "text": "You have not strengthened the weak, you have not healed the sick, you have not bound up the injured, you have not brought back the strayed, you have not sought the lost, but with force and harshness you have ruled them."
    },
    {
      "verse": 5,
      "text": "So they were scattered, because there was no shepherd; and scattered, they became food for all the wild animals."
    },
    {
      "verse": 6,
      "text": "My sheep were scattered, they wandered over all the mountains and on every high hill; my sheep were scattered over all the face of the earth, with no one to search or seek for them."
    },
    {
      "verse": 7,
      "text": "Therefore, you shepherds, hear the word of the Lord:"
    },
    {
      "verse": 8,
      "text": "As I live, says the Lord God, because my sheep have become a prey, and my sheep have become food for all the wild animals, since there was no shepherd; and because my shepherds have not searched for my sheep, but the shepherds have fed themselves, and have not fed my sheep;"
    },
    {
      "verse": 9,
      "text": "therefore, you shepherds, hear the word of the Lord:"
    },
    {
      "verse": 10,
      "text": "Thus says the Lord God, I am against the shepherds; and I will demand my sheep at their hand, and put a stop to their feeding the sheep; no longer shall the shepherds feed themselves. I will rescue my sheep from their mouths, so that they may not be food for them."
    },
    {
      "verse": 11,
      "text": "For thus says the Lord God: I myself will search for my sheep, and will seek them out."
    },
    {
      "verse": 12,
      "text": "As shepherds seek out their flocks when they are among their scattered sheep, so I will seek out my sheep. I will rescue them from all the places to which they have been scattered on a day of clouds and thick darkness."
    },
    {
      "verse": 13,
      "text": "I will bring them out from the peoples and gather them from the countries, and will bring them into their own land; and I will feed them on the mountains of Israel, by the watercourses, and in all the inhabited parts of the land."
    },
    {
      "verse": 14,
      "text": "I will feed them with good pasture, and the mountain heights of Israel shall be their pasture; there they shall lie down in good grazing land, and they shall feed on rich pasture on the mountains of Israel."
    },
    {
      "verse": 15,
      "text": "I myself will be the shepherd of my sheep, and I will make them lie down, says the Lord God."
    },
    {
      "verse": 16,
      "text": "I will seek the lost, and I will bring back the strayed, and I will bind up the injured, and I will strengthen the weak, but the fat and the strong I will destroy. I will feed them with justice."
    },
    {
      "verse": 17,
      "text": "As for you, my flock, thus says the Lord God: I shall judge between sheep and sheep, between rams and goats:"
    },
    {
      "verse": 18,
      "text": "Is it not enough for you to feed on the good pasture, but you must tread down with your feet the rest of your pasture? When you drink of clear water, must you foul the rest with your feet?"
    },
    {
      "verse": 19,
      "text": "And must my sheep eat what you have trodden with your feet, and drink what you have fouled with your feet?"
    },
    {
      "verse": 20,
      "text": "Therefore, thus says the Lord God to them: I myself will judge between the fat sheep and the lean sheep."
    },
    {
      "verse": 21,
      "text": "Because you pushed with flank and shoulder, and butted at all the weak animals with your horns until you scattered them far and wide,"
    },
    {
      "verse": 22,
      "text": "I will save my flock, and they shall no longer be ravaged; and I will judge between sheep and sheep."
    },
    {
      "verse": 23,
      "text": "I will set up over them one shepherd, my servant David, and he shall feed them: he shall feed them and be their shepherd."
    },
    {
      "verse": 24,
      "text": "And I, the Lord, will be their God, and my servant David shall be prince among them; I, the Lord, have spoken."
    },
    {
      "verse": 25,
      "text": "I will make with them a covenant of peace and banish wild animals from the land, so that they may live in the wild and sleep in the woods securely."
    },
    {
      "verse": 26,
      "text": "I will make them and the region around my hill a blessing; and I will send down the showers in their season; they shall be showers of blessing."
    },
    {
      "verse": 27,
      "text": "The trees of the field shall yield their fruit, and the earth shall yield its increase. They shall be secure on their soil; and they shall know that I am the Lord, when I break the bars of their yoke, and save them from the hands of those who enslaved them."
    },
    {
      "verse": 28,
      "text": "They shall no more be plunder for the nations, nor shall the animals of the land devour them; they shall live in safety, and no one shall make them afraid."
    },
    {
      "verse": 29,
      "text": "I will provide for them a splendid vegetation so that they shall no more be consumed with hunger in the land, and no longer suffer the insults of the nations."
    },
    {
      "verse": 30,
      "text": "They shall know that I, the Lord their God, am with them, and that they, the house of Israel, are my people, says the Lord God."
    },
    {
      "verse": 31,
      "text": "You are my sheep, the sheep of my pasture and I am your God, says the Lord God."
    }
  ],
  "timestamp": "2025-09-16T19:48:32.934811"
}