{
  "book": "EZK",
  "book_name": "Ezekiel",
  "chapter": 40,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EZK.40",
  "verses": [
    {
      "verse": 1,
      "text": "In the twenty-fifth year of our exile, at the beginning of the year, on the tenth day of the month, in the fourteenth year after the city was struck down, on that very day, the hand of the Lord was upon me, and he brought me there."
    },
    {
      "verse": 2,
      "text": "He brought me, in visions of God, to the land of Israel, and set me down upon a very high mountain, on which was a structure like a city to the south."
    },
    {
      "verse": 3,
      "text": "When he brought me there, a man was there, whose appearance shone like bronze, with a linen cord and a measuring reed in his hand; and he was standing in the gateway."
    },
    {
      "verse": 4,
      "text": "The man said to me, “Mortal, look closely and listen attentively, and set your mind upon all that I shall show you, for you were brought here in order that I might show it to you; declare all that you see to the house of Israel.”"
    },
    {
      "verse": 5,
      "text": "Now there was a wall all around the outside of the temple area. The length of the measuring reed in the man's hand was six long cubits, each being a cubit and a handbreadth in length; so he measured the thickness of the wall, one reed; and the height, one reed."
    },
    {
      "verse": 6,
      "text": "Then he went into the gateway facing east, going up its steps, and measured the threshold of the gate, one reed deep. There were"
    },
    {
      "verse": 7,
      "text": "recesses, and each recess was one reed wide and one reed deep; and the space between the recesses, five cubits; and the threshold of the gate by the vestibule of the gate at the inner end was one reed deep."
    },
    {
      "verse": 8,
      "text": "Then he measured the inner vestibule of the gateway, one cubit."
    },
    {
      "verse": 9,
      "text": "Then he measured the vestibule of the gateway, eight cubits; and its pilasters, two cubits; and the vestibule of the gate was at the inner end."
    },
    {
      "verse": 10,
      "text": "There were three recesses on either side of the east gate; the three were of the same size; and the pilasters on either side were of the same size."
    },
    {
      "verse": 11,
      "text": "Then he measured the width of the opening of the gateway, ten cubits; and the width of the gateway, thirteen cubits."
    },
    {
      "verse": 12,
      "text": "There was a barrier before the recesses, one cubit on either side; and the recesses were six cubits on either side."
    },
    {
      "verse": 13,
      "text": "Then he measured the gate from the back of the one recess to the back of the other, a width of twenty-five cubits, from wall to wall."
    },
    {
      "verse": 14,
      "text": "He measured also the vestibule, twenty cubits; and the gate next to the pilaster on every side of the court."
    },
    {
      "verse": 15,
      "text": "From the front of the gate at the entrance to the end of the inner vestibule of the gate was fifty cubits."
    },
    {
      "verse": 16,
      "text": "The recesses and their pilasters had windows, with shutters on the inside of the gateway all around, and the vestibules also had windows on the inside all around; and on the pilasters were palm trees."
    },
    {
      "verse": 17,
      "text": "Then he brought me into the outer court; there were chambers there, and a pavement, all around the court; thirty chambers fronted on the pavement."
    },
    {
      "verse": 18,
      "text": "The pavement ran along the side of the gates, corresponding to the length of the gates; this was the lower pavement."
    },
    {
      "verse": 19,
      "text": "Then he measured the distance from the inner front of the lower gate to the outer front of the inner court, one hundred cubits."
    },
    {
      "verse": 20,
      "text": "Then he measured the gate of the outer court that faced north—its depth and width."
    },
    {
      "verse": 21,
      "text": "Its recesses, three on either side, and its pilasters and its vestibule were of the same size as those of the first gate; its depth was fifty cubits, and its width twenty-five cubits."
    },
    {
      "verse": 22,
      "text": "Its windows, its vestibule, and its palm trees were of the same size as those of the gate that faced toward the east. Seven steps led up to it; and its vestibule was on the inside."
    },
    {
      "verse": 23,
      "text": "Opposite the gate on the north, as on the east, was a gate to the inner court; he measured from gate to gate, one hundred cubits."
    },
    {
      "verse": 24,
      "text": "Then he led me toward the south, and there was a gate on the south; and he measured its pilasters and its vestibule; they had the same dimensions as the others."
    },
    {
      "verse": 25,
      "text": "There were windows all around in it and in its vestibule, like the windows of the others; its depth was fifty cubits, and its width twenty-five cubits."
    },
    {
      "verse": 26,
      "text": "There were seven steps leading up to it; its vestibule was on the inside. It had palm trees on its pilasters, one on either side."
    },
    {
      "verse": 27,
      "text": "There was a gate on the south of the inner court; and he measured from gate to gate toward the south, one hundred cubits."
    },
    {
      "verse": 28,
      "text": "Then he brought me to the inner court by the south gate, and he measured the south gate; it was of the same dimensions as the others."
    },
    {
      "verse": 29,
      "text": "Its recesses, its pilasters, and its vestibule were of the same size as the others; and there were windows all around in it and in its vestibule; its depth was fifty cubits, and its width twenty-five cubits."
    },
    {
      "verse": 30,
      "text": "There were vestibules all around, twenty-five cubits deep and five cubits wide."
    },
    {
      "verse": 31,
      "text": "Its vestibule faced the outer court, and palm trees were on its pilasters, and its stairway had eight steps."
    },
    {
      "verse": 32,
      "text": "Then he brought me to the inner court on the east side, and he measured the gate; it was of the same size as the others."
    },
    {
      "verse": 33,
      "text": "Its recesses, its pilasters, and its vestibule were of the same dimensions as the others; and there were windows all around in it and in its vestibule; its depth was fifty cubits, and its width twenty-five cubits."
    },
    {
      "verse": 34,
      "text": "Its vestibule faced the outer court, and it had palm trees on its pilasters, on either side; and its stairway had eight steps."
    },
    {
      "verse": 35,
      "text": "Then he brought me to the north gate, and he measured it; it had the same dimensions as the others."
    },
    {
      "verse": 36,
      "text": "Its recesses, its pilasters, and its vestibule were of the same size as the others; and it had windows all around. Its depth was fifty cubits, and its width twenty-five cubits."
    },
    {
      "verse": 37,
      "text": "Its vestibule faced the outer court, and it had palm trees on its pilasters, on either side; and its stairway had eight steps."
    },
    {
      "verse": 38,
      "text": "There was a chamber with its door in the vestibule of the gate, where the burnt offering was to be washed."
    },
    {
      "verse": 39,
      "text": "And in the vestibule of the gate were two tables on either side, on which the burnt offering and the sin offering and the guilt offering were to be slaughtered."
    },
    {
      "verse": 40,
      "text": "On the outside of the vestibule at the entrance of the north gate were two tables; and on the other side of the vestibule of the gate were two tables."
    },
    {
      "verse": 41,
      "text": "Four tables were on the inside, and four tables on the outside of the side of the gate, eight tables, on which the sacrifices were to be slaughtered."
    },
    {
      "verse": 42,
      "text": "There were also four tables of hewn stone for the burnt offering, a cubit and a half long, and one cubit and a half wide, and one cubit high, on which the instruments were to be laid with which the burnt offerings and the sacrifices were slaughtered."
    },
    {
      "verse": 43,
      "text": "There were pegs, one handbreadth long, fastened all around the inside. And on the tables the flesh of the offering was to be laid."
    },
    {
      "verse": 44,
      "text": "On the outside of the inner gateway there were chambers for the singers in the inner court, one at the side of the north gate facing south, the other at the side of the east gate facing north."
    },
    {
      "verse": 45,
      "text": "He said to me, “This chamber that faces south is for the priests who have charge of the temple,"
    },
    {
      "verse": 46,
      "text": "and the chamber that faces north is for the priests who have charge of the altar; these are the descendants of Zadok, who alone among the descendants of Levi may come near to the Lord to minister to him.”"
    },
    {
      "verse": 47,
      "text": "He measured the court, one hundred cubits deep, and one hundred cubits wide, a square; and the altar was in front of the temple."
    },
    {
      "verse": 48,
      "text": "Then he brought me to the vestibule of the temple and measured the pilasters of the vestibule, five cubits on either side; and the width of the gate was fourteen cubits; and the sidewalls of the gate were three cubits on either side."
    },
    {
      "verse": 49,
      "text": "The depth of the vestibule was twenty cubits, and the width twelve cubits; ten steps led up to it; and there were pillars beside the pilasters on either side."
    }
  ],
  "timestamp": "2025-09-16T19:48:34.986913"
}