{
  "book": "EZK",
  "book_name": "Ezekiel",
  "chapter": 39,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/EZK.39",
  "verses": [
    {
      "verse": 1,
      "text": "And you, mortal, prophesy against Gog, and say: Thus says the Lord God: I am against you, O Gog, chief prince of Meshech and Tubal!"
    },
    {
      "verse": 2,
      "text": "I will turn you around and drive you forward, and bring you up from the remotest parts of the north, and lead you against the mountains of Israel."
    },
    {
      "verse": 3,
      "text": "I will strike your bow from your left hand, and will make your arrows drop out of your right hand."
    },
    {
      "verse": 4,
      "text": "You shall fall upon the mountains of Israel, you and all your troops and the peoples that are with you; I will give you to birds of prey of every kind and to the wild animals to be devoured."
    },
    {
      "verse": 5,
      "text": "You shall fall in the open field; for I have spoken, says the Lord God."
    },
    {
      "verse": 6,
      "text": "I will send fire on Magog and on those who live securely in the coastlands; and they shall know that I am the Lord."
    },
    {
      "verse": 7,
      "text": "My holy name I will make known among my people Israel; and I will not let my holy name be profaned any more; and the nations shall know that I am the Lord, the Holy One in Israel."
    },
    {
      "verse": 8,
      "text": "It has come! It has happened, says the Lord God. This is the day of which I have spoken."
    },
    {
      "verse": 9,
      "text": "Then those who live in the towns of Israel will go out and make fires of the weapons and burn them—bucklers and shields, bows and arrows, handpikes and spears—and they will make fires of them for seven years."
    },
    {
      "verse": 10,
      "text": "They will not need to take wood out of the field or cut down any trees in the forests, for they will make their fires of the weapons; they will despoil those who despoiled them, and plunder those who plundered them, says the Lord God."
    },
    {
      "verse": 11,
      "text": "On that day I will give to Gog a place for burial in Israel, the Valley of the Travelers east of the sea; it shall block the path of the travelers, for there Gog and all his horde will be buried; it shall be called the Valley of Hamon-gog."
    },
    {
      "verse": 12,
      "text": "Seven months the house of Israel shall spend burying them, in order to cleanse the land."
    },
    {
      "verse": 13,
      "text": "All the people of the land shall bury them; and it will bring them honor on the day that I show my glory, says the Lord God."
    },
    {
      "verse": 14,
      "text": "They will set apart men to pass through the land regularly and bury any invaders who remain on the face of the land, so as to cleanse it; for seven months they shall make their search."
    },
    {
      "verse": 15,
      "text": "As the searchers pass through the land, anyone who sees a human bone shall set up a sign by it, until the buriers have buried it in the Valley of Hamon-gog."
    },
    {
      "verse": 16,
      "text": "(A city Hamonah is there also.) Thus they shall cleanse the land."
    },
    {
      "verse": 17,
      "text": "As for you, mortal, thus says the Lord God: Speak to the birds of every kind and to all the wild animals: Assemble and come, gather from all around to the sacrificial feast that I am preparing for you, a great sacrificial feast on the mountains of Israel, and you shall eat flesh and drink blood."
    },
    {
      "verse": 18,
      "text": "You shall eat the flesh of the mighty, and drink the blood of the princes of the earth—of rams, of lambs, and of goats, of bulls, all of them fatlings of Bashan."
    },
    {
      "verse": 19,
      "text": "You shall eat fat until you are filled, and drink blood until you are drunk, at the sacrificial feast that I am preparing for you."
    },
    {
      "verse": 20,
      "text": "And you shall be filled at my table with horses and charioteers, with warriors and all kinds of soldiers, says the Lord God."
    },
    {
      "verse": 21,
      "text": "I will display my glory among the nations; and all the nations shall see my judgment that I have executed, and my hand that I have laid on them."
    },
    {
      "verse": 22,
      "text": "The house of Israel shall know that I am the Lord their God, from that day forward."
    },
    {
      "verse": 23,
      "text": "And the nations shall know that the house of Israel went into captivity for their iniquity, because they dealt treacherously with me. So I hid my face from them and gave them into the hand of their adversaries, and they all fell by the sword."
    },
    {
      "verse": 24,
      "text": "I dealt with them according to their uncleanness and their transgressions, and hid my face from them."
    },
    {
      "verse": 25,
      "text": "Therefore thus says the Lord God: Now I will restore the fortunes of Jacob, and have mercy on the whole house of Israel; and I will be jealous for my holy name."
    },
    {
      "verse": 26,
      "text": "They shall forget their shame, and all the treachery they have practiced against me, when they live securely in their land with no one to make them afraid,"
    },
    {
      "verse": 27,
      "text": "when I have brought them back from the peoples and gathered them from their enemies' lands, and through them have displayed my holiness in the sight of many nations."
    },
    {
      "verse": 28,
      "text": "Then they shall know that I am the Lord their God because I sent them into exile among the nations, and then gathered them into their own land. I will leave none of them behind;"
    },
    {
      "verse": 29,
      "text": "and I will never again hide my face from them, when I pour out my spirit upon the house of Israel, says the Lord God."
    }
  ],
  "timestamp": "2025-09-16T19:48:34.379773"
}