{
  "book": "GEN",
  "book_name": "Genesis",
  "chapter": 25,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/GEN.25",
  "verses": [
    {
      "verse": 1,
      "text": "Abraham took another wife, whose name was Keturah."
    },
    {
      "verse": 2,
      "text": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah."
    },
    {
      "verse": 3,
      "text": "Jokshan was the father of Sheba and Dedan. The sons of Dedan were Asshurim, Letushim, and Leummim."
    },
    {
      "verse": 4,
      "text": "The sons of Midian were Ephah, Epher, Hanoch, Abida, and Eldaah. All these were the children of Keturah."
    },
    {
      "verse": 5,
      "text": "Abraham gave all he had to Isaac."
    },
    {
      "verse": 6,
      "text": "But to the sons of his concubines Abraham gave gifts, while he was still living, and he sent them away from his son Isaac, eastward to the east country."
    },
    {
      "verse": 7,
      "text": "This is the length of Abraham's life, one hundred seventy-five years."
    },
    {
      "verse": 8,
      "text": "Abraham breathed his last and died in a good old age, an old man and full of years, and was gathered to his people."
    },
    {
      "verse": 9,
      "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah, in the field of Ephron son of Zohar the Hittite, east of Mamre,"
    },
    {
      "verse": 10,
      "text": "the field that Abraham purchased from the Hittites. There Abraham was buried, with his wife Sarah."
    },
    {
      "verse": 11,
      "text": "After the death of Abraham God blessed his son Isaac. And Isaac settled at Beer-lahai-roi."
    },
    {
      "verse": 12,
      "text": "These are the descendants of Ishmael, Abraham's son, whom Hagar the Egyptian, Sarah's slave-girl, bore to Abraham."
    },
    {
      "verse": 13,
      "text": "These are the names of the sons of Ishmael, named in the order of their birth: Nebaioth, the firstborn of Ishmael; and Kedar, Adbeel, Mibsam,"
    },
    {
      "verse": 14,
      "text": "Mishma, Dumah, Massa,"
    },
    {
      "verse": 15,
      "text": "Hadad, Tema, Jetur, Naphish, and Kedemah."
    },
    {
      "verse": 16,
      "text": "These are the sons of Ishmael and these are their names, by their villages and by their encampments, twelve princes according to their tribes."
    },
    {
      "verse": 17,
      "text": "(This is the length of the life of Ishmael, one hundred thirty-seven years; he breathed his last and died, and was gathered to his people.)"
    },
    {
      "verse": 18,
      "text": "They settled from Havilah to Shur, which is opposite Egypt in the direction of Assyria; he settled down alongside of all his people."
    },
    {
      "verse": 19,
      "text": "These are the descendants of Isaac, Abraham's son: Abraham was the father of Isaac,"
    },
    {
      "verse": 20,
      "text": "and Isaac was forty years old when he married Rebekah, daughter of Bethuel the Aramean of Paddan-aram, sister of Laban the Aramean."
    },
    {
      "verse": 21,
      "text": "Isaac prayed to the Lord for his wife, because she was barren; and the Lord granted his prayer, and his wife Rebekah conceived."
    },
    {
      "verse": 22,
      "text": "The children struggled together within her; and she said, “If it is to be this way, why do I live?” So she went to inquire of the Lord."
    },
    {
      "verse": 23,
      "text": "And the Lord said to her, “Two nations are in your womb, and two peoples born of you shall be divided; the one shall be stronger than the other, the elder shall serve the younger.”"
    },
    {
      "verse": 24,
      "text": "When her time to give birth was at hand, there were twins in her womb."
    },
    {
      "verse": 25,
      "text": "The first came out red, all his body like a hairy mantle; so they named him Esau."
    },
    {
      "verse": 26,
      "text": "Afterward his brother came out, with his hand gripping Esau's heel; so he was named Jacob. Isaac was sixty years old when she bore them."
    },
    {
      "verse": 27,
      "text": "When the boys grew up, Esau was a skillful hunter, a man of the field, while Jacob was a quiet man, living in tents."
    },
    {
      "verse": 28,
      "text": "Isaac loved Esau, because he was fond of game; but Rebekah loved Jacob."
    },
    {
      "verse": 29,
      "text": "Once when Jacob was cooking a stew, Esau came in from the field, and he was famished."
    },
    {
      "verse": 30,
      "text": "Esau said to Jacob, “Let me eat some of that red stuff, for I am famished!” (Therefore he was called Edom. )"
    },
    {
      "verse": 31,
      "text": "Jacob said, “First sell me your birthright.”"
    },
    {
      "verse": 32,
      "text": "Esau said, “I am about to die; of what use is a birthright to me?”"
    },
    {
      "verse": 33,
      "text": "Jacob said, “Swear to me first.” So he swore to him, and sold his birthright to Jacob."
    },
    {
      "verse": 34,
      "text": "Then Jacob gave Esau bread and lentil stew, and he ate and drank, and rose and went his way. Thus Esau despised his birthright."
    }
  ],
  "timestamp": "2025-09-16T19:43:12.290157"
}