{
  "book": "HEB",
  "book_name": "Hebrews",
  "chapter": 5,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/HEB.5",
  "verses": [
    {
      "verse": 1,
      "text": "Every high priest chosen from among mortals is put in charge of things pertaining to God on their behalf, to offer gifts and sacrifices for sins."
    },
    {
      "verse": 2,
      "text": "He is able to deal gently with the ignorant and wayward, since he himself is subject to weakness;"
    },
    {
      "verse": 3,
      "text": "and because of this he must offer sacrifice for his own sins as well as for those of the people."
    },
    {
      "verse": 4,
      "text": "And one does not presume to take this honor, but takes it only when called by God, just as Aaron was."
    },
    {
      "verse": 5,
      "text": "So also Christ did not glorify himself in becoming a high priest, but was appointed by the one who said to him, “You are my Son, today I have begotten you”;"
    },
    {
      "verse": 6,
      "text": "as he says also in another place, “You are a priest forever, according to the order of Melchizedek.”"
    },
    {
      "verse": 7,
      "text": "In the days of his flesh, Jesus offered up prayers and supplications, with loud cries and tears, to the one who was able to save him from death, and he was heard because of his reverent submission."
    },
    {
      "verse": 8,
      "text": "Although he was a Son, he learned obedience through what he suffered;"
    },
    {
      "verse": 9,
      "text": "and having been made perfect, he became the source of eternal salvation for all who obey him,"
    },
    {
      "verse": 10,
      "text": "having been designated by God a high priest according to the order of Melchizedek."
    },
    {
      "verse": 11,
      "text": "About this we have much to say that is hard to explain, since you have become dull in understanding."
    },
    {
      "verse": 12,
      "text": "For though by this time you ought to be teachers, you need someone to teach you again the basic elements of the oracles of God. You need milk, not solid food;"
    },
    {
      "verse": 13,
      "text": "for everyone who lives on milk, being still an infant, is unskilled in the word of righteousness."
    },
    {
      "verse": 14,
      "text": "But solid food is for the mature, for those whose faculties have been trained by practice to distinguish good from evil."
    }
  ],
  "timestamp": "2025-09-16T19:50:53.049536"
}