{
  "book": "HEB",
  "book_name": "Hebrews",
  "chapter": 9,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/HEB.9",
  "verses": [
    {
      "verse": 1,
      "text": "Now even the first covenant had regulations for worship and an earthly sanctuary."
    },
    {
      "verse": 2,
      "text": "For a tent was constructed, the first one, in which were the lampstand, the table, and the bread of the Presence; this is called the Holy Place."
    },
    {
      "verse": 3,
      "text": "Behind the second curtain was a tent called the Holy of Holies."
    },
    {
      "verse": 4,
      "text": "In it stood the golden altar of incense and the ark of the covenant overlaid on all sides with gold, in which there were a golden urn holding the manna, and Aaron's rod that budded, and the tablets of the covenant;"
    },
    {
      "verse": 5,
      "text": "above it were the cherubim of glory overshadowing the mercy seat. Of these things we cannot speak now in detail."
    },
    {
      "verse": 6,
      "text": "Such preparations having been made, the priests go continually into the first tent to carry out their ritual duties;"
    },
    {
      "verse": 7,
      "text": "but only the high priest goes into the second, and he but once a year, and not without taking the blood that he offers for himself and for the sins committed unintentionally by the people."
    },
    {
      "verse": 8,
      "text": "By this the Holy Spirit indicates that the way into the sanctuary has not yet been disclosed as long as the first tent is still standing."
    },
    {
      "verse": 9,
      "text": "This is a symbol of the present time, during which gifts and sacrifices are offered that cannot perfect the conscience of the worshiper,"
    },
    {
      "verse": 10,
      "text": "but deal only with food and drink and various baptisms, regulations for the body imposed until the time comes to set things right."
    },
    {
      "verse": 11,
      "text": "But when Christ came as a high priest of the good things that have come, then through the greater and perfect tent (not made with hands, that is, not of this creation),"
    },
    {
      "verse": 12,
      "text": "he entered once for all into the Holy Place, not with the blood of goats and calves, but with his own blood, thus obtaining eternal redemption."
    },
    {
      "verse": 13,
      "text": "For if the blood of goats and bulls, with the sprinkling of the ashes of a heifer, sanctifies those who have been defiled so that their flesh is purified,"
    },
    {
      "verse": 14,
      "text": "how much more will the blood of Christ, who through the eternal Spirit offered himself without blemish to God, purify our conscience from dead works to worship the living God!"
    },
    {
      "verse": 15,
      "text": "For this reason he is the mediator of a new covenant, so that those who are called may receive the promised eternal inheritance, because a death has occurred that redeems them from the transgressions under the first covenant."
    },
    {
      "verse": 16,
      "text": "Where a will is involved, the death of the one who made it must be established."
    },
    {
      "verse": 17,
      "text": "For a will takes effect only at death, since it is not in force as long as the one who made it is alive."
    },
    {
      "verse": 18,
      "text": "Hence not even the first covenant was inaugurated without blood."
    },
    {
      "verse": 19,
      "text": "For when every commandment had been told to all the people by Moses in accordance with the law, he took the blood of calves and goats, with water and scarlet wool and hyssop, and sprinkled both the scroll itself and all the people,"
    },
    {
      "verse": 20,
      "text": "saying, “This is the blood of the covenant that God has ordained for you.”"
    },
    {
      "verse": 21,
      "text": "And in the same way he sprinkled with the blood both the tent and all the vessels used in worship."
    },
    {
      "verse": 22,
      "text": "Indeed, under the law almost everything is purified with blood, and without the shedding of blood there is no forgiveness of sins."
    },
    {
      "verse": 23,
      "text": "Thus it was necessary for the sketches of the heavenly things to be purified with these rites, but the heavenly things themselves need better sacrifices than these."
    },
    {
      "verse": 25,
      "text": "Nor was it to offer himself again and again, as the high priest enters the Holy Place year after year with blood that is not his own;"
    },
    {
      "verse": 26,
      "text": "for then he would have had to suffer again and again since the foundation of the world. But as it is, he has appeared once for all at the end of the age to remove sin by the sacrifice of himself."
    },
    {
      "verse": 27,
      "text": "And just as it is appointed for mortals to die once, and after that the judgment,"
    },
    {
      "verse": 28,
      "text": "so Christ, having been offered once to bear the sins of many, will appear a second time, not to deal with sin, but to save those who are eagerly waiting for him."
    }
  ],
  "timestamp": "2025-09-16T19:50:54.557669"
}