{
  "book": "HEB",
  "book_name": "Hebrews",
  "chapter": 12,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/HEB.12",
  "verses": [
    {
      "verse": 1,
      "text": "Therefore, since we are surrounded by so great a cloud of witnesses, let us also lay aside every weight and the sin that clings so closely, and let us run with perseverance the race that is set before us,"
    },
    {
      "verse": 2,
      "text": "looking to Jesus the pioneer and perfecter of our faith, who for the sake of the joy that was set before him endured the cross, disregarding its shame, and has taken his seat at the right hand of the throne of God."
    },
    {
      "verse": 3,
      "text": "Consider him who endured such hostility against himself from sinners, so that you may not grow weary or lose heart."
    },
    {
      "verse": 4,
      "text": "In your struggle against sin you have not yet resisted to the point of shedding your blood."
    },
    {
      "verse": 5,
      "text": "And you have forgotten the exhortation that addresses you as children— “My child, do not regard lightly the discipline of the Lord, or lose heart when you are punished by him;"
    },
    {
      "verse": 6,
      "text": "for the Lord disciplines those whom he loves, and chastises every child whom he accepts.”"
    },
    {
      "verse": 7,
      "text": "Endure trials for the sake of discipline. God is treating you as children; for what child is there whom a parent does not discipline?"
    },
    {
      "verse": 9,
      "text": "Moreover, we had human parents to discipline us, and we respected them. Should we not be even more willing to be subject to the Father of spirits and live?"
    },
    {
      "verse": 11,
      "text": "Now, discipline always seems painful rather than pleasant at the time, but later it yields the peaceful fruit of righteousness to those who have been trained by it."
    },
    {
      "verse": 12,
      "text": "Therefore lift your drooping hands and strengthen your weak knees,"
    },
    {
      "verse": 13,
      "text": "and make straight paths for your feet, so that what is lame may not be put out of joint, but rather be healed."
    },
    {
      "verse": 14,
      "text": "Pursue peace with everyone, and the holiness without which no one will see the Lord."
    },
    {
      "verse": 15,
      "text": "See to it that no one fails to obtain the grace of God; that no root of bitterness springs up and causes trouble, and through it many become defiled."
    },
    {
      "verse": 16,
      "text": "See to it that no one becomes like Esau, an immoral and godless person, who sold his birthright for a single meal."
    },
    {
      "verse": 17,
      "text": "You know that later, when he wanted to inherit the blessing, he was rejected, for he found no chance to repent, even though he sought the blessing with tears."
    },
    {
      "verse": 18,
      "text": "You have not come to something that can be touched, a blazing fire, and darkness, and gloom, and a tempest,"
    },
    {
      "verse": 19,
      "text": "and the sound of a trumpet, and a voice whose words made the hearers beg that not another word be spoken to them."
    },
    {
      "verse": 20,
      "text": "(For they could not endure the order that was given, “If even an animal touches the mountain, it shall be stoned to death.”"
    },
    {
      "verse": 21,
      "text": "Indeed, so terrifying was the sight that Moses said, “I tremble with fear.”)"
    },
    {
      "verse": 22,
      "text": "But you have come to Mount Zion and to the city of the living God, the heavenly Jerusalem, and to innumerable angels in festal gathering,"
    },
    {
      "verse": 23,
      "text": "and to the assembly of the firstborn who are enrolled in heaven, and to God the judge of all, and to the spirits of the righteous made perfect,"
    },
    {
      "verse": 24,
      "text": "and to Jesus, the mediator of a new covenant, and to the sprinkled blood that speaks a better word than the blood of Abel."
    },
    {
      "verse": 25,
      "text": "See that you do not refuse the one who is speaking; for if they did not escape when they refused the one who warned them on earth, how much less will we escape if we reject the one who warns from heaven!"
    },
    {
      "verse": 26,
      "text": "At that time his voice shook the earth; but now he has promised, “Yet once more I will shake not only the earth but also the heaven.”"
    },
    {
      "verse": 27,
      "text": "This phrase, “Yet once more,” indicates the removal of what is shaken—that is, created things—so that what cannot be shaken may remain."
    },
    {
      "verse": 28,
      "text": "Therefore, since we are receiving a kingdom that cannot be shaken, let us give thanks, by which we offer to God an acceptable worship with reverence and awe;"
    },
    {
      "verse": 29,
      "text": "for indeed our God is a consuming fire."
    }
  ],
  "timestamp": "2025-09-16T19:50:55.641231"
}