{
  "book": "HOS",
  "book_name": "Hosea",
  "chapter": 12,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/HOS.12",
  "verses": [
    {
      "verse": 1,
      "text": "Ephraim herds the wind, and pursues the east wind all day long; they multiply falsehood and violence; they make a treaty with Assyria, and oil is carried to Egypt."
    },
    {
      "verse": 2,
      "text": "The Lord has an indictment against Judah, and will punish Jacob according to his ways, and repay him according to his deeds."
    },
    {
      "verse": 3,
      "text": "In the womb he tried to supplant his brother, and in his manhood he strove with God."
    },
    {
      "verse": 4,
      "text": "He strove with the angel and prevailed, he wept and sought his favor; he met him at Bethel, and there he spoke with him."
    },
    {
      "verse": 5,
      "text": "The Lord the God of hosts, the Lord is his name!"
    },
    {
      "verse": 6,
      "text": "But as for you, return to your God, hold fast to love and justice, and wait continually for your God."
    },
    {
      "verse": 7,
      "text": "A trader, in whose hands are false balances, he loves to oppress."
    },
    {
      "verse": 8,
      "text": "Ephraim has said, “Ah, I am rich, I have gained wealth for myself; in all of my gain no offense has been found in me that would be sin.”"
    },
    {
      "verse": 9,
      "text": "I am the Lord your God from the land of Egypt; I will make you live in tents again, as in the days of the appointed festival."
    },
    {
      "verse": 10,
      "text": "I spoke to the prophets; it was I who multiplied visions, and through the prophets I will bring destruction."
    },
    {
      "verse": 11,
      "text": "In Gilead there is iniquity, they shall surely come to nothing. In Gilgal they sacrifice bulls, so their altars shall be like stone heaps on the furrows of the field."
    },
    {
      "verse": 12,
      "text": "Jacob fled to the land of Aram, there Israel served for a wife, and for a wife he guarded sheep."
    },
    {
      "verse": 13,
      "text": "By a prophet the Lord brought Israel up from Egypt, and by a prophet he was guarded."
    },
    {
      "verse": 14,
      "text": "Ephraim has given bitter offense, so his Lord will bring his crimes down on him and pay him back for his insults."
    }
  ],
  "timestamp": "2025-09-16T19:48:49.231853"
}