{
  "book": "HOS",
  "book_name": "Hosea",
  "chapter": 10,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/HOS.10",
  "verses": [
    {
      "verse": 1,
      "text": "Israel is a luxuriant vine that yields its fruit. The more his fruit increased the more altars he built; as his country improved, he improved his pillars."
    },
    {
      "verse": 2,
      "text": "Their heart is false; now they must bear their guilt. The Lord will break down their altars, and destroy their pillars."
    },
    {
      "verse": 3,
      "text": "For now they will say: “We have no king, for we do not fear the Lord, and a king—what could he do for us?”"
    },
    {
      "verse": 4,
      "text": "They utter mere words; with empty oaths they make covenants; so litigation springs up like poisonous weeds in the furrows of the field."
    },
    {
      "verse": 5,
      "text": "The inhabitants of Samaria tremble for the calf of Beth-aven. Its people shall mourn for it, and its idolatrous priests shall wail over it, over its glory that has departed from it."
    },
    {
      "verse": 6,
      "text": "The thing itself shall be carried to Assyria as tribute to the great king. Ephraim shall be put to shame, and Israel shall be ashamed of his idol."
    },
    {
      "verse": 7,
      "text": "Samaria's king shall perish like a chip on the face of the waters."
    },
    {
      "verse": 8,
      "text": "The high places of Aven, the sin of Israel, shall be destroyed. Thorn and thistle shall grow up on their altars. They shall say to the mountains, Cover us, and to the hills, Fall on us."
    },
    {
      "verse": 9,
      "text": "Since the days of Gibeah you have sinned, O Israel; there they have continued. Shall not war overtake them in Gibeah?"
    },
    {
      "verse": 10,
      "text": "I will come against the wayward people to punish them; and nations shall be gathered against them when they are punished for their double iniquity."
    },
    {
      "verse": 11,
      "text": "Ephraim was a trained heifer that loved to thresh, and I spared her fair neck; but I will make Ephraim break the ground; Judah must plow; Jacob must harrow for himself."
    },
    {
      "verse": 12,
      "text": "Sow for yourselves righteousness; reap steadfast love; break up your fallow ground; for it is time to seek the Lord, that he may come and rain righteousness upon you."
    },
    {
      "verse": 13,
      "text": "You have plowed wickedness, you have reaped injustice, you have eaten the fruit of lies. Because you have trusted in your power and in the multitude of your warriors,"
    },
    {
      "verse": 14,
      "text": "therefore the tumult of war shall rise against your people, and all your fortresses shall be destroyed, as Shalman destroyed Beth-arbel on the day of battle when mothers were dashed in pieces with their children."
    },
    {
      "verse": 15,
      "text": "Thus it shall be done to you, O Bethel, because of your great wickedness. At dawn the king of Israel shall be utterly cut off."
    }
  ],
  "timestamp": "2025-09-16T19:48:48.342016"
}