{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 41,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/ISA.41",
  "verses": [
    {
      "verse": 1,
      "text": "Listen to me in silence, O coastlands; let the peoples renew their strength; let them approach, then let them speak; let us together draw near for judgment."
    },
    {
      "verse": 2,
      "text": "Who has roused a victor from the east, summoned him to his service? He delivers up nations to him, and tramples kings under foot; he makes them like dust with his sword, like driven stubble with his bow."
    },
    {
      "verse": 3,
      "text": "He pursues them and passes on safely, scarcely touching the path with his feet."
    },
    {
      "verse": 4,
      "text": "Who has performed and done this, calling the generations from the beginning? I, the Lord, am first, and will be with the last."
    },
    {
      "verse": 5,
      "text": "The coastlands have seen and are afraid, the ends of the earth tremble; they have drawn near and come."
    },
    {
      "verse": 6,
      "text": "Each one helps the other, saying to one another, “Take courage!”"
    },
    {
      "verse": 7,
      "text": "The artisan encourages the goldsmith, and the one who smooths with the hammer encourages the one who strikes the anvil, saying of the soldering, “It is good”; and they fasten it with nails so that it cannot be moved."
    },
    {
      "verse": 8,
      "text": "But you, Israel, my servant, Jacob, whom I have chosen, the offspring of Abraham, my friend;"
    },
    {
      "verse": 9,
      "text": "you whom I took from the ends of the earth, and called from its farthest corners, saying to you, “You are my servant, I have chosen you and not cast you off!”;"
    },
    {
      "verse": 10,
      "text": "do not fear, for I am with you, do not be afraid, for I am your God; I will strengthen you, I will help you, I will uphold you with my victorious right hand."
    },
    {
      "verse": 11,
      "text": "Yes, all who are incensed against you shall be ashamed and disgraced; those who strive against you shall be as nothing and shall perish."
    },
    {
      "verse": 12,
      "text": "You shall seek those who contend with you, but you shall not find them; those who war against you shall be as nothing at all."
    },
    {
      "verse": 13,
      "text": "For I, the Lord your God, hold your right hand; it is I who say to you, “Do not fear, I will help you.”"
    },
    {
      "verse": 14,
      "text": "Do not fear, you worm Jacob, you insect Israel! I will help you, says the Lord; your Redeemer is the Holy One of Israel."
    },
    {
      "verse": 15,
      "text": "Now, I will make of you a threshing sledge, sharp, new, and having teeth; you shall thresh the mountains and crush them, and you shall make the hills like chaff."
    },
    {
      "verse": 16,
      "text": "You shall winnow them and the wind shall carry them away, and the tempest shall scatter them. Then you shall rejoice in the Lord; in the Holy One of Israel you shall glory."
    },
    {
      "verse": 17,
      "text": "When the poor and needy seek water, and there is none, and their tongue is parched with thirst, I the Lord will answer them, I the God of Israel will not forsake them."
    },
    {
      "verse": 18,
      "text": "I will open rivers on the bare heights, and fountains in the midst of the valleys; I will make the wilderness a pool of water, and the dry land springs of water."
    },
    {
      "verse": 19,
      "text": "I will put in the wilderness the cedar, the acacia, the myrtle, and the olive; I will set in the desert the cypress, the plane and the pine together,"
    },
    {
      "verse": 20,
      "text": "so that all may see and know, all may consider and understand, that the hand of the Lord has done this, the Holy One of Israel has created it."
    },
    {
      "verse": 21,
      "text": "Set forth your case, says the Lord; bring your proofs, says the King of Jacob."
    },
    {
      "verse": 22,
      "text": "Let them bring them, and tell us what is to happen. Tell us the former things, what they are, so that we may consider them, and that we may know their outcome; or declare to us the things to come."
    },
    {
      "verse": 23,
      "text": "Tell us what is to come hereafter, that we may know that you are gods; do good, or do harm, that we may be afraid and terrified."
    },
    {
      "verse": 24,
      "text": "You, indeed, are nothing and your work is nothing at all; whoever chooses you is an abomination."
    },
    {
      "verse": 25,
      "text": "I stirred up one from the north, and he has come, from the rising of the sun he was summoned by name. He shall trample on rulers as on mortar, as the potter treads clay."
    },
    {
      "verse": 26,
      "text": "Who declared it from the beginning, so that we might know, and beforehand, so that we might say, “He is right”? There was no one who declared it, none who proclaimed, none who heard your words."
    },
    {
      "verse": 27,
      "text": "I first have declared it to Zion, and I give to Jerusalem a herald of good tidings."
    },
    {
      "verse": 28,
      "text": "But when I look there is no one; among these there is no counselor who, when I ask, gives an answer."
    },
    {
      "verse": 29,
      "text": "No, they are all a delusion; their works are nothing; their images are empty wind."
    }
  ],
  "timestamp": "2025-09-16T19:47:48.441053"
}