{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 17,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/ISA.17",
  "verses": [
    {
      "verse": 1,
      "text": "An oracle concerning Damascus. See, Damascus will cease to be a city, and will become a heap of ruins."
    },
    {
      "verse": 2,
      "text": "Her towns will be deserted forever; they will be places for flocks, which will lie down, and no one will make them afraid."
    },
    {
      "verse": 3,
      "text": "The fortress will disappear from Ephraim, and the kingdom from Damascus; and the remnant of Aram will be like the glory of the children of Israel, says the Lord of hosts."
    },
    {
      "verse": 4,
      "text": "On that day the glory of Jacob will be brought low, and the fat of his flesh will grow lean."
    },
    {
      "verse": 5,
      "text": "And it shall be as when reapers gather standing grain and their arms harvest the ears, and as when one gleans the ears of grain in the Valley of Rephaim."
    },
    {
      "verse": 6,
      "text": "Gleanings will be left in it, as when an olive tree is beaten— two or three berries in the top of the highest bough, four or five on the branches of a fruit tree, says the Lord God of Israel."
    },
    {
      "verse": 7,
      "text": "On that day people will regard their Maker, and their eyes will look to the Holy One of Israel;"
    },
    {
      "verse": 8,
      "text": "they will not have regard for the altars, the work of their hands, and they will not look to what their own fingers have made, either the sacred poles or the altars of incense."
    },
    {
      "verse": 9,
      "text": "On that day their strong cities will be like the deserted places of the Hivites and the Amorites, which they deserted because of the children of Israel, and there will be desolation."
    },
    {
      "verse": 10,
      "text": "For you have forgotten the God of your salvation, and have not remembered the Rock of your refuge; therefore, though you plant pleasant plants and set out slips of an alien god,"
    },
    {
      "verse": 11,
      "text": "though you make them grow on the day that you plant them, and make them blossom in the morning that you sow; yet the harvest will flee away in a day of grief and incurable pain."
    },
    {
      "verse": 12,
      "text": "Ah, the thunder of many peoples, they thunder like the thundering of the sea! Ah, the roar of nations, they roar like the roaring of mighty waters!"
    },
    {
      "verse": 13,
      "text": "The nations roar like the roaring of many waters, but he will rebuke them, and they will flee far away, chased like chaff on the mountains before the wind and whirling dust before the storm."
    },
    {
      "verse": 14,
      "text": "At evening time, lo, terror! Before morning, they are no more. This is the fate of those who despoil us, and the lot of those who plunder us."
    }
  ],
  "timestamp": "2025-09-16T19:47:38.481021"
}