{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 21,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/ISA.21",
  "verses": [
    {
      "verse": 1,
      "text": "The oracle concerning the wilderness of the sea. As whirlwinds in the Negeb sweep on, it comes from the desert, from a terrible land."
    },
    {
      "verse": 2,
      "text": "A stern vision is told to me; the betrayer betrays, and the destroyer destroys. Go up, O Elam, lay siege, O Media; all the sighing she has caused I bring to an end."
    },
    {
      "verse": 3,
      "text": "Therefore my loins are filled with anguish; pangs have seized me, like the pangs of a woman in labor; I am bowed down so that I cannot hear, I am dismayed so that I cannot see."
    },
    {
      "verse": 4,
      "text": "My mind reels, horror has appalled me; the twilight I longed for has been turned for me into trembling."
    },
    {
      "verse": 5,
      "text": "They prepare the table, they spread the rugs, they eat, they drink. Rise up, commanders, oil the shield!"
    },
    {
      "verse": 6,
      "text": "For thus the Lord said to me: “Go, post a lookout, let him announce what he sees."
    },
    {
      "verse": 7,
      "text": "When he sees riders, horsemen in pairs, riders on donkeys, riders on camels, let him listen diligently, very diligently.”"
    },
    {
      "verse": 8,
      "text": "Then the watcher called out: “Upon a watchtower I stand, O Lord, continually by day, and at my post I am stationed throughout the night."
    },
    {
      "verse": 9,
      "text": "Look, there they come, riders, horsemen in pairs!” Then he responded, “Fallen, fallen is Babylon; and all the images of her gods lie shattered on the ground.”"
    },
    {
      "verse": 10,
      "text": "O my threshed and winnowed one, what I have heard from the Lord of hosts, the God of Israel, I announce to you."
    },
    {
      "verse": 11,
      "text": "The oracle concerning Dumah. One is calling to me from Seir, “Sentinel, what of the night? Sentinel, what of the night?”"
    },
    {
      "verse": 12,
      "text": "The sentinel says: “Morning comes, and also the night. If you will inquire, inquire; come back again.”"
    },
    {
      "verse": 13,
      "text": "The oracle concerning the desert plain. In the scrub of the desert plain you will lodge, O caravans of Dedanites."
    },
    {
      "verse": 14,
      "text": "Bring water to the thirsty, meet the fugitive with bread, O inhabitants of the land of Tema."
    },
    {
      "verse": 15,
      "text": "For they have fled from the swords, from the drawn sword, from the bent bow, and from the stress of battle."
    },
    {
      "verse": 16,
      "text": "For thus the Lord said to me: Within a year, according to the years of a hired worker, all the glory of Kedar will come to an end;"
    },
    {
      "verse": 17,
      "text": "and the remaining bows of Kedar's warriors will be few; for the Lord, the God of Israel, has spoken."
    }
  ],
  "timestamp": "2025-09-16T19:47:40.220626"
}