{
  "book": "JDG",
  "book_name": "Judges",
  "chapter": 1,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JDG.1",
  "verses": [
    {
      "verse": 1,
      "text": "After the death of Joshua, the Israelites inquired of the Lord, “Who shall go up first for us against the Canaanites, to fight against them?”"
    },
    {
      "verse": 2,
      "text": "The Lord said, “Judah shall go up. I hereby give the land into his hand.”"
    },
    {
      "verse": 3,
      "text": "Judah said to his brother Simeon, “Come up with me into the territory allotted to me, that we may fight against the Canaanites; then I too will go with you into the territory allotted to you.” So Simeon went with him."
    },
    {
      "verse": 4,
      "text": "Then Judah went up and the Lord gave the Canaanites and the Perizzites into their hand; and they defeated ten thousand of them at Bezek."
    },
    {
      "verse": 5,
      "text": "They came upon Adoni-bezek at Bezek, and fought against him, and defeated the Canaanites and the Perizzites."
    },
    {
      "verse": 6,
      "text": "Adoni-bezek fled; but they pursued him, and caught him, and cut off his thumbs and big toes."
    },
    {
      "verse": 7,
      "text": "Adoni-bezek said, “Seventy kings with their thumbs and big toes cut off used to pick up scraps under my table; as I have done, so God has paid me back.” They brought him to Jerusalem, and he died there."
    },
    {
      "verse": 8,
      "text": "Then the people of Judah fought against Jerusalem and took it. They put it to the sword and set the city on fire."
    },
    {
      "verse": 9,
      "text": "Afterward the people of Judah went down to fight against the Canaanites who lived in the hill country, in the Negeb, and in the lowland."
    },
    {
      "verse": 10,
      "text": "Judah went against the Canaanites who lived in Hebron (the name of Hebron was formerly Kiriath-arba); and they defeated Sheshai and Ahiman and Talmai."
    },
    {
      "verse": 11,
      "text": "From there they went against the inhabitants of Debir (the name of Debir was formerly Kiriath-sepher)."
    },
    {
      "verse": 12,
      "text": "Then Caleb said, “Whoever attacks Kiriath-sepher and takes it, I will give him my daughter Achsah as wife.”"
    },
    {
      "verse": 13,
      "text": "And Othniel son of Kenaz, Caleb's younger brother, took it; and he gave him his daughter Achsah as wife."
    },
    {
      "verse": 14,
      "text": "When she came to him, she urged him to ask her father for a field. As she dismounted from her donkey, Caleb said to her, “What do you wish?”"
    },
    {
      "verse": 15,
      "text": "She said to him, “Give me a present; since you have set me in the land of the Negeb, give me also Gulloth-mayim.” So Caleb gave her Upper Gulloth and Lower Gulloth."
    },
    {
      "verse": 16,
      "text": "The descendants of Hobab the Kenite, Moses' father-in-law, went up with the people of Judah from the city of palms into the wilderness of Judah, which lies in the Negeb near Arad. Then they went and settled with the Amalekites."
    },
    {
      "verse": 17,
      "text": "Judah went with his brother Simeon, and they defeated the Canaanites who inhabited Zephath, and devoted it to destruction. So the city was called Hormah."
    },
    {
      "verse": 18,
      "text": "Judah took Gaza with its territory, Ashkelon with its territory, and Ekron with its territory."
    },
    {
      "verse": 19,
      "text": "The Lord was with Judah, and he took possession of the hill country, but could not drive out the inhabitants of the plain, because they had chariots of iron."
    },
    {
      "verse": 20,
      "text": "Hebron was given to Caleb, as Moses had said; and he drove out from it the three sons of Anak."
    },
    {
      "verse": 21,
      "text": "But the Benjaminites did not drive out the Jebusites who lived in Jerusalem; so the Jebusites have lived in Jerusalem among the Benjaminites to this day."
    },
    {
      "verse": 22,
      "text": "The house of Joseph also went up against Bethel; and the Lord was with them."
    },
    {
      "verse": 23,
      "text": "The house of Joseph sent out spies to Bethel (the name of the city was formerly Luz)."
    },
    {
      "verse": 24,
      "text": "When the spies saw a man coming out of the city, they said to him, “Show us the way into the city, and we will deal kindly with you.”"
    },
    {
      "verse": 25,
      "text": "So he showed them the way into the city; and they put the city to the sword, but they let the man and all his family go."
    },
    {
      "verse": 26,
      "text": "So the man went to the land of the Hittites and built a city, and named it Luz; that is its name to this day."
    },
    {
      "verse": 27,
      "text": "Manasseh did not drive out the inhabitants of Beth-shean and its villages, or Taanach and its villages, or the inhabitants of Dor and its villages, or the inhabitants of Ibleam and its villages, or the inhabitants of Megiddo and its villages; but the Canaanites continued to live in that land."
    },
    {
      "verse": 28,
      "text": "When Israel grew strong, they put the Canaanites to forced labor, but did not in fact drive them out."
    },
    {
      "verse": 29,
      "text": "And Ephraim did not drive out the Canaanites who lived in Gezer; but the Canaanites lived among them in Gezer."
    },
    {
      "verse": 30,
      "text": "Zebulun did not drive out the inhabitants of Kitron, or the inhabitants of Nahalol; but the Canaanites lived among them, and became subject to forced labor."
    },
    {
      "verse": 31,
      "text": "Asher did not drive out the inhabitants of Acco, or the inhabitants of Sidon, or of Ahlab, or of Achzib, or of Helbah, or of Aphik, or of Rehob;"
    },
    {
      "verse": 32,
      "text": "but the Asherites lived among the Canaanites, the inhabitants of the land; for they did not drive them out."
    },
    {
      "verse": 33,
      "text": "Naphtali did not drive out the inhabitants of Beth-shemesh, or the inhabitants of Beth-anath, but lived among the Canaanites, the inhabitants of the land; nevertheless the inhabitants of Beth-shemesh and of Beth-anath became subject to forced labor for them."
    },
    {
      "verse": 34,
      "text": "The Amorites pressed the Danites back into the hill country; they did not allow them to come down to the plain."
    },
    {
      "verse": 35,
      "text": "The Amorites continued to live in Har-heres, in Aijalon, and in Shaalbim, but the hand of the house of Joseph rested heavily on them, and they became subject to forced labor."
    },
    {
      "verse": 36,
      "text": "The border of the Amorites ran from the ascent of Akrabbim, from Sela and upward."
    }
  ],
  "timestamp": "2025-09-16T19:44:32.500171"
}