{
  "book": "JDG",
  "book_name": "Judges",
  "chapter": 21,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JDG.21",
  "verses": [
    {
      "verse": 1,
      "text": "Now the Israelites had sworn at Mizpah, “No one of us shall give his daughter in marriage to Benjamin.”"
    },
    {
      "verse": 2,
      "text": "And the people came to Bethel, and sat there until evening before God, and they lifted up their voices and wept bitterly."
    },
    {
      "verse": 3,
      "text": "They said, “O Lord, the God of Israel, why has it come to pass that today there should be one tribe lacking in Israel?”"
    },
    {
      "verse": 4,
      "text": "On the next day, the people got up early, and built an altar there, and offered burnt offerings and sacrifices of well-being."
    },
    {
      "verse": 5,
      "text": "Then the Israelites said, “Which of all the tribes of Israel did not come up in the assembly to the Lord?” For a solemn oath had been taken concerning whoever did not come up to the Lord to Mizpah, saying, “That one shall be put to death.”"
    },
    {
      "verse": 6,
      "text": "But the Israelites had compassion for Benjamin their kin, and said, “One tribe is cut off from Israel this day."
    },
    {
      "verse": 7,
      "text": "What shall we do for wives for those who are left, since we have sworn by the Lord that we will not give them any of our daughters as wives?”"
    },
    {
      "verse": 8,
      "text": "Then they said, “Is there anyone from the tribes of Israel who did not come up to the Lord to Mizpah?” It turned out that no one from Jabesh-gilead had come to the camp, to the assembly."
    },
    {
      "verse": 9,
      "text": "For when the roll was called among the people, not one of the inhabitants of Jabesh-gilead was there."
    },
    {
      "verse": 10,
      "text": "So the congregation sent twelve thousand soldiers there and commanded them, “Go, put the inhabitants of Jabesh-gilead to the sword, including the women and the little ones."
    },
    {
      "verse": 11,
      "text": "This is what you shall do; every male and every woman that has lain with a male you shall devote to destruction.”"
    },
    {
      "verse": 12,
      "text": "And they found among the inhabitants of Jabesh-gilead four hundred young virgins who had never slept with a man and brought them to the camp at Shiloh, which is in the land of Canaan."
    },
    {
      "verse": 13,
      "text": "Then the whole congregation sent word to the Benjaminites who were at the rock of Rimmon, and proclaimed peace to them."
    },
    {
      "verse": 14,
      "text": "Benjamin returned at that time; and they gave them the women whom they had saved alive of the women of Jabesh-gilead; but they did not suffice for them."
    },
    {
      "verse": 15,
      "text": "The people had compassion on Benjamin because the Lord had made a breach in the tribes of Israel."
    },
    {
      "verse": 16,
      "text": "So the elders of the congregation said, “What shall we do for wives for those who are left, since there are no women left in Benjamin?”"
    },
    {
      "verse": 17,
      "text": "And they said, “There must be heirs for the survivors of Benjamin, in order that a tribe may not be blotted out from Israel."
    },
    {
      "verse": 18,
      "text": "Yet we cannot give any of our daughters to them as wives.” For the Israelites had sworn, “Cursed be anyone who gives a wife to Benjamin.”"
    },
    {
      "verse": 19,
      "text": "So they said, “Look, the yearly festival of the Lord is taking place at Shiloh, which is north of Bethel, on the east of the highway that goes up from Bethel to Shechem, and south of Lebonah.”"
    },
    {
      "verse": 20,
      "text": "And they instructed the Benjaminites, saying, “Go and lie in wait in the vineyards,"
    },
    {
      "verse": 21,
      "text": "and watch; when the young women of Shiloh come out to dance in the dances, then come out of the vineyards and each of you carry off a wife for himself from the young women of Shiloh, and go to the land of Benjamin."
    },
    {
      "verse": 22,
      "text": "Then if their fathers or their brothers come to complain to us, we will say to them, ‘Be generous and allow us to have them; because we did not capture in battle a wife for each man. But neither did you incur guilt by giving your daughters to them.’ ”"
    },
    {
      "verse": 23,
      "text": "The Benjaminites did so; they took wives for each of them from the dancers whom they abducted. Then they went and returned to their territory, and rebuilt the towns, and lived in them."
    },
    {
      "verse": 24,
      "text": "So the Israelites departed from there at that time by tribes and families, and they went out from there to their own territories."
    },
    {
      "verse": 25,
      "text": "In those days there was no king in Israel; all the people did what was right in their own eyes."
    }
  ],
  "timestamp": "2025-09-16T19:44:38.728945"
}