{
  "book": "JER",
  "book_name": "Jeremiah",
  "chapter": 17,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JER.17",
  "verses": [
    {
      "verse": 1,
      "text": "The sin of Judah is written with an iron pen; with a diamond point it is engraved on the tablet of their hearts, and on the horns of their altars,"
    },
    {
      "verse": 2,
      "text": "while their children remember their altars and their sacred poles, beside every green tree, and on the high hills,"
    },
    {
      "verse": 3,
      "text": "on the mountains in the open country. Your wealth and all your treasures I will give for spoil as the price of your sin throughout all your territory."
    },
    {
      "verse": 4,
      "text": "By your own act you shall lose the heritage that I gave you, and I will make you serve your enemies in a land that you do not know, for in my anger a fire is kindled that shall burn forever."
    },
    {
      "verse": 5,
      "text": "Thus says the Lord: Cursed are those who trust in mere mortals and make mere flesh their strength, whose hearts turn away from the Lord."
    },
    {
      "verse": 6,
      "text": "They shall be like a shrub in the desert, and shall not see when relief comes. They shall live in the parched places of the wilderness, in an uninhabited salt land."
    },
    {
      "verse": 7,
      "text": "Blessed are those who trust in the Lord, whose trust is the Lord."
    },
    {
      "verse": 8,
      "text": "They shall be like a tree planted by water, sending out its roots by the stream. It shall not fear when heat comes, and its leaves shall stay green; in the year of drought it is not anxious, and it does not cease to bear fruit."
    },
    {
      "verse": 9,
      "text": "The heart is devious above all else; it is perverse— who can understand it?"
    },
    {
      "verse": 10,
      "text": "I the Lord test the mind and search the heart, to give to all according to their ways, according to the fruit of their doings."
    },
    {
      "verse": 11,
      "text": "Like the partridge hatching what it did not lay, so are all who amass wealth unjustly; in mid-life it will leave them, and at their end they will prove to be fools."
    },
    {
      "verse": 12,
      "text": "O glorious throne, exalted from the beginning, shrine of our sanctuary!"
    },
    {
      "verse": 13,
      "text": "O hope of Israel! O Lord! All who forsake you shall be put to shame; those who turn away from you shall be recorded in the underworld, for they have forsaken the fountain of living water, the Lord."
    },
    {
      "verse": 14,
      "text": "Heal me, O Lord, and I shall be healed; save me, and I shall be saved; for you are my praise."
    },
    {
      "verse": 15,
      "text": "See how they say to me, “Where is the word of the Lord? Let it come!”"
    },
    {
      "verse": 16,
      "text": "But I have not run away from being a shepherd in your service, nor have I desired the fatal day. You know what came from my lips; it was before your face."
    },
    {
      "verse": 17,
      "text": "Do not become a terror to me; you are my refuge in the day of disaster;"
    },
    {
      "verse": 18,
      "text": "Let my persecutors be shamed, but do not let me be shamed; let them be dismayed, but do not let me be dismayed; bring on them the day of disaster; destroy them with double destruction!"
    },
    {
      "verse": 19,
      "text": "Thus said the Lord to me: Go and stand in the People's Gate, by which the kings of Judah enter and by which they go out, and in all the gates of Jerusalem,"
    },
    {
      "verse": 20,
      "text": "and say to them: Hear the word of the Lord, you kings of Judah, and all Judah, and all the inhabitants of Jerusalem, who enter by these gates."
    },
    {
      "verse": 21,
      "text": "Thus says the Lord: For the sake of your lives, take care that you do not bear a burden on the sabbath day or bring it in by the gates of Jerusalem."
    },
    {
      "verse": 22,
      "text": "And do not carry a burden out of your houses on the sabbath or do any work, but keep the sabbath day holy, as I commanded your ancestors."
    },
    {
      "verse": 23,
      "text": "Yet they did not listen or incline their ear; they stiffened their necks and would not hear or receive instruction."
    },
    {
      "verse": 24,
      "text": "But if you listen to me, says the Lord, and bring in no burden by the gates of this city on the sabbath day, but keep the sabbath day holy and do no work on it,"
    },
    {
      "verse": 25,
      "text": "then there shall enter by the gates of this city kings who sit on the throne of David, riding in chariots and on horses, they and their officials, the people of Judah and the inhabitants of Jerusalem; and this city shall be inhabited forever."
    },
    {
      "verse": 26,
      "text": "And people shall come from the towns of Judah and the places around Jerusalem, from the land of Benjamin, from the Shephelah, from the hill country, and from the Negeb, bringing burnt offerings and sacrifices, grain offerings and frankincense, and bringing thank offerings to the house of the Lord."
    },
    {
      "verse": 27,
      "text": "But if you do not listen to me, to keep the sabbath day holy, and to carry in no burden through the gates of Jerusalem on the sabbath day, then I will kindle a fire in its gates; it shall devour the palaces of Jerusalem and shall not be quenched."
    }
  ],
  "timestamp": "2025-09-16T19:48:03.425091"
}