{
  "book": "JER",
  "book_name": "Jeremiah",
  "chapter": 26,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JER.26",
  "verses": [
    {
      "verse": 1,
      "text": "At the beginning of the reign of King Jehoiakim son of Josiah of Judah, this word came from the Lord:"
    },
    {
      "verse": 2,
      "text": "Thus says the Lord: Stand in the court of the Lord 's house, and speak to all the cities of Judah that come to worship in the house of the Lord; speak to them all the words that I command you; do not hold back a word."
    },
    {
      "verse": 3,
      "text": "It may be that they will listen, all of them, and will turn from their evil way, that I may change my mind about the disaster that I intend to bring on them because of their evil doings."
    },
    {
      "verse": 4,
      "text": "You shall say to them: Thus says the Lord: If you will not listen to me, to walk in my law that I have set before you,"
    },
    {
      "verse": 5,
      "text": "and to heed the words of my servants the prophets whom I send to you urgently—though you have not heeded—"
    },
    {
      "verse": 6,
      "text": "then I will make this house like Shiloh, and I will make this city a curse for all the nations of the earth."
    },
    {
      "verse": 7,
      "text": "The priests and the prophets and all the people heard Jeremiah speaking these words in the house of the Lord."
    },
    {
      "verse": 8,
      "text": "And when Jeremiah had finished speaking all that the Lord had commanded him to speak to all the people, then the priests and the prophets and all the people laid hold of him, saying, “You shall die!"
    },
    {
      "verse": 9,
      "text": "Why have you prophesied in the name of the Lord, saying, ‘This house shall be like Shiloh, and this city shall be desolate, without inhabitant’?” And all the people gathered around Jeremiah in the house of the Lord."
    },
    {
      "verse": 10,
      "text": "When the officials of Judah heard these things, they came up from the king's house to the house of the Lord and took their seat in the entry of the New Gate of the house of the Lord."
    },
    {
      "verse": 11,
      "text": "Then the priests and the prophets said to the officials and to all the people, “This man deserves the sentence of death because he has prophesied against this city, as you have heard with your own ears.”"
    },
    {
      "verse": 12,
      "text": "Then Jeremiah spoke to all the officials and all the people, saying, “It is the Lord who sent me to prophesy against this house and this city all the words you have heard."
    },
    {
      "verse": 13,
      "text": "Now therefore amend your ways and your doings, and obey the voice of the Lord your God, and the Lord will change his mind about the disaster that he has pronounced against you."
    },
    {
      "verse": 14,
      "text": "But as for me, here I am in your hands. Do with me as seems good and right to you."
    },
    {
      "verse": 15,
      "text": "Only know for certain that if you put me to death, you will be bringing innocent blood upon yourselves and upon this city and its inhabitants, for in truth the Lord sent me to you to speak all these words in your ears.”"
    },
    {
      "verse": 16,
      "text": "Then the officials and all the people said to the priests and the prophets, “This man does not deserve the sentence of death, for he has spoken to us in the name of the Lord our God.”"
    },
    {
      "verse": 17,
      "text": "And some of the elders of the land arose and said to all the assembled people,"
    },
    {
      "verse": 18,
      "text": "“Micah of Moresheth, who prophesied during the days of King Hezekiah of Judah, said to all the people of Judah: ‘Thus says the Lord of hosts, Zion shall be plowed as a field; Jerusalem shall become a heap of ruins, and the mountain of the house a wooded height.’"
    },
    {
      "verse": 19,
      "text": "Did King Hezekiah of Judah and all Judah actually put him to death? Did he not fear the Lord and entreat the favor of the Lord, and did not the Lord change his mind about the disaster that he had pronounced against them? But we are about to bring great disaster on ourselves!”"
    },
    {
      "verse": 20,
      "text": "There was another man prophesying in the name of the Lord, Uriah son of Shemaiah from Kiriath-jearim. He prophesied against this city and against this land in words exactly like those of Jeremiah."
    },
    {
      "verse": 21,
      "text": "And when King Jehoiakim, with all his warriors and all the officials, heard his words, the king sought to put him to death; but when Uriah heard of it, he was afraid and fled and escaped to Egypt."
    },
    {
      "verse": 22,
      "text": "Then King Jehoiakim sent Elnathan son of Achbor and men with him to Egypt,"
    },
    {
      "verse": 23,
      "text": "and they took Uriah from Egypt and brought him to King Jehoiakim, who struck him down with the sword and threw his dead body into the burial place of the common people."
    },
    {
      "verse": 24,
      "text": "But the hand of Ahikam son of Shaphan was with Jeremiah so that he was not given over into the hands of the people to be put to death."
    }
  ],
  "timestamp": "2025-09-16T19:48:06.466152"
}