{
  "book": "JHN",
  "book_name": "John",
  "chapter": 7,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JHN.7",
  "verses": [
    {
      "verse": 1,
      "text": "After this Jesus went about in Galilee. He did not wish to go about in Judea because the Jews were looking for an opportunity to kill him."
    },
    {
      "verse": 2,
      "text": "Now the Jewish festival of Booths was near."
    },
    {
      "verse": 3,
      "text": "So his brothers said to him, “Leave here and go to Judea so that your disciples also may see the works you are doing;"
    },
    {
      "verse": 4,
      "text": "for no one who wants to be widely known acts in secret. If you do these things, show yourself to the world.”"
    },
    {
      "verse": 5,
      "text": "(For not even his brothers believed in him.)"
    },
    {
      "verse": 6,
      "text": "Jesus said to them, “My time has not yet come, but your time is always here."
    },
    {
      "verse": 7,
      "text": "The world cannot hate you, but it hates me because I testify against it that its works are evil."
    },
    {
      "verse": 8,
      "text": "Go to the festival yourselves. I am not going to this festival, for my time has not yet fully come.”"
    },
    {
      "verse": 9,
      "text": "After saying this, he remained in Galilee."
    },
    {
      "verse": 10,
      "text": "But after his brothers had gone to the festival, then he also went, not publicly but as it were in secret."
    },
    {
      "verse": 11,
      "text": "The Jews were looking for him at the festival and saying, “Where is he?”"
    },
    {
      "verse": 12,
      "text": "And there was considerable complaining about him among the crowds. While some were saying, “He is a good man,” others were saying, “No, he is deceiving the crowd.”"
    },
    {
      "verse": 13,
      "text": "Yet no one would speak openly about him for fear of the Jews."
    },
    {
      "verse": 14,
      "text": "About the middle of the festival Jesus went up into the temple and began to teach."
    },
    {
      "verse": 15,
      "text": "The Jews were astonished at it, saying, “How does this man have such learning, when he has never been taught?”"
    },
    {
      "verse": 16,
      "text": "Then Jesus answered them, “My teaching is not mine but his who sent me."
    },
    {
      "verse": 17,
      "text": "Anyone who resolves to do the will of God will know whether the teaching is from God or whether I am speaking on my own."
    },
    {
      "verse": 18,
      "text": "Those who speak on their own seek their own glory; but the one who seeks the glory of him who sent him is true, and there is nothing false in him."
    },
    {
      "verse": 19,
      "text": "“Did not Moses give you the law? Yet none of you keeps the law. Why are you looking for an opportunity to kill me?”"
    },
    {
      "verse": 20,
      "text": "The crowd answered, “You have a demon! Who is trying to kill you?”"
    },
    {
      "verse": 21,
      "text": "Jesus answered them, “I performed one work, and all of you are astonished."
    },
    {
      "verse": 22,
      "text": "Moses gave you circumcision (it is, of course, not from Moses, but from the patriarchs), and you circumcise a man on the sabbath."
    },
    {
      "verse": 23,
      "text": "If a man receives circumcision on the sabbath in order that the law of Moses may not be broken, are you angry with me because I healed a man's whole body on the sabbath?"
    },
    {
      "verse": 24,
      "text": "Do not judge by appearances, but judge with right judgment.”"
    },
    {
      "verse": 25,
      "text": "Now some of the people of Jerusalem were saying, “Is not this the man whom they are trying to kill?"
    },
    {
      "verse": 26,
      "text": "And here he is, speaking openly, but they say nothing to him! Can it be that the authorities really know that this is the Messiah?"
    },
    {
      "verse": 27,
      "text": "Yet we know where this man is from; but when the Messiah comes, no one will know where he is from.”"
    },
    {
      "verse": 28,
      "text": "Then Jesus cried out as he was teaching in the temple, “You know me, and you know where I am from. I have not come on my own. But the one who sent me is true, and you do not know him."
    },
    {
      "verse": 29,
      "text": "I know him, because I am from him, and he sent me.”"
    },
    {
      "verse": 30,
      "text": "Then they tried to arrest him, but no one laid hands on him, because his hour had not yet come."
    },
    {
      "verse": 31,
      "text": "Yet many in the crowd believed in him and were saying, “When the Messiah comes, will he do more signs than this man has done?”"
    },
    {
      "verse": 32,
      "text": "The Pharisees heard the crowd muttering such things about him, and the chief priests and Pharisees sent temple police to arrest him."
    },
    {
      "verse": 33,
      "text": "Jesus then said, “I will be with you a little while longer, and then I am going to him who sent me."
    },
    {
      "verse": 34,
      "text": "You will search for me, but you will not find me; and where I am, you cannot come.”"
    },
    {
      "verse": 35,
      "text": "The Jews said to one another, “Where does this man intend to go that we will not find him? Does he intend to go to the Dispersion among the Greeks and teach the Greeks?"
    },
    {
      "verse": 36,
      "text": "What does he mean by saying, ‘You will search for me and you will not find me’ and ‘Where I am, you cannot come’?”"
    },
    {
      "verse": 37,
      "text": "On the last day of the festival, the great day, while Jesus was standing there, he cried out, “Let anyone who is thirsty come to me,"
    },
    {
      "verse": 38,
      "text": "and let the one who believes in me drink. As the scripture has said, ‘Out of the believer's heart shall flow rivers of living water.’ ”"
    },
    {
      "verse": 39,
      "text": "Now he said this about the Spirit, which believers in him were to receive; for as yet there was no Spirit, because Jesus was not yet glorified."
    },
    {
      "verse": 40,
      "text": "When they heard these words, some in the crowd said, “This is really the prophet.”"
    },
    {
      "verse": 41,
      "text": "Others said, “This is the Messiah.” But some asked, “Surely the Messiah does not come from Galilee, does he?"
    },
    {
      "verse": 42,
      "text": "Has not the scripture said that the Messiah is descended from David and comes from Bethlehem, the village where David lived?”"
    },
    {
      "verse": 43,
      "text": "So there was a division in the crowd because of him."
    },
    {
      "verse": 44,
      "text": "Some of them wanted to arrest him, but no one laid hands on him."
    },
    {
      "verse": 45,
      "text": "Then the temple police went back to the chief priests and Pharisees, who asked them, “Why did you not arrest him?”"
    },
    {
      "verse": 46,
      "text": "The police answered, “Never has anyone spoken like this!”"
    },
    {
      "verse": 47,
      "text": "Then the Pharisees replied, “Surely you have not been deceived too, have you?"
    },
    {
      "verse": 48,
      "text": "Has any one of the authorities or of the Pharisees believed in him?"
    },
    {
      "verse": 49,
      "text": "But this crowd, which does not know the law—they are accursed.”"
    },
    {
      "verse": 50,
      "text": "Nicodemus, who had gone to Jesus before, and who was one of them, asked,"
    },
    {
      "verse": 51,
      "text": "“Our law does not judge people without first giving them a hearing to find out what they are doing, does it?”"
    },
    {
      "verse": 52,
      "text": "They replied, “Surely you are not also from Galilee, are you? Search and you will see that no prophet is to arise from Galilee.”"
    },
    {
      "verse": 53,
      "text": "Then each of them went home,"
    }
  ],
  "timestamp": "2025-09-16T19:49:50.560317"
}