{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 41,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOB.41",
  "verses": [
    {
      "verse": 1,
      "text": "“Can you draw out Leviathan with a fishhook, or press down its tongue with a cord?"
    },
    {
      "verse": 2,
      "text": "Can you put a rope in its nose, or pierce its jaw with a hook?"
    },
    {
      "verse": 3,
      "text": "Will it make many supplications to you? Will it speak soft words to you?"
    },
    {
      "verse": 4,
      "text": "Will it make a covenant with you to be taken as your servant forever?"
    },
    {
      "verse": 5,
      "text": "Will you play with it as with a bird, or will you put it on leash for your girls?"
    },
    {
      "verse": 6,
      "text": "Will traders bargain over it? Will they divide it up among the merchants?"
    },
    {
      "verse": 7,
      "text": "Can you fill its skin with harpoons, or its head with fishing spears?"
    },
    {
      "verse": 8,
      "text": "Lay hands on it; think of the battle; you will not do it again!"
    },
    {
      "verse": 9,
      "text": "Any hope of capturing it will be disappointed; were not even the gods overwhelmed at the sight of it?"
    },
    {
      "verse": 10,
      "text": "No one is so fierce as to dare to stir it up. Who can stand before it?"
    },
    {
      "verse": 11,
      "text": "Who can confront it and be safe? —under the whole heaven, who?"
    },
    {
      "verse": 12,
      "text": "“I will not keep silence concerning its limbs, or its mighty strength, or its splendid frame."
    },
    {
      "verse": 13,
      "text": "Who can strip off its outer garment? Who can penetrate its double coat of mail?"
    },
    {
      "verse": 14,
      "text": "Who can open the doors of its face? There is terror all around its teeth."
    },
    {
      "verse": 15,
      "text": "Its back is made of shields in rows, shut up closely as with a seal."
    },
    {
      "verse": 16,
      "text": "One is so near to another that no air can come between them."
    },
    {
      "verse": 17,
      "text": "They are joined one to another; they clasp each other and cannot be separated."
    },
    {
      "verse": 18,
      "text": "Its sneezes flash forth light, and its eyes are like the eyelids of the dawn."
    },
    {
      "verse": 19,
      "text": "From its mouth go flaming torches; sparks of fire leap out."
    },
    {
      "verse": 20,
      "text": "Out of its nostrils comes smoke, as from a boiling pot and burning rushes."
    },
    {
      "verse": 21,
      "text": "Its breath kindles coals, and a flame comes out of its mouth."
    },
    {
      "verse": 22,
      "text": "In its neck abides strength, and terror dances before it."
    },
    {
      "verse": 23,
      "text": "The folds of its flesh cling together; it is firmly cast and immovable."
    },
    {
      "verse": 24,
      "text": "Its heart is as hard as stone, as hard as the lower millstone."
    },
    {
      "verse": 25,
      "text": "When it raises itself up the gods are afraid; at the crashing they are beside themselves."
    },
    {
      "verse": 26,
      "text": "Though the sword reaches it, it does not avail, nor does the spear, the dart, or the javelin."
    },
    {
      "verse": 27,
      "text": "It counts iron as straw, and bronze as rotten wood."
    },
    {
      "verse": 28,
      "text": "The arrow cannot make it flee; slingstones, for it, are turned to chaff."
    },
    {
      "verse": 29,
      "text": "Clubs are counted as chaff; it laughs at the rattle of javelins."
    },
    {
      "verse": 30,
      "text": "Its underparts are like sharp potsherds; it spreads itself like a threshing sledge on the mire."
    },
    {
      "verse": 31,
      "text": "It makes the deep boil like a pot; it makes the sea like a pot of ointment."
    },
    {
      "verse": 32,
      "text": "It leaves a shining wake behind it; one would think the deep to be white-haired."
    },
    {
      "verse": 33,
      "text": "On earth it has no equal, a creature without fear."
    },
    {
      "verse": 34,
      "text": "It surveys everything that is lofty; it is king over all that are proud.”"
    }
  ],
  "timestamp": "2025-09-16T19:46:18.677705"
}