{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 1,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOB.1",
  "verses": [
    {
      "verse": 1,
      "text": "There was once a man in the land of Uz whose name was Job. That man was blameless and upright, one who feared God and turned away from evil."
    },
    {
      "verse": 2,
      "text": "There were born to him seven sons and three daughters."
    },
    {
      "verse": 3,
      "text": "He had seven thousand sheep, three thousand camels, five hundred yoke of oxen, five hundred donkeys, and very many servants; so that this man was the greatest of all the people of the east."
    },
    {
      "verse": 4,
      "text": "His sons used to go and hold feasts in one another's houses in turn; and they would send and invite their three sisters to eat and drink with them."
    },
    {
      "verse": 5,
      "text": "And when the feast days had run their course, Job would send and sanctify them, and he would rise early in the morning and offer burnt offerings according to the number of them all; for Job said, “It may be that my children have sinned, and cursed God in their hearts.” This is what Job always did."
    },
    {
      "verse": 6,
      "text": "One day the heavenly beings came to present themselves before the Lord, and Satan also came among them."
    },
    {
      "verse": 7,
      "text": "The Lord said to Satan, “Where have you come from?” Satan answered the Lord, “From going to and fro on the earth, and from walking up and down on it.”"
    },
    {
      "verse": 8,
      "text": "The Lord said to Satan, “Have you considered my servant Job? There is no one like him on the earth, a blameless and upright man who fears God and turns away from evil.”"
    },
    {
      "verse": 9,
      "text": "Then Satan answered the Lord, “Does Job fear God for nothing?"
    },
    {
      "verse": 10,
      "text": "Have you not put a fence around him and his house and all that he has, on every side? You have blessed the work of his hands, and his possessions have increased in the land."
    },
    {
      "verse": 11,
      "text": "But stretch out your hand now, and touch all that he has, and he will curse you to your face.”"
    },
    {
      "verse": 12,
      "text": "The Lord said to Satan, “Very well, all that he has is in your power; only do not stretch out your hand against him!” So Satan went out from the presence of the Lord."
    },
    {
      "verse": 13,
      "text": "One day when his sons and daughters were eating and drinking wine in the eldest brother's house,"
    },
    {
      "verse": 14,
      "text": "a messenger came to Job and said, “The oxen were plowing and the donkeys were feeding beside them,"
    },
    {
      "verse": 15,
      "text": "and the Sabeans fell on them and carried them off, and killed the servants with the edge of the sword; I alone have escaped to tell you.”"
    },
    {
      "verse": 16,
      "text": "While he was still speaking, another came and said, “The fire of God fell from heaven and burned up the sheep and the servants, and consumed them; I alone have escaped to tell you.”"
    },
    {
      "verse": 17,
      "text": "While he was still speaking, another came and said, “The Chaldeans formed three columns, made a raid on the camels and carried them off, and killed the servants with the edge of the sword; I alone have escaped to tell you.”"
    },
    {
      "verse": 18,
      "text": "While he was still speaking, another came and said, “Your sons and daughters were eating and drinking wine in their eldest brother's house,"
    },
    {
      "verse": 19,
      "text": "and suddenly a great wind came across the desert, struck the four corners of the house, and it fell on the young people, and they are dead; I alone have escaped to tell you.”"
    },
    {
      "verse": 20,
      "text": "Then Job arose, tore his robe, shaved his head, and fell on the ground and worshiped."
    },
    {
      "verse": 21,
      "text": "He said, “Naked I came from my mother's womb, and naked shall I return there; the Lord gave, and the Lord has taken away; blessed be the name of the Lord.”"
    },
    {
      "verse": 22,
      "text": "In all this Job did not sin or charge God with wrongdoing."
    }
  ],
  "timestamp": "2025-09-16T19:46:04.500186"
}