{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 39,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOB.39",
  "verses": [
    {
      "verse": 1,
      "text": "“Do you know when the mountain goats give birth? Do you observe the calving of the deer?"
    },
    {
      "verse": 2,
      "text": "Can you number the months that they fulfill, and do you know the time when they give birth,"
    },
    {
      "verse": 3,
      "text": "when they crouch to give birth to their offspring, and are delivered of their young?"
    },
    {
      "verse": 4,
      "text": "Their young ones become strong, they grow up in the open; they go forth, and do not return to them."
    },
    {
      "verse": 5,
      "text": "“Who has let the wild ass go free? Who has loosed the bonds of the swift ass,"
    },
    {
      "verse": 6,
      "text": "to which I have given the steppe for its home, the salt land for its dwelling place?"
    },
    {
      "verse": 7,
      "text": "It scorns the tumult of the city; it does not hear the shouts of the driver."
    },
    {
      "verse": 8,
      "text": "It ranges the mountains as its pasture, and it searches after every green thing."
    },
    {
      "verse": 9,
      "text": "“Is the wild ox willing to serve you? Will it spend the night at your crib?"
    },
    {
      "verse": 10,
      "text": "Can you tie it in the furrow with ropes, or will it harrow the valleys after you?"
    },
    {
      "verse": 11,
      "text": "Will you depend on it because its strength is great, and will you hand over your labor to it?"
    },
    {
      "verse": 12,
      "text": "Do you have faith in it that it will return, and bring your grain to your threshing floor?"
    },
    {
      "verse": 13,
      "text": "“The ostrich's wings flap wildly, though its pinions lack plumage."
    },
    {
      "verse": 14,
      "text": "For it leaves its eggs to the earth, and lets them be warmed on the ground,"
    },
    {
      "verse": 15,
      "text": "forgetting that a foot may crush them, and that a wild animal may trample them."
    },
    {
      "verse": 16,
      "text": "It deals cruelly with its young, as if they were not its own; though its labor should be in vain, yet it has no fear;"
    },
    {
      "verse": 17,
      "text": "because God has made it forget wisdom,"
    },
    {
      "verse": 18,
      "text": "When it spreads its plumes aloft, it laughs at the horse and its rider."
    },
    {
      "verse": 19,
      "text": "“Do you give the horse its might? Do you clothe its neck with mane?"
    },
    {
      "verse": 20,
      "text": "Do you make it leap like the locust? Its majestic snorting is terrible."
    },
    {
      "verse": 21,
      "text": "It paws violently, exults mightily; it goes out to meet the weapons."
    },
    {
      "verse": 22,
      "text": "It laughs at fear, and is not dismayed; it does not turn back from the sword."
    },
    {
      "verse": 23,
      "text": "Upon it rattle the quiver, the flashing spear, and the javelin."
    },
    {
      "verse": 24,
      "text": "With fierceness and rage it swallows the ground; it cannot stand still at the sound of the trumpet."
    },
    {
      "verse": 25,
      "text": "When the trumpet sounds, it says ‘Aha!’ From a distance it smells the battle, the thunder of the captains, and the shouting."
    },
    {
      "verse": 26,
      "text": "“Is it by your wisdom that the hawk soars, and spreads its wings toward the south?"
    },
    {
      "verse": 27,
      "text": "Is it at your command that the eagle mounts up and makes its nest on high?"
    },
    {
      "verse": 28,
      "text": "It lives on the rock and makes its home in the fastness of the rocky crag."
    },
    {
      "verse": 29,
      "text": "From there it spies the prey; its eyes see it from far away."
    },
    {
      "verse": 30,
      "text": "Its young ones suck up blood; and where the slain are, there it is.”"
    }
  ],
  "timestamp": "2025-09-16T19:46:18.057598"
}