{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 3,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOB.3",
  "verses": [
    {
      "verse": 1,
      "text": "After this Job opened his mouth and cursed the day of his birth."
    },
    {
      "verse": 2,
      "text": "Job said:"
    },
    {
      "verse": 3,
      "text": "“Let the day perish in which I was born, and the night that said, ‘A man-child is conceived.’"
    },
    {
      "verse": 4,
      "text": "Let that day be darkness! May God above not seek it, or light shine on it."
    },
    {
      "verse": 5,
      "text": "Let gloom and deep darkness claim it. Let clouds settle upon it; let the blackness of the day terrify it."
    },
    {
      "verse": 6,
      "text": "That night—let thick darkness seize it! let it not rejoice among the days of the year; let it not come into the number of the months."
    },
    {
      "verse": 7,
      "text": "Yes, let that night be barren; let no joyful cry be heard in it."
    },
    {
      "verse": 8,
      "text": "Let those curse it who curse the Sea, those who are skilled to rouse up Leviathan."
    },
    {
      "verse": 9,
      "text": "Let the stars of its dawn be dark; let it hope for light, but have none; may it not see the eyelids of the morning—"
    },
    {
      "verse": 10,
      "text": "because it did not shut the doors of my mother's womb, and hide trouble from my eyes."
    },
    {
      "verse": 11,
      "text": "“Why did I not die at birth, come forth from the womb and expire?"
    },
    {
      "verse": 12,
      "text": "Why were there knees to receive me, or breasts for me to suck?"
    },
    {
      "verse": 13,
      "text": "Now I would be lying down and quiet; I would be asleep; then I would be at rest"
    },
    {
      "verse": 14,
      "text": "with kings and counselors of the earth who rebuild ruins for themselves,"
    },
    {
      "verse": 15,
      "text": "or with princes who have gold, who fill their houses with silver."
    },
    {
      "verse": 16,
      "text": "Or why was I not buried like a stillborn child, like an infant that never sees the light?"
    },
    {
      "verse": 17,
      "text": "There the wicked cease from troubling, and there the weary are at rest."
    },
    {
      "verse": 18,
      "text": "There the prisoners are at ease together; they do not hear the voice of the taskmaster."
    },
    {
      "verse": 19,
      "text": "The small and the great are there, and the slaves are free from their masters."
    },
    {
      "verse": 20,
      "text": "“Why is light given to one in misery, and life to the bitter in soul,"
    },
    {
      "verse": 21,
      "text": "who long for death, but it does not come, and dig for it more than for hidden treasures;"
    },
    {
      "verse": 22,
      "text": "who rejoice exceedingly, and are glad when they find the grave?"
    },
    {
      "verse": 23,
      "text": "Why is light given to one who cannot see the way, whom God has fenced in?"
    },
    {
      "verse": 24,
      "text": "For my sighing comes like my bread, and my groanings are poured out like water."
    },
    {
      "verse": 25,
      "text": "Truly the thing that I fear comes upon me, and what I dread befalls me."
    },
    {
      "verse": 26,
      "text": "I am not at ease, nor am I quiet; I have no rest; but trouble comes.”"
    }
  ],
  "timestamp": "2025-09-16T19:46:04.880561"
}