{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 13,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOB.13",
  "verses": [
    {
      "verse": 1,
      "text": "“Look, my eye has seen all this, my ear has heard and understood it."
    },
    {
      "verse": 2,
      "text": "What you know, I also know; I am not inferior to you."
    },
    {
      "verse": 3,
      "text": "But I would speak to the Almighty, and I desire to argue my case with God."
    },
    {
      "verse": 4,
      "text": "As for you, you whitewash with lies; all of you are worthless physicians."
    },
    {
      "verse": 5,
      "text": "If you would only keep silent, that would be your wisdom!"
    },
    {
      "verse": 6,
      "text": "Hear now my reasoning, and listen to the pleadings of my lips."
    },
    {
      "verse": 7,
      "text": "Will you speak falsely for God, and speak deceitfully for him?"
    },
    {
      "verse": 8,
      "text": "Will you show partiality toward him, will you plead the case for God?"
    },
    {
      "verse": 9,
      "text": "Will it be well with you when he searches you out? Or can you deceive him, as one person deceives another?"
    },
    {
      "verse": 10,
      "text": "He will surely rebuke you if in secret you show partiality."
    },
    {
      "verse": 11,
      "text": "Will not his majesty terrify you, and the dread of him fall upon you?"
    },
    {
      "verse": 12,
      "text": "Your maxims are proverbs of ashes, your defenses are defenses of clay."
    },
    {
      "verse": 13,
      "text": "“Let me have silence, and I will speak, and let come on me what may."
    },
    {
      "verse": 14,
      "text": "I will take my flesh in my teeth, and put my life in my hand."
    },
    {
      "verse": 15,
      "text": "See, he will kill me; I have no hope; but I will defend my ways to his face."
    },
    {
      "verse": 16,
      "text": "This will be my salvation, that the godless shall not come before him."
    },
    {
      "verse": 17,
      "text": "Listen carefully to my words, and let my declaration be in your ears."
    },
    {
      "verse": 18,
      "text": "I have indeed prepared my case; I know that I shall be vindicated."
    },
    {
      "verse": 19,
      "text": "Who is there that will contend with me? For then I would be silent and die."
    },
    {
      "verse": 20,
      "text": "Only grant two things to me, then I will not hide myself from your face:"
    },
    {
      "verse": 21,
      "text": "withdraw your hand far from me, and do not let dread of you terrify me."
    },
    {
      "verse": 22,
      "text": "Then call, and I will answer; or let me speak, and you reply to me."
    },
    {
      "verse": 23,
      "text": "How many are my iniquities and my sins? Make me know my transgression and my sin."
    },
    {
      "verse": 24,
      "text": "Why do you hide your face, and count me as your enemy?"
    },
    {
      "verse": 25,
      "text": "Will you frighten a windblown leaf and pursue dry chaff?"
    },
    {
      "verse": 26,
      "text": "For you write bitter things against me, and make me reap the iniquities of my youth."
    },
    {
      "verse": 27,
      "text": "You put my feet in the stocks, and watch all my paths; you set a bound to the soles of my feet."
    },
    {
      "verse": 28,
      "text": "One wastes away like a rotten thing, like a garment that is moth-eaten."
    }
  ],
  "timestamp": "2025-09-16T19:46:08.402708"
}