{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 17,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOB.17",
  "verses": [
    {
      "verse": 1,
      "text": "My spirit is broken, my days are extinct, the grave is ready for me."
    },
    {
      "verse": 2,
      "text": "Surely there are mockers around me, and my eye dwells on their provocation."
    },
    {
      "verse": 3,
      "text": "“Lay down a pledge for me with yourself; who is there that will give surety for me?"
    },
    {
      "verse": 4,
      "text": "Since you have closed their minds to understanding, therefore you will not let them triumph."
    },
    {
      "verse": 5,
      "text": "Those who denounce friends for reward— the eyes of their children will fail."
    },
    {
      "verse": 6,
      "text": "“He has made me a byword of the peoples, and I am one before whom people spit."
    },
    {
      "verse": 7,
      "text": "My eye has grown dim from grief, and all my members are like a shadow."
    },
    {
      "verse": 8,
      "text": "The upright are appalled at this, and the innocent stir themselves up against the godless."
    },
    {
      "verse": 9,
      "text": "Yet the righteous hold to their way, and they that have clean hands grow stronger and stronger."
    },
    {
      "verse": 10,
      "text": "But you, come back now, all of you, and I shall not find a sensible person among you."
    },
    {
      "verse": 11,
      "text": "My days are past, my plans are broken off, the desires of my heart."
    },
    {
      "verse": 12,
      "text": "They make night into day; ‘The light,’ they say, ‘is near to the darkness.’"
    },
    {
      "verse": 13,
      "text": "If I look for Sheol as my house, if I spread my couch in darkness,"
    },
    {
      "verse": 14,
      "text": "if I say to the Pit, ‘You are my father,’ and to the worm, ‘My mother,’ or ‘My sister,’"
    },
    {
      "verse": 15,
      "text": "where then is my hope? Who will see my hope?"
    },
    {
      "verse": 16,
      "text": "Will it go down to the bars of Sheol? Shall we descend together into the dust?”"
    }
  ],
  "timestamp": "2025-09-16T19:46:09.810645"
}