{
  "book": "JOS",
  "book_name": "Joshua",
  "chapter": 16,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOS.16",
  "verses": [
    {
      "verse": 1,
      "text": "The allotment of the Josephites went from the Jordan by Jericho, east of the waters of Jericho, into the wilderness, going up from Jericho into the hill country to Bethel;"
    },
    {
      "verse": 2,
      "text": "then going from Bethel to Luz, it passes along to Ataroth, the territory of the Archites;"
    },
    {
      "verse": 3,
      "text": "then it goes down westward to the territory of the Japhletites, as far as the territory of Lower Beth-horon, then to Gezer, and it ends at the sea."
    },
    {
      "verse": 4,
      "text": "The Josephites—Manasseh and Ephraim—received their inheritance."
    },
    {
      "verse": 5,
      "text": "The territory of the Ephraimites by their families was as follows: the boundary of their inheritance on the east was Ataroth-addar as far as Upper Beth-horon,"
    },
    {
      "verse": 6,
      "text": "and the boundary goes from there to the sea; on the north is Michmethath; then on the east the boundary makes a turn toward Taanath-shiloh, and passes along beyond it on the east to Janoah,"
    },
    {
      "verse": 7,
      "text": "then it goes down from Janoah to Ataroth and to Naarah, and touches Jericho, ending at the Jordan."
    },
    {
      "verse": 8,
      "text": "From Tappuah the boundary goes westward to the Wadi Kanah, and ends at the sea. Such is the inheritance of the tribe of the Ephraimites by their families,"
    },
    {
      "verse": 9,
      "text": "together with the towns that were set apart for the Ephraimites within the inheritance of the Manassites, all those towns with their villages."
    },
    {
      "verse": 10,
      "text": "They did not, however, drive out the Canaanites who lived in Gezer: so the Canaanites have lived within Ephraim to this day but have been made to do forced labor."
    }
  ],
  "timestamp": "2025-09-16T19:44:27.524028"
}