{
  "book": "JOS",
  "book_name": "Joshua",
  "chapter": 9,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOS.9",
  "verses": [
    {
      "verse": 1,
      "text": "Now when all the kings who were beyond the Jordan in the hill country and in the lowland all along the coast of the Great Sea toward Lebanon—the Hittites, the Amorites, the Canaanites, the Perizzites, the Hivites, and the Jebusites—heard of this,"
    },
    {
      "verse": 2,
      "text": "they gathered together with one accord to fight Joshua and Israel."
    },
    {
      "verse": 3,
      "text": "But when the inhabitants of Gibeon heard what Joshua had done to Jericho and to Ai,"
    },
    {
      "verse": 4,
      "text": "they on their part acted with cunning: they went and prepared provisions, and took worn-out sacks for their donkeys, and wineskins, worn-out and torn and mended,"
    },
    {
      "verse": 5,
      "text": "with worn-out, patched sandals on their feet, and worn-out clothes; and all their provisions were dry and moldy."
    },
    {
      "verse": 6,
      "text": "They went to Joshua in the camp at Gilgal, and said to him and to the Israelites, “We have come from a far country; so now make a treaty with us.”"
    },
    {
      "verse": 7,
      "text": "But the Israelites said to the Hivites, “Perhaps you live among us; then how can we make a treaty with you?”"
    },
    {
      "verse": 8,
      "text": "They said to Joshua, “We are your servants.” And Joshua said to them, “Who are you? And where do you come from?”"
    },
    {
      "verse": 9,
      "text": "They said to him, “Your servants have come from a very far country, because of the name of the Lord your God; for we have heard a report of him, of all that he did in Egypt,"
    },
    {
      "verse": 10,
      "text": "and of all that he did to the two kings of the Amorites who were beyond the Jordan, King Sihon of Heshbon, and King Og of Bashan who lived in Ashtaroth."
    },
    {
      "verse": 11,
      "text": "So our elders and all the inhabitants of our country said to us, ‘Take provisions in your hand for the journey; go to meet them, and say to them, “We are your servants; come now, make a treaty with us.” ’"
    },
    {
      "verse": 12,
      "text": "Here is our bread; it was still warm when we took it from our houses as our food for the journey, on the day we set out to come to you, but now, see, it is dry and moldy;"
    },
    {
      "verse": 13,
      "text": "these wineskins were new when we filled them, and see, they are burst; and these garments and sandals of ours are worn out from the very long journey.”"
    },
    {
      "verse": 14,
      "text": "So the leaders partook of their provisions, and did not ask direction from the Lord."
    },
    {
      "verse": 15,
      "text": "And Joshua made peace with them, guaranteeing their lives by a treaty; and the leaders of the congregation swore an oath to them."
    },
    {
      "verse": 16,
      "text": "But when three days had passed after they had made a treaty with them, they heard that they were their neighbors and were living among them."
    },
    {
      "verse": 17,
      "text": "So the Israelites set out and reached their cities on the third day. Now their cities were Gibeon, Chephirah, Beeroth, and Kiriath-jearim."
    },
    {
      "verse": 18,
      "text": "But the Israelites did not attack them, because the leaders of the congregation had sworn to them by the Lord, the God of Israel. Then all the congregation murmured against the leaders."
    },
    {
      "verse": 19,
      "text": "But all the leaders said to all the congregation, “We have sworn to them by the Lord, the God of Israel, and now we must not touch them."
    },
    {
      "verse": 20,
      "text": "This is what we will do to them: We will let them live, so that wrath may not come upon us, because of the oath that we swore to them.”"
    },
    {
      "verse": 21,
      "text": "The leaders said to them, “Let them live.” So they became hewers of wood and drawers of water for all the congregation, as the leaders had decided concerning them."
    },
    {
      "verse": 22,
      "text": "Joshua summoned them, and said to them, “Why did you deceive us, saying, ‘We are very far from you,’ while in fact you are living among us?"
    },
    {
      "verse": 23,
      "text": "Now therefore you are cursed, and some of you shall always be slaves, hewers of wood and drawers of water for the house of my God.”"
    },
    {
      "verse": 24,
      "text": "They answered Joshua, “Because it was told to your servants for a certainty that the Lord your God had commanded his servant Moses to give you all the land, and to destroy all the inhabitants of the land before you; so we were in great fear for our lives because of you, and did this thing."
    },
    {
      "verse": 25,
      "text": "And now we are in your hand: do as it seems good and right in your sight to do to us.”"
    },
    {
      "verse": 26,
      "text": "This is what he did for them: he saved them from the Israelites; and they did not kill them."
    },
    {
      "verse": 27,
      "text": "But on that day Joshua made them hewers of wood and drawers of water for the congregation and for the altar of the Lord, to continue to this day, in the place that he should choose."
    }
  ],
  "timestamp": "2025-09-16T19:44:24.801590"
}