{
  "book": "JOS",
  "book_name": "Joshua",
  "chapter": 10,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/JOS.10",
  "verses": [
    {
      "verse": 1,
      "text": "When King Adoni-zedek of Jerusalem heard how Joshua had taken Ai, and had utterly destroyed it, doing to Ai and its king as he had done to Jericho and its king, and how the inhabitants of Gibeon had made peace with Israel and were among them,"
    },
    {
      "verse": 2,
      "text": "he became greatly frightened, because Gibeon was a large city, like one of the royal cities, and was larger than Ai, and all its men were warriors."
    },
    {
      "verse": 3,
      "text": "So King Adoni-zedek of Jerusalem sent a message to King Hoham of Hebron, to King Piram of Jarmuth, to King Japhia of Lachish, and to King Debir of Eglon, saying,"
    },
    {
      "verse": 4,
      "text": "“Come up and help me, and let us attack Gibeon; for it has made peace with Joshua and with the Israelites.”"
    },
    {
      "verse": 5,
      "text": "Then the five kings of the Amorites—the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon—gathered their forces, and went up with all their armies and camped against Gibeon, and made war against it."
    },
    {
      "verse": 6,
      "text": "And the Gibeonites sent to Joshua at the camp in Gilgal, saying, “Do not abandon your servants; come up to us quickly, and save us, and help us; for all the kings of the Amorites who live in the hill country are gathered against us.”"
    },
    {
      "verse": 7,
      "text": "So Joshua went up from Gilgal, he and all the fighting force with him, all the mighty warriors."
    },
    {
      "verse": 8,
      "text": "The Lord said to Joshua, “Do not fear them, for I have handed them over to you; not one of them shall stand before you.”"
    },
    {
      "verse": 9,
      "text": "So Joshua came upon them suddenly, having marched up all night from Gilgal."
    },
    {
      "verse": 10,
      "text": "And the Lord threw them into a panic before Israel, who inflicted a great slaughter on them at Gibeon, chased them by the way of the ascent of Beth-horon, and struck them down as far as Azekah and Makkedah."
    },
    {
      "verse": 11,
      "text": "As they fled before Israel, while they were going down the slope of Beth-horon, the Lord threw down huge stones from heaven on them as far as Azekah, and they died; there were more who died because of the hailstones than the Israelites killed with the sword."
    },
    {
      "verse": 12,
      "text": "On the day when the Lord gave the Amorites over to the Israelites, Joshua spoke to the Lord; and he said in the sight of Israel, “Sun, stand still at Gibeon, and Moon, in the valley of Aijalon.”"
    },
    {
      "verse": 13,
      "text": "And the sun stood still, and the moon stopped, until the nation took vengeance on their enemies. Is this not written in the Book of Jashar? The sun stopped in midheaven, and did not hurry to set for about a whole day."
    },
    {
      "verse": 14,
      "text": "There has been no day like it before or since, when the Lord heeded a human voice; for the Lord fought for Israel."
    },
    {
      "verse": 15,
      "text": "Then Joshua returned, and all Israel with him, to the camp at Gilgal."
    },
    {
      "verse": 16,
      "text": "Meanwhile, these five kings fled and hid themselves in the cave at Makkedah."
    },
    {
      "verse": 17,
      "text": "And it was told Joshua, “The five kings have been found, hidden in the cave at Makkedah.”"
    },
    {
      "verse": 18,
      "text": "Joshua said, “Roll large stones against the mouth of the cave, and set men by it to guard them;"
    },
    {
      "verse": 19,
      "text": "but do not stay there yourselves; pursue your enemies, and attack them from the rear. Do not let them enter their towns, for the Lord your God has given them into your hand.”"
    },
    {
      "verse": 20,
      "text": "When Joshua and the Israelites had finished inflicting a very great slaughter on them, until they were wiped out, and when the survivors had entered into the fortified towns,"
    },
    {
      "verse": 21,
      "text": "all the people returned safe to Joshua in the camp at Makkedah; no one dared to speak against any of the Israelites."
    },
    {
      "verse": 22,
      "text": "Then Joshua said, “Open the mouth of the cave, and bring those five kings out to me from the cave.”"
    },
    {
      "verse": 23,
      "text": "They did so, and brought the five kings out to him from the cave, the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon."
    },
    {
      "verse": 24,
      "text": "When they brought the kings out to Joshua, Joshua summoned all the Israelites, and said to the chiefs of the warriors who had gone with him, “Come near, put your feet on the necks of these kings.” Then they came near and put their feet on their necks."
    },
    {
      "verse": 25,
      "text": "And Joshua said to them, “Do not be afraid or dismayed; be strong and courageous; for thus the Lord will do to all the enemies against whom you fight.”"
    },
    {
      "verse": 26,
      "text": "Afterward Joshua struck them down and put them to death, and he hung them on five trees. And they hung on the trees until evening."
    },
    {
      "verse": 27,
      "text": "At sunset Joshua commanded, and they took them down from the trees and threw them into the cave where they had hidden themselves; they set large stones against the mouth of the cave, which remain to this very day."
    },
    {
      "verse": 28,
      "text": "Joshua took Makkedah on that day, and struck it and its king with the edge of the sword; he utterly destroyed every person in it; he left no one remaining. And he did to the king of Makkedah as he had done to the king of Jericho."
    },
    {
      "verse": 29,
      "text": "Then Joshua passed on from Makkedah, and all Israel with him, to Libnah, and fought against Libnah."
    },
    {
      "verse": 30,
      "text": "The Lord gave it also and its king into the hand of Israel; and he struck it with the edge of the sword, and every person in it; he left no one remaining in it; and he did to its king as he had done to the king of Jericho."
    },
    {
      "verse": 31,
      "text": "Next Joshua passed on from Libnah, and all Israel with him, to Lachish, and laid siege to it, and assaulted it."
    },
    {
      "verse": 32,
      "text": "The Lord gave Lachish into the hand of Israel, and he took it on the second day, and struck it with the edge of the sword, and every person in it, as he had done to Libnah."
    },
    {
      "verse": 33,
      "text": "Then King Horam of Gezer came up to help Lachish; and Joshua struck him and his people, leaving him no survivors."
    },
    {
      "verse": 34,
      "text": "From Lachish Joshua passed on with all Israel to Eglon; and they laid siege to it, and assaulted it;"
    },
    {
      "verse": 35,
      "text": "and they took it that day, and struck it with the edge of the sword; and every person in it he utterly destroyed that day, as he had done to Lachish."
    },
    {
      "verse": 36,
      "text": "Then Joshua went up with all Israel from Eglon to Hebron; they assaulted it,"
    },
    {
      "verse": 37,
      "text": "and took it, and struck it with the edge of the sword, and its king and its towns, and every person in it; he left no one remaining, just as he had done to Eglon, and utterly destroyed it with every person in it."
    },
    {
      "verse": 38,
      "text": "Then Joshua, with all Israel, turned back to Debir and assaulted it,"
    },
    {
      "verse": 39,
      "text": "and he took it with its king and all its towns; they struck them with the edge of the sword, and utterly destroyed every person in it; he left no one remaining; just as he had done to Hebron, and, as he had done to Libnah and its king, so he did to Debir and its king."
    },
    {
      "verse": 40,
      "text": "So Joshua defeated the whole land, the hill country and the Negeb and the lowland and the slopes, and all their kings; he left no one remaining, but utterly destroyed all that breathed, as the Lord God of Israel commanded."
    },
    {
      "verse": 41,
      "text": "And Joshua defeated them from Kadesh-barnea to Gaza, and all the country of Goshen, as far as Gibeon."
    },
    {
      "verse": 42,
      "text": "Joshua took all these kings and their land at one time, because the Lord God of Israel fought for Israel."
    },
    {
      "verse": 43,
      "text": "Then Joshua returned, and all Israel with him, to the camp at Gilgal."
    }
  ],
  "timestamp": "2025-09-16T19:44:24.834868"
}