{
  "book": "LEV",
  "book_name": "Leviticus",
  "chapter": 10,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/LEV.10",
  "verses": [
    {
      "verse": 1,
      "text": "Now Aaron's sons, Nadab and Abihu, each took his censer, put fire in it, and laid incense on it; and they offered unholy fire before the Lord, such as he had not commanded them."
    },
    {
      "verse": 2,
      "text": "And fire came out from the presence of the Lord and consumed them, and they died before the Lord."
    },
    {
      "verse": 3,
      "text": "Then Moses said to Aaron, “This is what the Lord meant when he said, ‘Through those who are near me I will show myself holy, and before all the people I will be glorified.’ ” And Aaron was silent."
    },
    {
      "verse": 4,
      "text": "Moses summoned Mishael and Elzaphan, sons of Uzziel the uncle of Aaron, and said to them, “Come forward, and carry your kinsmen away from the front of the sanctuary to a place outside the camp.”"
    },
    {
      "verse": 5,
      "text": "They came forward and carried them by their tunics out of the camp, as Moses had ordered."
    },
    {
      "verse": 6,
      "text": "And Moses said to Aaron and to his sons Eleazar and Ithamar, “Do not dishevel your hair, and do not tear your vestments, or you will die and wrath will strike all the congregation; but your kindred, the whole house of Israel, may mourn the burning that the Lord has sent."
    },
    {
      "verse": 7,
      "text": "You shall not go outside the entrance of the tent of meeting, or you will die; for the anointing oil of the Lord is on you.” And they did as Moses had ordered."
    },
    {
      "verse": 8,
      "text": "And the Lord spoke to Aaron:"
    },
    {
      "verse": 9,
      "text": "Drink no wine or strong drink, neither you nor your sons, when you enter the tent of meeting, that you may not die; it is a statute forever throughout your generations."
    },
    {
      "verse": 10,
      "text": "You are to distinguish between the holy and the common, and between the unclean and the clean;"
    },
    {
      "verse": 11,
      "text": "and you are to teach the people of Israel all the statutes that the Lord has spoken to them through Moses."
    },
    {
      "verse": 12,
      "text": "Moses spoke to Aaron and to his remaining sons, Eleazar and Ithamar: Take the grain offering that is left from the Lord 's offerings by fire, and eat it unleavened beside the altar, for it is most holy;"
    },
    {
      "verse": 13,
      "text": "you shall eat it in a holy place, because it is your due and your sons' due, from the offerings by fire to the Lord; for so I am commanded."
    },
    {
      "verse": 14,
      "text": "But the breast that is elevated and the thigh that is raised, you and your sons and daughters as well may eat in any clean place; for they have been assigned to you and your children from the sacrifices of the offerings of well-being of the people of Israel."
    },
    {
      "verse": 15,
      "text": "The thigh that is raised and the breast that is elevated they shall bring, together with the offerings by fire of the fat, to raise for an elevation offering before the Lord; they are to be your due and that of your children forever, as the Lord has commanded."
    },
    {
      "verse": 16,
      "text": "Then Moses made inquiry about the goat of the sin offering, and—it had already been burned! He was angry with Eleazar and Ithamar, Aaron's remaining sons, and said,"
    },
    {
      "verse": 17,
      "text": "“Why did you not eat the sin offering in the sacred area? For it is most holy, and God has given it to you that you may remove the guilt of the congregation, to make atonement on their behalf before the Lord."
    },
    {
      "verse": 18,
      "text": "Its blood was not brought into the inner part of the sanctuary. You should certainly have eaten it in the sanctuary, as I commanded.”"
    },
    {
      "verse": 19,
      "text": "And Aaron spoke to Moses, “See, today they offered their sin offering and their burnt offering before the Lord; and yet such things as these have befallen me! If I had eaten the sin offering today, would it have been agreeable to the Lord?”"
    },
    {
      "verse": 20,
      "text": "And when Moses heard that, he agreed."
    }
  ],
  "timestamp": "2025-09-16T19:43:48.764023"
}