{
  "book": "LEV",
  "book_name": "Leviticus",
  "chapter": 14,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/LEV.14",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord spoke to Moses, saying:"
    },
    {
      "verse": 2,
      "text": "This shall be the ritual for the leprous person at the time of his cleansing: He shall be brought to the priest;"
    },
    {
      "verse": 3,
      "text": "the priest shall go out of the camp, and the priest shall make an examination. If the disease is healed in the leprous person,"
    },
    {
      "verse": 4,
      "text": "the priest shall command that two living clean birds and cedarwood and crimson yarn and hyssop be brought for the one who is to be cleansed."
    },
    {
      "verse": 5,
      "text": "The priest shall command that one of the birds be slaughtered over fresh water in an earthen vessel."
    },
    {
      "verse": 6,
      "text": "He shall take the living bird with the cedarwood and the crimson yarn and the hyssop, and dip them and the living bird in the blood of the bird that was slaughtered over the fresh water."
    },
    {
      "verse": 7,
      "text": "He shall sprinkle it seven times upon the one who is to be cleansed of the leprous disease; then he shall pronounce him clean, and he shall let the living bird go into the open field."
    },
    {
      "verse": 8,
      "text": "The one who is to be cleansed shall wash his clothes, and shave off all his hair, and bathe himself in water, and he shall be clean. After that he shall come into the camp, but shall live outside his tent seven days."
    },
    {
      "verse": 9,
      "text": "On the seventh day he shall shave all his hair: of head, beard, eyebrows; he shall shave all his hair. Then he shall wash his clothes, and bathe his body in water, and he shall be clean."
    },
    {
      "verse": 10,
      "text": "On the eighth day he shall take two male lambs without blemish, and one ewe lamb in its first year without blemish, and a grain offering of three-tenths of an ephah of choice flour mixed with oil, and one log of oil."
    },
    {
      "verse": 11,
      "text": "The priest who cleanses shall set the person to be cleansed, along with these things, before the Lord, at the entrance of the tent of meeting."
    },
    {
      "verse": 12,
      "text": "The priest shall take one of the lambs, and offer it as a guilt offering, along with the log of oil, and raise them as an elevation offering before the Lord."
    },
    {
      "verse": 13,
      "text": "He shall slaughter the lamb in the place where the sin offering and the burnt offering are slaughtered in the holy place; for the guilt offering, like the sin offering, belongs to the priest: it is most holy."
    },
    {
      "verse": 14,
      "text": "The priest shall take some of the blood of the guilt offering and put it on the lobe of the right ear of the one to be cleansed, and on the thumb of the right hand, and on the big toe of the right foot."
    },
    {
      "verse": 15,
      "text": "The priest shall take some of the log of oil and pour it into the palm of his own left hand,"
    },
    {
      "verse": 16,
      "text": "and dip his right finger in the oil that is in his left hand and sprinkle some oil with his finger seven times before the Lord."
    },
    {
      "verse": 17,
      "text": "Some of the oil that remains in his hand the priest shall put on the lobe of the right ear of the one to be cleansed, and on the thumb of the right hand, and on the big toe of the right foot, on top of the blood of the guilt offering."
    },
    {
      "verse": 18,
      "text": "The rest of the oil that is in the priest's hand he shall put on the head of the one to be cleansed. Then the priest shall make atonement on his behalf before the Lord:"
    },
    {
      "verse": 19,
      "text": "the priest shall offer the sin offering, to make atonement for the one to be cleansed from his uncleanness. Afterward he shall slaughter the burnt offering;"
    },
    {
      "verse": 20,
      "text": "and the priest shall offer the burnt offering and the grain offering on the altar. Thus the priest shall make atonement on his behalf and he shall be clean."
    },
    {
      "verse": 21,
      "text": "But if he is poor and cannot afford so much, he shall take one male lamb for a guilt offering to be elevated, to make atonement on his behalf, and one-tenth of an ephah of choice flour mixed with oil for a grain offering and a log of oil;"
    },
    {
      "verse": 22,
      "text": "also two turtledoves or two pigeons, such as he can afford, one for a sin offering and the other for a burnt offering."
    },
    {
      "verse": 23,
      "text": "On the eighth day he shall bring them for his cleansing to the priest, to the entrance of the tent of meeting, before the Lord;"
    },
    {
      "verse": 24,
      "text": "and the priest shall take the lamb of the guilt offering and the log of oil, and the priest shall raise them as an elevation offering before the Lord."
    },
    {
      "verse": 25,
      "text": "The priest shall slaughter the lamb of the guilt offering and shall take some of the blood of the guilt offering, and put it on the lobe of the right ear of the one to be cleansed, and on the thumb of the right hand, and on the big toe of the right foot."
    },
    {
      "verse": 26,
      "text": "The priest shall pour some of the oil into the palm of his own left hand,"
    },
    {
      "verse": 27,
      "text": "and shall sprinkle with his right finger some of the oil that is in his left hand seven times before the Lord."
    },
    {
      "verse": 28,
      "text": "The priest shall put some of the oil that is in his hand on the lobe of the right ear of the one to be cleansed, and on the thumb of the right hand, and the big toe of the right foot, where the blood of the guilt offering was placed."
    },
    {
      "verse": 29,
      "text": "The rest of the oil that is in the priest's hand he shall put on the head of the one to be cleansed, to make atonement on his behalf before the Lord."
    },
    {
      "verse": 30,
      "text": "And he shall offer, of the turtledoves or pigeons such as he can afford,"
    },
    {
      "verse": 31,
      "text": "one for a sin offering and the other for a burnt offering, along with a grain offering; and the priest shall make atonement before the Lord on behalf of the one being cleansed."
    },
    {
      "verse": 32,
      "text": "This is the ritual for the one who has a leprous disease, who cannot afford the offerings for his cleansing."
    },
    {
      "verse": 33,
      "text": "The Lord spoke to Moses and Aaron, saying:"
    },
    {
      "verse": 34,
      "text": "When you come into the land of Canaan, which I give you for a possession, and I put a leprous disease in a house in the land of your possession,"
    },
    {
      "verse": 35,
      "text": "the owner of the house shall come and tell the priest, saying, “There seems to me to be some sort of disease in my house.”"
    },
    {
      "verse": 36,
      "text": "The priest shall command that they empty the house before the priest goes to examine the disease, or all that is in the house will become unclean; and afterward the priest shall go in to inspect the house."
    },
    {
      "verse": 37,
      "text": "He shall examine the disease; if the disease is in the walls of the house with greenish or reddish spots, and if it appears to be deeper than the surface,"
    },
    {
      "verse": 38,
      "text": "the priest shall go outside to the door of the house and shut up the house seven days."
    },
    {
      "verse": 39,
      "text": "The priest shall come again on the seventh day and make an inspection; if the disease has spread in the walls of the house,"
    },
    {
      "verse": 40,
      "text": "the priest shall command that the stones in which the disease appears be taken out and thrown into an unclean place outside the city."
    },
    {
      "verse": 41,
      "text": "He shall have the inside of the house scraped thoroughly, and the plaster that is scraped off shall be dumped in an unclean place outside the city."
    },
    {
      "verse": 42,
      "text": "They shall take other stones and put them in the place of those stones, and take other plaster and plaster the house."
    },
    {
      "verse": 43,
      "text": "If the disease breaks out again in the house, after he has taken out the stones and scraped the house and plastered it,"
    },
    {
      "verse": 44,
      "text": "the priest shall go and make inspection; if the disease has spread in the house, it is a spreading leprous disease in the house; it is unclean."
    },
    {
      "verse": 45,
      "text": "He shall have the house torn down, its stones and timber and all the plaster of the house, and taken outside the city to an unclean place."
    },
    {
      "verse": 46,
      "text": "All who enter the house while it is shut up shall be unclean until the evening;"
    },
    {
      "verse": 47,
      "text": "and all who sleep in the house shall wash their clothes; and all who eat in the house shall wash their clothes."
    },
    {
      "verse": 48,
      "text": "If the priest comes and makes an inspection, and the disease has not spread in the house after the house was plastered, the priest shall pronounce the house clean; the disease is healed."
    },
    {
      "verse": 49,
      "text": "For the cleansing of the house he shall take two birds, with cedarwood and crimson yarn and hyssop,"
    },
    {
      "verse": 50,
      "text": "and shall slaughter one of the birds over fresh water in an earthen vessel,"
    },
    {
      "verse": 51,
      "text": "and shall take the cedarwood and the hyssop and the crimson yarn, along with the living bird, and dip them in the blood of the slaughtered bird and the fresh water, and sprinkle the house seven times."
    },
    {
      "verse": 52,
      "text": "Thus he shall cleanse the house with the blood of the bird, and with the fresh water, and with the living bird, and with the cedarwood and hyssop and crimson yarn;"
    },
    {
      "verse": 53,
      "text": "and he shall let the living bird go out of the city into the open field; so he shall make atonement for the house, and it shall be clean."
    },
    {
      "verse": 54,
      "text": "This is the ritual for any leprous disease: for an itch,"
    },
    {
      "verse": 55,
      "text": "for leprous diseases in clothing and houses,"
    },
    {
      "verse": 56,
      "text": "and for a swelling or an eruption or a spot,"
    },
    {
      "verse": 57,
      "text": "to determine when it is unclean and when it is clean. This is the ritual for leprous diseases."
    }
  ],
  "timestamp": "2025-09-16T19:43:50.413576"
}