{
  "book": "LEV",
  "book_name": "Leviticus",
  "chapter": 1,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/LEV.1",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord summoned Moses and spoke to him from the tent of meeting, saying:"
    },
    {
      "verse": 2,
      "text": "Speak to the people of Israel and say to them: When any of you bring an offering of livestock to the Lord, you shall bring your offering from the herd or from the flock."
    },
    {
      "verse": 3,
      "text": "If the offering is a burnt offering from the herd, you shall offer a male without blemish; you shall bring it to the entrance of the tent of meeting, for acceptance in your behalf before the Lord."
    },
    {
      "verse": 4,
      "text": "You shall lay your hand on the head of the burnt offering, and it shall be acceptable in your behalf as atonement for you."
    },
    {
      "verse": 5,
      "text": "The bull shall be slaughtered before the Lord; and Aaron's sons the priests shall offer the blood, dashing the blood against all sides of the altar that is at the entrance of the tent of meeting."
    },
    {
      "verse": 6,
      "text": "The burnt offering shall be flayed and cut up into its parts."
    },
    {
      "verse": 7,
      "text": "The sons of the priest Aaron shall put fire on the altar and arrange wood on the fire."
    },
    {
      "verse": 8,
      "text": "Aaron's sons the priests shall arrange the parts, with the head and the suet, on the wood that is on the fire on the altar;"
    },
    {
      "verse": 9,
      "text": "but its entrails and its legs shall be washed with water. Then the priest shall turn the whole into smoke on the altar as a burnt offering, an offering by fire of pleasing odor to the Lord."
    },
    {
      "verse": 10,
      "text": "If your gift for a burnt offering is from the flock, from the sheep or goats, your offering shall be a male without blemish."
    },
    {
      "verse": 11,
      "text": "It shall be slaughtered on the north side of the altar before the Lord, and Aaron's sons the priests shall dash its blood against all sides of the altar."
    },
    {
      "verse": 12,
      "text": "It shall be cut up into its parts, with its head and its suet, and the priest shall arrange them on the wood that is on the fire on the altar;"
    },
    {
      "verse": 13,
      "text": "but the entrails and the legs shall be washed with water. Then the priest shall offer the whole and turn it into smoke on the altar; it is a burnt offering, an offering by fire of pleasing odor to the Lord."
    },
    {
      "verse": 14,
      "text": "If your offering to the Lord is a burnt offering of birds, you shall choose your offering from turtledoves or pigeons."
    },
    {
      "verse": 15,
      "text": "The priest shall bring it to the altar and wring off its head, and turn it into smoke on the altar; and its blood shall be drained out against the side of the altar."
    },
    {
      "verse": 16,
      "text": "He shall remove its crop with its contents and throw it at the east side of the altar, in the place for ashes."
    },
    {
      "verse": 17,
      "text": "He shall tear it open by its wings without severing it. Then the priest shall turn it into smoke on the altar, on the wood that is on the fire; it is a burnt offering, an offering by fire of pleasing odor to the Lord."
    }
  ],
  "timestamp": "2025-09-16T19:43:46.628389"
}