{
  "book": "LUK",
  "book_name": "Luke",
  "chapter": 13,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/LUK.13",
  "verses": [
    {
      "verse": 1,
      "text": "At that very time there were some present who told him about the Galileans whose blood Pilate had mingled with their sacrifices."
    },
    {
      "verse": 2,
      "text": "He asked them, “Do you think that because these Galileans suffered in this way they were worse sinners than all other Galileans?"
    },
    {
      "verse": 3,
      "text": "No, I tell you; but unless you repent, you will all perish as they did."
    },
    {
      "verse": 4,
      "text": "Or those eighteen who were killed when the tower of Siloam fell on them—do you think that they were worse offenders than all the others living in Jerusalem?"
    },
    {
      "verse": 5,
      "text": "No, I tell you; but unless you repent, you will all perish just as they did.”"
    },
    {
      "verse": 6,
      "text": "Then he told this parable: “A man had a fig tree planted in his vineyard; and he came looking for fruit on it and found none."
    },
    {
      "verse": 7,
      "text": "So he said to the gardener, ‘See here! For three years I have come looking for fruit on this fig tree, and still I find none. Cut it down! Why should it be wasting the soil?’"
    },
    {
      "verse": 8,
      "text": "He replied, ‘Sir, let it alone for one more year, until I dig around it and put manure on it."
    },
    {
      "verse": 9,
      "text": "If it bears fruit next year, well and good; but if not, you can cut it down.’ ”"
    },
    {
      "verse": 10,
      "text": "Now he was teaching in one of the synagogues on the sabbath."
    },
    {
      "verse": 11,
      "text": "And just then there appeared a woman with a spirit that had crippled her for eighteen years. She was bent over and was quite unable to stand up straight."
    },
    {
      "verse": 12,
      "text": "When Jesus saw her, he called her over and said, “Woman, you are set free from your ailment.”"
    },
    {
      "verse": 13,
      "text": "When he laid his hands on her, immediately she stood up straight and began praising God."
    },
    {
      "verse": 14,
      "text": "But the leader of the synagogue, indignant because Jesus had cured on the sabbath, kept saying to the crowd, “There are six days on which work ought to be done; come on those days and be cured, and not on the sabbath day.”"
    },
    {
      "verse": 15,
      "text": "But the Lord answered him and said, “You hypocrites! Does not each of you on the sabbath untie his ox or his donkey from the manger, and lead it away to give it water?"
    },
    {
      "verse": 16,
      "text": "And ought not this woman, a daughter of Abraham whom Satan bound for eighteen long years, be set free from this bondage on the sabbath day?”"
    },
    {
      "verse": 17,
      "text": "When he said this, all his opponents were put to shame; and the entire crowd was rejoicing at all the wonderful things that he was doing."
    },
    {
      "verse": 18,
      "text": "He said therefore, “What is the kingdom of God like? And to what should I compare it?"
    },
    {
      "verse": 19,
      "text": "It is like a mustard seed that someone took and sowed in the garden; it grew and became a tree, and the birds of the air made nests in its branches.”"
    },
    {
      "verse": 20,
      "text": "And again he said, “To what should I compare the kingdom of God?"
    },
    {
      "verse": 21,
      "text": "It is like yeast that a woman took and mixed in with three measures of flour until all of it was leavened.”"
    },
    {
      "verse": 22,
      "text": "Jesus went through one town and village after another, teaching as he made his way to Jerusalem."
    },
    {
      "verse": 23,
      "text": "Someone asked him, “Lord, will only a few be saved?” He said to them,"
    },
    {
      "verse": 24,
      "text": "“Strive to enter through the narrow door; for many, I tell you, will try to enter and will not be able."
    },
    {
      "verse": 25,
      "text": "When once the owner of the house has got up and shut the door, and you begin to stand outside and to knock at the door, saying, ‘Lord, open to us,’ then in reply he will say to you, ‘I do not know where you come from.’"
    },
    {
      "verse": 26,
      "text": "Then you will begin to say, ‘We ate and drank with you, and you taught in our streets.’"
    },
    {
      "verse": 27,
      "text": "But he will say, ‘I do not know where you come from; go away from me, all you evildoers!’"
    },
    {
      "verse": 28,
      "text": "There will be weeping and gnashing of teeth when you see Abraham and Isaac and Jacob and all the prophets in the kingdom of God, and you yourselves thrown out."
    },
    {
      "verse": 29,
      "text": "Then people will come from east and west, from north and south, and will eat in the kingdom of God."
    },
    {
      "verse": 30,
      "text": "Indeed, some are last who will be first, and some are first who will be last.”"
    },
    {
      "verse": 31,
      "text": "At that very hour some Pharisees came and said to him, “Get away from here, for Herod wants to kill you.”"
    },
    {
      "verse": 32,
      "text": "He said to them, “Go and tell that fox for me, ‘Listen, I am casting out demons and performing cures today and tomorrow, and on the third day I finish my work."
    },
    {
      "verse": 33,
      "text": "Yet today, tomorrow, and the next day I must be on my way, because it is impossible for a prophet to be killed outside of Jerusalem.’"
    },
    {
      "verse": 34,
      "text": "Jerusalem, Jerusalem, the city that kills the prophets and stones those who are sent to it! How often have I desired to gather your children together as a hen gathers her brood under her wings, and you were not willing!"
    },
    {
      "verse": 35,
      "text": "See, your house is left to you. And I tell you, you will not see me until the time comes when you say, ‘Blessed is the one who comes in the name of the Lord.’ ”"
    }
  ],
  "timestamp": "2025-09-16T19:49:43.769819"
}