{
  "book": "MAL",
  "book_name": "Malachi",
  "chapter": 2,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/MAL.2",
  "verses": [
    {
      "verse": 1,
      "text": "And now, O priests, this command is for you."
    },
    {
      "verse": 2,
      "text": "If you will not listen, if you will not lay it to heart to give glory to my name, says the Lord of hosts, then I will send the curse on you and I will curse your blessings; indeed I have already cursed them, because you do not lay it to heart."
    },
    {
      "verse": 3,
      "text": "I will rebuke your offspring, and spread dung on your faces, the dung of your offerings, and I will put you out of my presence."
    },
    {
      "verse": 4,
      "text": "Know, then, that I have sent this command to you, that my covenant with Levi may hold, says the Lord of hosts."
    },
    {
      "verse": 5,
      "text": "My covenant with him was a covenant of life and well-being, which I gave him; this called for reverence, and he revered me and stood in awe of my name."
    },
    {
      "verse": 6,
      "text": "True instruction was in his mouth, and no wrong was found on his lips. He walked with me in integrity and uprightness, and he turned many from iniquity."
    },
    {
      "verse": 7,
      "text": "For the lips of a priest should guard knowledge, and people should seek instruction from his mouth, for he is the messenger of the Lord of hosts."
    },
    {
      "verse": 8,
      "text": "But you have turned aside from the way; you have caused many to stumble by your instruction; you have corrupted the covenant of Levi, says the Lord of hosts,"
    },
    {
      "verse": 9,
      "text": "and so I make you despised and abased before all the people, inasmuch as you have not kept my ways but have shown partiality in your instruction."
    },
    {
      "verse": 10,
      "text": "Have we not all one father? Has not one God created us? Why then are we faithless to one another, profaning the covenant of our ancestors?"
    },
    {
      "verse": 11,
      "text": "Judah has been faithless, and abomination has been committed in Israel and in Jerusalem; for Judah has profaned the sanctuary of the Lord, which he loves, and has married the daughter of a foreign god."
    },
    {
      "verse": 12,
      "text": "May the Lord cut off from the tents of Jacob anyone who does this—any to witness or answer, or to bring an offering to the Lord of hosts."
    },
    {
      "verse": 13,
      "text": "And this you do as well: You cover the Lord 's altar with tears, with weeping and groaning because he no longer regards the offering or accepts it with favor at your hand."
    },
    {
      "verse": 14,
      "text": "You ask, “Why does he not?” Because the Lord was a witness between you and the wife of your youth, to whom you have been faithless, though she is your companion and your wife by covenant."
    },
    {
      "verse": 15,
      "text": "Did not one God make her? Both flesh and spirit are his. And what does the one God desire? Godly offspring. So look to yourselves, and do not let anyone be faithless to the wife of his youth."
    },
    {
      "verse": 16,
      "text": "For I hate divorce, says the Lord, the God of Israel, and covering one's garment with violence, says the Lord of hosts. So take heed to yourselves and do not be faithless."
    },
    {
      "verse": 17,
      "text": "You have wearied the Lord with your words. Yet you say, “How have we wearied him?” By saying, “All who do evil are good in the sight of the Lord, and he delights in them.” Or by asking, “Where is the God of justice?”"
    }
  ],
  "timestamp": "2025-09-16T19:49:21.553725"
}