{
  "book": "MAT",
  "book_name": "Matthew",
  "chapter": 24,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/MAT.24",
  "verses": [
    {
      "verse": 1,
      "text": "As Jesus came out of the temple and was going away, his disciples came to point out to him the buildings of the temple."
    },
    {
      "verse": 2,
      "text": "Then he asked them, “You see all these, do you not? Truly I tell you, not one stone will be left here upon another; all will be thrown down.”"
    },
    {
      "verse": 3,
      "text": "When he was sitting on the Mount of Olives, the disciples came to him privately, saying, “Tell us, when will this be, and what will be the sign of your coming and of the end of the age?”"
    },
    {
      "verse": 4,
      "text": "Jesus answered them, “Beware that no one leads you astray."
    },
    {
      "verse": 5,
      "text": "For many will come in my name, saying, ‘I am the Messiah!’ and they will lead many astray."
    },
    {
      "verse": 6,
      "text": "And you will hear of wars and rumors of wars; see that you are not alarmed; for this must take place, but the end is not yet."
    },
    {
      "verse": 7,
      "text": "For nation will rise against nation, and kingdom against kingdom, and there will be famines and earthquakes in various places:"
    },
    {
      "verse": 8,
      "text": "all this is but the beginning of the birth pangs."
    },
    {
      "verse": 9,
      "text": "“Then they will hand you over to be tortured and will put you to death, and you will be hated by all nations because of my name."
    },
    {
      "verse": 10,
      "text": "Then many will fall away, and they will betray one another and hate one another."
    },
    {
      "verse": 11,
      "text": "And many false prophets will arise and lead many astray."
    },
    {
      "verse": 12,
      "text": "And because of the increase of lawlessness, the love of many will grow cold."
    },
    {
      "verse": 13,
      "text": "But the one who endures to the end will be saved."
    },
    {
      "verse": 14,
      "text": "And this good news of the kingdom will be proclaimed throughout the world, as a testimony to all the nations; and then the end will come."
    },
    {
      "verse": 15,
      "text": "“So when you see the desolating sacrilege standing in the holy place, as was spoken of by the prophet Daniel (let the reader understand),"
    },
    {
      "verse": 16,
      "text": "then those in Judea must flee to the mountains;"
    },
    {
      "verse": 17,
      "text": "the one on the housetop must not go down to take what is in the house;"
    },
    {
      "verse": 18,
      "text": "the one in the field must not turn back to get a coat."
    },
    {
      "verse": 19,
      "text": "Woe to those who are pregnant and to those who are nursing infants in those days!"
    },
    {
      "verse": 20,
      "text": "Pray that your flight may not be in winter or on a sabbath."
    },
    {
      "verse": 21,
      "text": "For at that time there will be great suffering, such as has not been from the beginning of the world until now, no, and never will be."
    },
    {
      "verse": 22,
      "text": "And if those days had not been cut short, no one would be saved; but for the sake of the elect those days will be cut short."
    },
    {
      "verse": 23,
      "text": "Then if anyone says to you, ‘Look! Here is the Messiah!’ or ‘There he is!’—do not believe it."
    },
    {
      "verse": 24,
      "text": "For false messiahs and false prophets will appear and produce great signs and omens, to lead astray, if possible, even the elect."
    },
    {
      "verse": 25,
      "text": "Take note, I have told you beforehand."
    },
    {
      "verse": 26,
      "text": "So, if they say to you, ‘Look! He is in the wilderness,’ do not go out. If they say, ‘Look! He is in the inner rooms,’ do not believe it."
    },
    {
      "verse": 27,
      "text": "For as the lightning comes from the east and flashes as far as the west, so will be the coming of the Son of Man."
    },
    {
      "verse": 28,
      "text": "Wherever the corpse is, there the vultures will gather."
    },
    {
      "verse": 29,
      "text": "“Immediately after the suffering of those days the sun will be darkened, and the moon will not give its light; the stars will fall from heaven, and the powers of heaven will be shaken."
    },
    {
      "verse": 30,
      "text": "Then the sign of the Son of Man will appear in heaven, and then all the tribes of the earth will mourn, and they will see ‘the Son of Man coming on the clouds of heaven’ with power and great glory."
    },
    {
      "verse": 31,
      "text": "And he will send out his angels with a loud trumpet call, and they will gather his elect from the four winds, from one end of heaven to the other."
    },
    {
      "verse": 32,
      "text": "“From the fig tree learn its lesson: as soon as its branch becomes tender and puts forth its leaves, you know that summer is near."
    },
    {
      "verse": 33,
      "text": "So also, when you see all these things, you know that he is near, at the very gates."
    },
    {
      "verse": 34,
      "text": "Truly I tell you, this generation will not pass away until all these things have taken place."
    },
    {
      "verse": 35,
      "text": "Heaven and earth will pass away, but my words will not pass away."
    },
    {
      "verse": 36,
      "text": "“But about that day and hour no one knows, neither the angels of heaven, nor the Son, but only the Father."
    },
    {
      "verse": 37,
      "text": "For as the days of Noah were, so will be the coming of the Son of Man."
    },
    {
      "verse": 38,
      "text": "For as in those days before the flood they were eating and drinking, marrying and giving in marriage, until the day Noah entered the ark,"
    },
    {
      "verse": 39,
      "text": "and they knew nothing until the flood came and swept them all away, so too will be the coming of the Son of Man."
    },
    {
      "verse": 40,
      "text": "Then two will be in the field; one will be taken and one will be left."
    },
    {
      "verse": 41,
      "text": "Two women will be grinding meal together; one will be taken and one will be left."
    },
    {
      "verse": 42,
      "text": "Keep awake therefore, for you do not know on what day your Lord is coming."
    },
    {
      "verse": 43,
      "text": "But understand this: if the owner of the house had known in what part of the night the thief was coming, he would have stayed awake and would not have let his house be broken into."
    },
    {
      "verse": 44,
      "text": "Therefore you also must be ready, for the Son of Man is coming at an unexpected hour."
    },
    {
      "verse": 45,
      "text": "“Who then is the faithful and wise slave, whom his master has put in charge of his household, to give the other slaves their allowance of food at the proper time?"
    },
    {
      "verse": 46,
      "text": "Blessed is that slave whom his master will find at work when he arrives."
    },
    {
      "verse": 47,
      "text": "Truly I tell you, he will put that one in charge of all his possessions."
    },
    {
      "verse": 48,
      "text": "But if that wicked slave says to himself, ‘My master is delayed,’"
    },
    {
      "verse": 49,
      "text": "and he begins to beat his fellow slaves, and eats and drinks with drunkards,"
    },
    {
      "verse": 50,
      "text": "the master of that slave will come on a day when he does not expect him and at an hour that he does not know."
    },
    {
      "verse": 51,
      "text": "He will cut him in pieces and put him with the hypocrites, where there will be weeping and gnashing of teeth."
    }
  ],
  "timestamp": "2025-09-16T19:49:31.876334"
}