{
  "book": "MAT",
  "book_name": "Matthew",
  "chapter": 23,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/MAT.23",
  "verses": [
    {
      "verse": 1,
      "text": "Then Jesus said to the crowds and to his disciples,"
    },
    {
      "verse": 2,
      "text": "“The scribes and the Pharisees sit on Moses' seat;"
    },
    {
      "verse": 3,
      "text": "therefore, do whatever they teach you and follow it; but do not do as they do, for they do not practice what they teach."
    },
    {
      "verse": 4,
      "text": "They tie up heavy burdens, hard to bear, and lay them on the shoulders of others; but they themselves are unwilling to lift a finger to move them."
    },
    {
      "verse": 5,
      "text": "They do all their deeds to be seen by others; for they make their phylacteries broad and their fringes long."
    },
    {
      "verse": 6,
      "text": "They love to have the place of honor at banquets and the best seats in the synagogues,"
    },
    {
      "verse": 7,
      "text": "and to be greeted with respect in the marketplaces, and to have people call them rabbi."
    },
    {
      "verse": 8,
      "text": "But you are not to be called rabbi, for you have one teacher, and you are all students."
    },
    {
      "verse": 9,
      "text": "And call no one your father on earth, for you have one Father—the one in heaven."
    },
    {
      "verse": 10,
      "text": "Nor are you to be called instructors, for you have one instructor, the Messiah."
    },
    {
      "verse": 11,
      "text": "The greatest among you will be your servant."
    },
    {
      "verse": 12,
      "text": "All who exalt themselves will be humbled, and all who humble themselves will be exalted."
    },
    {
      "verse": 13,
      "text": "“But woe to you, scribes and Pharisees, hypocrites! For you lock people out of the kingdom of heaven. For you do not go in yourselves, and when others are going in, you stop them."
    },
    {
      "verse": 15,
      "text": "Woe to you, scribes and Pharisees, hypocrites! For you cross sea and land to make a single convert, and you make the new convert twice as much a child of hell as yourselves."
    },
    {
      "verse": 16,
      "text": "“Woe to you, blind guides, who say, ‘Whoever swears by the sanctuary is bound by nothing, but whoever swears by the gold of the sanctuary is bound by the oath.’"
    },
    {
      "verse": 17,
      "text": "You blind fools! For which is greater, the gold or the sanctuary that has made the gold sacred?"
    },
    {
      "verse": 18,
      "text": "And you say, ‘Whoever swears by the altar is bound by nothing, but whoever swears by the gift that is on the altar is bound by the oath.’"
    },
    {
      "verse": 19,
      "text": "How blind you are! For which is greater, the gift or the altar that makes the gift sacred?"
    },
    {
      "verse": 20,
      "text": "So whoever swears by the altar, swears by it and by everything on it;"
    },
    {
      "verse": 21,
      "text": "and whoever swears by the sanctuary, swears by it and by the one who dwells in it;"
    },
    {
      "verse": 22,
      "text": "and whoever swears by heaven, swears by the throne of God and by the one who is seated upon it."
    },
    {
      "verse": 23,
      "text": "“Woe to you, scribes and Pharisees, hypocrites! For you tithe mint, dill, and cummin, and have neglected the weightier matters of the law: justice and mercy and faith. It is these you ought to have practiced without neglecting the others."
    },
    {
      "verse": 24,
      "text": "You blind guides! You strain out a gnat but swallow a camel!"
    },
    {
      "verse": 25,
      "text": "“Woe to you, scribes and Pharisees, hypocrites! For you clean the outside of the cup and of the plate, but inside they are full of greed and self-indulgence."
    },
    {
      "verse": 26,
      "text": "You blind Pharisee! First clean the inside of the cup, so that the outside also may become clean."
    },
    {
      "verse": 27,
      "text": "“Woe to you, scribes and Pharisees, hypocrites! For you are like whitewashed tombs, which on the outside look beautiful, but inside they are full of the bones of the dead and of all kinds of filth."
    },
    {
      "verse": 28,
      "text": "So you also on the outside look righteous to others, but inside you are full of hypocrisy and lawlessness."
    },
    {
      "verse": 29,
      "text": "“Woe to you, scribes and Pharisees, hypocrites! For you build the tombs of the prophets and decorate the graves of the righteous,"
    },
    {
      "verse": 30,
      "text": "and you say, ‘If we had lived in the days of our ancestors, we would not have taken part with them in shedding the blood of the prophets.’"
    },
    {
      "verse": 31,
      "text": "Thus you testify against yourselves that you are descendants of those who murdered the prophets."
    },
    {
      "verse": 32,
      "text": "Fill up, then, the measure of your ancestors."
    },
    {
      "verse": 33,
      "text": "You snakes, you brood of vipers! How can you escape being sentenced to hell?"
    },
    {
      "verse": 34,
      "text": "Therefore I send you prophets, sages, and scribes, some of whom you will kill and crucify, and some you will flog in your synagogues and pursue from town to town,"
    },
    {
      "verse": 35,
      "text": "so that upon you may come all the righteous blood shed on earth, from the blood of righteous Abel to the blood of Zechariah son of Barachiah, whom you murdered between the sanctuary and the altar."
    },
    {
      "verse": 36,
      "text": "Truly I tell you, all this will come upon this generation."
    },
    {
      "verse": 37,
      "text": "“Jerusalem, Jerusalem, the city that kills the prophets and stones those who are sent to it! How often have I desired to gather your children together as a hen gathers her brood under her wings, and you were not willing!"
    },
    {
      "verse": 38,
      "text": "See, your house is left to you, desolate."
    },
    {
      "verse": 39,
      "text": "For I tell you, you will not see me again until you say, ‘Blessed is the one who comes in the name of the Lord.’ ”"
    }
  ],
  "timestamp": "2025-09-16T19:49:31.793189"
}