{
  "book": "MAT",
  "book_name": "Matthew",
  "chapter": 15,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/MAT.15",
  "verses": [
    {
      "verse": 1,
      "text": "Then Pharisees and scribes came to Jesus from Jerusalem and said,"
    },
    {
      "verse": 2,
      "text": "“Why do your disciples break the tradition of the elders? For they do not wash their hands before they eat.”"
    },
    {
      "verse": 3,
      "text": "He answered them, “And why do you break the commandment of God for the sake of your tradition?"
    },
    {
      "verse": 4,
      "text": "For God said, ‘Honor your father and your mother,’ and, ‘Whoever speaks evil of father or mother must surely die.’"
    },
    {
      "verse": 5,
      "text": "But you say that whoever tells father or mother, ‘Whatever support you might have had from me is given to God,’ then that person need not honor the father."
    },
    {
      "verse": 6,
      "text": "So, for the sake of your tradition, you make void the word of God."
    },
    {
      "verse": 7,
      "text": "You hypocrites! Isaiah prophesied rightly about you when he said:"
    },
    {
      "verse": 8,
      "text": "‘This people honors me with their lips, but their hearts are far from me;"
    },
    {
      "verse": 9,
      "text": "in vain do they worship me, teaching human precepts as doctrines.’ ”"
    },
    {
      "verse": 10,
      "text": "Then he called the crowd to him and said to them, “Listen and understand:"
    },
    {
      "verse": 11,
      "text": "it is not what goes into the mouth that defiles a person, but it is what comes out of the mouth that defiles.”"
    },
    {
      "verse": 12,
      "text": "Then the disciples approached and said to him, “Do you know that the Pharisees took offense when they heard what you said?”"
    },
    {
      "verse": 13,
      "text": "He answered, “Every plant that my heavenly Father has not planted will be uprooted."
    },
    {
      "verse": 14,
      "text": "Let them alone; they are blind guides of the blind. And if one blind person guides another, both will fall into a pit.”"
    },
    {
      "verse": 15,
      "text": "But Peter said to him, “Explain this parable to us.”"
    },
    {
      "verse": 16,
      "text": "Then he said, “Are you also still without understanding?"
    },
    {
      "verse": 17,
      "text": "Do you not see that whatever goes into the mouth enters the stomach, and goes out into the sewer?"
    },
    {
      "verse": 18,
      "text": "But what comes out of the mouth proceeds from the heart, and this is what defiles."
    },
    {
      "verse": 19,
      "text": "For out of the heart come evil intentions, murder, adultery, fornication, theft, false witness, slander."
    },
    {
      "verse": 20,
      "text": "These are what defile a person, but to eat with unwashed hands does not defile.”"
    },
    {
      "verse": 21,
      "text": "Jesus left that place and went away to the district of Tyre and Sidon."
    },
    {
      "verse": 22,
      "text": "Just then a Canaanite woman from that region came out and started shouting, “Have mercy on me, Lord, Son of David; my daughter is tormented by a demon.”"
    },
    {
      "verse": 23,
      "text": "But he did not answer her at all. And his disciples came and urged him, saying, “Send her away, for she keeps shouting after us.”"
    },
    {
      "verse": 24,
      "text": "He answered, “I was sent only to the lost sheep of the house of Israel.”"
    },
    {
      "verse": 25,
      "text": "But she came and knelt before him, saying, “Lord, help me.”"
    },
    {
      "verse": 26,
      "text": "He answered, “It is not fair to take the children's food and throw it to the dogs.”"
    },
    {
      "verse": 27,
      "text": "She said, “Yes, Lord, yet even the dogs eat the crumbs that fall from their masters' table.”"
    },
    {
      "verse": 28,
      "text": "Then Jesus answered her, “Woman, great is your faith! Let it be done for you as you wish.” And her daughter was healed instantly."
    },
    {
      "verse": 29,
      "text": "After Jesus had left that place, he passed along the Sea of Galilee, and he went up the mountain, where he sat down."
    },
    {
      "verse": 30,
      "text": "Great crowds came to him, bringing with them the lame, the maimed, the blind, the mute, and many others. They put them at his feet, and he cured them,"
    },
    {
      "verse": 31,
      "text": "so that the crowd was amazed when they saw the mute speaking, the maimed whole, the lame walking, and the blind seeing. And they praised the God of Israel."
    },
    {
      "verse": 32,
      "text": "Then Jesus called his disciples to him and said, “I have compassion for the crowd, because they have been with me now for three days and have nothing to eat; and I do not want to send them away hungry, for they might faint on the way.”"
    },
    {
      "verse": 33,
      "text": "The disciples said to him, “Where are we to get enough bread in the desert to feed so great a crowd?”"
    },
    {
      "verse": 34,
      "text": "Jesus asked them, “How many loaves have you?” They said, “Seven, and a few small fish.”"
    },
    {
      "verse": 35,
      "text": "Then ordering the crowd to sit down on the ground,"
    },
    {
      "verse": 36,
      "text": "he took the seven loaves and the fish; and after giving thanks he broke them and gave them to the disciples, and the disciples gave them to the crowds."
    },
    {
      "verse": 37,
      "text": "And all of them ate and were filled; and they took up the broken pieces left over, seven baskets full."
    },
    {
      "verse": 38,
      "text": "Those who had eaten were four thousand men, besides women and children."
    },
    {
      "verse": 39,
      "text": "After sending away the crowds, he got into the boat and went to the region of Magadan."
    }
  ],
  "timestamp": "2025-09-16T19:49:27.875862"
}