{
  "book": "MRK",
  "book_name": "Mark",
  "chapter": 8,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/MRK.8",
  "verses": [
    {
      "verse": 1,
      "text": "In those days when there was again a great crowd without anything to eat, he called his disciples and said to them,"
    },
    {
      "verse": 2,
      "text": "“I have compassion for the crowd, because they have been with me now for three days and have nothing to eat."
    },
    {
      "verse": 3,
      "text": "If I send them away hungry to their homes, they will faint on the way—and some of them have come from a great distance.”"
    },
    {
      "verse": 4,
      "text": "His disciples replied, “How can one feed these people with bread here in the desert?”"
    },
    {
      "verse": 5,
      "text": "He asked them, “How many loaves do you have?” They said, “Seven.”"
    },
    {
      "verse": 6,
      "text": "Then he ordered the crowd to sit down on the ground; and he took the seven loaves, and after giving thanks he broke them and gave them to his disciples to distribute; and they distributed them to the crowd."
    },
    {
      "verse": 7,
      "text": "They had also a few small fish; and after blessing them, he ordered that these too should be distributed."
    },
    {
      "verse": 8,
      "text": "They ate and were filled; and they took up the broken pieces left over, seven baskets full."
    },
    {
      "verse": 9,
      "text": "Now there were about four thousand people. And he sent them away."
    },
    {
      "verse": 10,
      "text": "And immediately he got into the boat with his disciples and went to the district of Dalmanutha."
    },
    {
      "verse": 11,
      "text": "The Pharisees came and began to argue with him, asking him for a sign from heaven, to test him."
    },
    {
      "verse": 12,
      "text": "And he sighed deeply in his spirit and said, “Why does this generation ask for a sign? Truly I tell you, no sign will be given to this generation.”"
    },
    {
      "verse": 13,
      "text": "And he left them, and getting into the boat again, he went across to the other side."
    },
    {
      "verse": 14,
      "text": "Now the disciples had forgotten to bring any bread; and they had only one loaf with them in the boat."
    },
    {
      "verse": 15,
      "text": "And he cautioned them, saying, “Watch out—beware of the yeast of the Pharisees and the yeast of Herod.”"
    },
    {
      "verse": 16,
      "text": "They said to one another, “It is because we have no bread.”"
    },
    {
      "verse": 17,
      "text": "And becoming aware of it, Jesus said to them, “Why are you talking about having no bread? Do you still not perceive or understand? Are your hearts hardened?"
    },
    {
      "verse": 18,
      "text": "Do you have eyes, and fail to see? Do you have ears, and fail to hear? And do you not remember?"
    },
    {
      "verse": 19,
      "text": "When I broke the five loaves for the five thousand, how many baskets full of broken pieces did you collect?” They said to him, “Twelve.”"
    },
    {
      "verse": 20,
      "text": "“And the seven for the four thousand, how many baskets full of broken pieces did you collect?” And they said to him, “Seven.”"
    },
    {
      "verse": 21,
      "text": "Then he said to them, “Do you not yet understand?”"
    },
    {
      "verse": 22,
      "text": "They came to Bethsaida. Some people brought a blind man to him and begged him to touch him."
    },
    {
      "verse": 23,
      "text": "He took the blind man by the hand and led him out of the village; and when he had put saliva on his eyes and laid his hands on him, he asked him, “Can you see anything?”"
    },
    {
      "verse": 24,
      "text": "And the man looked up and said, “I can see people, but they look like trees, walking.”"
    },
    {
      "verse": 25,
      "text": "Then Jesus laid his hands on his eyes again; and he looked intently and his sight was restored, and he saw everything clearly."
    },
    {
      "verse": 26,
      "text": "Then he sent him away to his home, saying, “Do not even go into the village.”"
    },
    {
      "verse": 27,
      "text": "Jesus went on with his disciples to the villages of Caesarea Philippi; and on the way he asked his disciples, “Who do people say that I am?”"
    },
    {
      "verse": 28,
      "text": "And they answered him, “John the Baptist; and others, Elijah; and still others, one of the prophets.”"
    },
    {
      "verse": 29,
      "text": "He asked them, “But who do you say that I am?” Peter answered him, “You are the Messiah.”"
    },
    {
      "verse": 30,
      "text": "And he sternly ordered them not to tell anyone about him."
    },
    {
      "verse": 31,
      "text": "Then he began to teach them that the Son of Man must undergo great suffering, and be rejected by the elders, the chief priests, and the scribes, and be killed, and after three days rise again."
    },
    {
      "verse": 32,
      "text": "He said all this quite openly. And Peter took him aside and began to rebuke him."
    },
    {
      "verse": 33,
      "text": "But turning and looking at his disciples, he rebuked Peter and said, “Get behind me, Satan! For you are setting your mind not on divine things but on human things.”"
    },
    {
      "verse": 34,
      "text": "He called the crowd with his disciples, and said to them, “If any want to become my followers, let them deny themselves and take up their cross and follow me."
    },
    {
      "verse": 35,
      "text": "For those who want to save their life will lose it, and those who lose their life for my sake, and for the sake of the gospel, will save it."
    },
    {
      "verse": 36,
      "text": "For what will it profit them to gain the whole world and forfeit their life?"
    },
    {
      "verse": 37,
      "text": "Indeed, what can they give in return for their life?"
    },
    {
      "verse": 38,
      "text": "Those who are ashamed of me and of my words in this adulterous and sinful generation, of them the Son of Man will also be ashamed when he comes in the glory of his Father with the holy angels.”"
    }
  ],
  "timestamp": "2025-09-16T19:49:36.310393"
}