{
  "book": "NUM",
  "book_name": "Numbers",
  "chapter": 29,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/NUM.29",
  "verses": [
    {
      "verse": 1,
      "text": "On the first day of the seventh month you shall have a holy convocation; you shall not work at your occupations. It is a day for you to blow the trumpets,"
    },
    {
      "verse": 2,
      "text": "and you shall offer a burnt offering, a pleasing odor to the Lord: one young bull, one ram, seven male lambs a year old without blemish."
    },
    {
      "verse": 3,
      "text": "Their grain offering shall be of choice flour mixed with oil, three-tenths of one ephah for the bull, two-tenths for the ram,"
    },
    {
      "verse": 4,
      "text": "and one-tenth for each of the seven lambs;"
    },
    {
      "verse": 5,
      "text": "with one male goat for a sin offering, to make atonement for you."
    },
    {
      "verse": 6,
      "text": "These are in addition to the burnt offering of the new moon and its grain offering, and the regular burnt offering and its grain offering, and their drink offerings, according to the ordinance for them, a pleasing odor, an offering by fire to the Lord."
    },
    {
      "verse": 7,
      "text": "On the tenth day of this seventh month you shall have a holy convocation, and deny yourselves; you shall do no work."
    },
    {
      "verse": 8,
      "text": "You shall offer a burnt offering to the Lord, a pleasing odor: one young bull, one ram, seven male lambs a year old. They shall be without blemish."
    },
    {
      "verse": 9,
      "text": "Their grain offering shall be of choice flour mixed with oil, three-tenths of an ephah for the bull, two-tenths for the one ram,"
    },
    {
      "verse": 10,
      "text": "one-tenth for each of the seven lambs;"
    },
    {
      "verse": 11,
      "text": "with one male goat for a sin offering, in addition to the sin offering of atonement, and the regular burnt offering and its grain offering, and their drink offerings."
    },
    {
      "verse": 12,
      "text": "On the fifteenth day of the seventh month you shall have a holy convocation; you shall not work at your occupations. You shall celebrate a festival to the Lord seven days."
    },
    {
      "verse": 13,
      "text": "You shall offer a burnt offering, an offering by fire, a pleasing odor to the Lord: thirteen young bulls, two rams, fourteen male lambs a year old. They shall be without blemish."
    },
    {
      "verse": 14,
      "text": "Their grain offering shall be of choice flour mixed with oil, three-tenths of an ephah for each of the thirteen bulls, two-tenths for each of the two rams,"
    },
    {
      "verse": 15,
      "text": "and one-tenth for each of the fourteen lambs;"
    },
    {
      "verse": 16,
      "text": "also one male goat for a sin offering, in addition to the regular burnt offering, its grain offering and its drink offering."
    },
    {
      "verse": 17,
      "text": "On the second day: twelve young bulls, two rams, fourteen male lambs a year old without blemish,"
    },
    {
      "verse": 18,
      "text": "with the grain offering and the drink offerings for the bulls, for the rams, and for the lambs, as prescribed in accordance with their number;"
    },
    {
      "verse": 19,
      "text": "also one male goat for a sin offering, in addition to the regular burnt offering and its grain offering, and their drink offerings."
    },
    {
      "verse": 20,
      "text": "On the third day: eleven bulls, two rams, fourteen male lambs a year old without blemish,"
    },
    {
      "verse": 21,
      "text": "with the grain offering and the drink offerings for the bulls, for the rams, and for the lambs, as prescribed in accordance with their number;"
    },
    {
      "verse": 22,
      "text": "also one male goat for a sin offering, in addition to the regular burnt offering and its grain offering and its drink offering."
    },
    {
      "verse": 23,
      "text": "On the fourth day: ten bulls, two rams, fourteen male lambs a year old without blemish,"
    },
    {
      "verse": 24,
      "text": "with the grain offering and the drink offerings for the bulls, for the rams, and for the lambs, as prescribed in accordance with their number;"
    },
    {
      "verse": 25,
      "text": "also one male goat for a sin offering, in addition to the regular burnt offering, its grain offering and its drink offering."
    },
    {
      "verse": 26,
      "text": "On the fifth day: nine bulls, two rams, fourteen male lambs a year old without blemish,"
    },
    {
      "verse": 27,
      "text": "with the grain offering and the drink offerings for the bulls, for the rams, and for the lambs, as prescribed in accordance with their number;"
    },
    {
      "verse": 28,
      "text": "also one male goat for a sin offering, in addition to the regular burnt offering and its grain offering and its drink offering."
    },
    {
      "verse": 29,
      "text": "On the sixth day: eight bulls, two rams, fourteen male lambs a year old without blemish,"
    },
    {
      "verse": 30,
      "text": "with the grain offering and the drink offerings for the bulls, for the rams, and for the lambs, as prescribed in accordance with their number;"
    },
    {
      "verse": 31,
      "text": "also one male goat for a sin offering, in addition to the regular burnt offering, its grain offering, and its drink offerings."
    },
    {
      "verse": 32,
      "text": "On the seventh day: seven bulls, two rams, fourteen male lambs a year old without blemish,"
    },
    {
      "verse": 33,
      "text": "with the grain offering and the drink offerings for the bulls, for the rams, and for the lambs, as prescribed in accordance with their number;"
    },
    {
      "verse": 34,
      "text": "also one male goat for a sin offering, besides the regular burnt offering, its grain offering, and its drink offering."
    },
    {
      "verse": 35,
      "text": "On the eighth day you shall have a solemn assembly; you shall not work at your occupations."
    },
    {
      "verse": 36,
      "text": "You shall offer a burnt offering, an offering by fire, a pleasing odor to the Lord: one bull, one ram, seven male lambs a year old without blemish,"
    },
    {
      "verse": 37,
      "text": "and the grain offering and the drink offerings for the bull, for the ram, and for the lambs, as prescribed in accordance with their number;"
    },
    {
      "verse": 38,
      "text": "also one male goat for a sin offering, in addition to the regular burnt offering and its grain offering and its drink offering."
    },
    {
      "verse": 39,
      "text": "These you shall offer to the Lord at your appointed festivals, in addition to your votive offerings and your freewill offerings, as your burnt offerings, your grain offerings, your drink offerings, and your offerings of well-being."
    },
    {
      "verse": 40,
      "text": "So Moses told the Israelites everything just as the Lord had commanded Moses."
    }
  ],
  "timestamp": "2025-09-16T19:44:04.581597"
}