{
  "book": "NUM",
  "book_name": "Numbers",
  "chapter": 15,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/NUM.15",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord spoke to Moses, saying:"
    },
    {
      "verse": 2,
      "text": "Speak to the Israelites and say to them: When you come into the land you are to inhabit, which I am giving you,"
    },
    {
      "verse": 3,
      "text": "and you make an offering by fire to the Lord from the herd or from the flock—whether a burnt offering or a sacrifice, to fulfill a vow or as a freewill offering or at your appointed festivals—to make a pleasing odor for the Lord,"
    },
    {
      "verse": 4,
      "text": "then whoever presents such an offering to the Lord shall present also a grain offering, one-tenth of an ephah of choice flour, mixed with one-fourth of a hin of oil."
    },
    {
      "verse": 5,
      "text": "Moreover, you shall offer one-fourth of a hin of wine as a drink offering with the burnt offering or the sacrifice, for each lamb."
    },
    {
      "verse": 6,
      "text": "For a ram, you shall offer a grain offering, two-tenths of an ephah of choice flour mixed with one-third of a hin of oil;"
    },
    {
      "verse": 7,
      "text": "and as a drink offering you shall offer one-third of a hin of wine, a pleasing odor to the Lord."
    },
    {
      "verse": 8,
      "text": "When you offer a bull as a burnt offering or a sacrifice, to fulfill a vow or as an offering of well-being to the Lord,"
    },
    {
      "verse": 9,
      "text": "then you shall present with the bull a grain offering, three-tenths of an ephah of choice flour, mixed with half a hin of oil,"
    },
    {
      "verse": 10,
      "text": "and you shall present as a drink offering half a hin of wine, as an offering by fire, a pleasing odor to the Lord."
    },
    {
      "verse": 11,
      "text": "Thus it shall be done for each ox or ram, or for each of the male lambs or the kids."
    },
    {
      "verse": 12,
      "text": "According to the number that you offer, so you shall do with each and every one."
    },
    {
      "verse": 13,
      "text": "Every native Israelite shall do these things in this way, in presenting an offering by fire, a pleasing odor to the Lord."
    },
    {
      "verse": 14,
      "text": "An alien who lives with you, or who takes up permanent residence among you, and wishes to offer an offering by fire, a pleasing odor to the Lord, shall do as you do."
    },
    {
      "verse": 15,
      "text": "As for the assembly, there shall be for both you and the resident alien a single statute, a perpetual statute throughout your generations; you and the alien shall be alike before the Lord."
    },
    {
      "verse": 16,
      "text": "You and the alien who resides with you shall have the same law and the same ordinance."
    },
    {
      "verse": 17,
      "text": "The Lord spoke to Moses, saying:"
    },
    {
      "verse": 18,
      "text": "Speak to the Israelites and say to them: After you come into the land to which I am bringing you,"
    },
    {
      "verse": 19,
      "text": "whenever you eat of the bread of the land, you shall present a donation to the Lord."
    },
    {
      "verse": 20,
      "text": "From your first batch of dough you shall present a loaf as a donation; you shall present it just as you present a donation from the threshing floor."
    },
    {
      "verse": 21,
      "text": "Throughout your generations you shall give to the Lord a donation from the first of your batch of dough."
    },
    {
      "verse": 22,
      "text": "But if you unintentionally fail to observe all these commandments that the Lord has spoken to Moses—"
    },
    {
      "verse": 23,
      "text": "everything that the Lord has commanded you by Moses, from the day the Lord gave commandment and thereafter, throughout your generations—"
    },
    {
      "verse": 24,
      "text": "then if it was done unintentionally without the knowledge of the congregation, the whole congregation shall offer one young bull for a burnt offering, a pleasing odor to the Lord, together with its grain offering and its drink offering, according to the ordinance, and one male goat for a sin offering."
    },
    {
      "verse": 25,
      "text": "The priest shall make atonement for all the congregation of the Israelites, and they shall be forgiven; it was unintentional, and they have brought their offering, an offering by fire to the Lord, and their sin offering before the Lord, for their error."
    },
    {
      "verse": 26,
      "text": "All the congregation of the Israelites shall be forgiven, as well as the aliens residing among them, because the whole people was involved in the error."
    },
    {
      "verse": 27,
      "text": "An individual who sins unintentionally shall present a female goat a year old for a sin offering."
    },
    {
      "verse": 28,
      "text": "And the priest shall make atonement before the Lord for the one who commits an error, when it is unintentional, to make atonement for the person, who then shall be forgiven."
    },
    {
      "verse": 29,
      "text": "For both the native among the Israelites and the alien residing among them—you shall have the same law for anyone who acts in error."
    },
    {
      "verse": 30,
      "text": "But whoever acts high-handedly, whether a native or an alien, affronts the Lord, and shall be cut off from among the people."
    },
    {
      "verse": 31,
      "text": "Because of having despised the word of the Lord and broken his commandment, such a person shall be utterly cut off and bear the guilt."
    },
    {
      "verse": 32,
      "text": "When the Israelites were in the wilderness, they found a man gathering sticks on the sabbath day."
    },
    {
      "verse": 33,
      "text": "Those who found him gathering sticks brought him to Moses, Aaron, and to the whole congregation."
    },
    {
      "verse": 34,
      "text": "They put him in custody, because it was not clear what should be done to him."
    },
    {
      "verse": 35,
      "text": "Then the Lord said to Moses, “The man shall be put to death; all the congregation shall stone him outside the camp.”"
    },
    {
      "verse": 36,
      "text": "The whole congregation brought him outside the camp and stoned him to death, just as the Lord had commanded Moses."
    },
    {
      "verse": 37,
      "text": "The Lord said to Moses:"
    },
    {
      "verse": 38,
      "text": "Speak to the Israelites, and tell them to make fringes on the corners of their garments throughout their generations and to put a blue cord on the fringe at each corner."
    },
    {
      "verse": 39,
      "text": "You have the fringe so that, when you see it, you will remember all the commandments of the Lord and do them, and not follow the lust of your own heart and your own eyes."
    },
    {
      "verse": 40,
      "text": "So you shall remember and do all my commandments, and you shall be holy to your God."
    },
    {
      "verse": 41,
      "text": "I am the Lord your God, who brought you out of the land of Egypt, to be your God: I am the Lord your God."
    }
  ],
  "timestamp": "2025-09-16T19:44:00.027505"
}