{
  "book": "NUM",
  "book_name": "Numbers",
  "chapter": 23,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/NUM.23",
  "verses": [
    {
      "verse": 1,
      "text": "Then Balaam said to Balak, “Build me seven altars here, and prepare seven bulls and seven rams for me.”"
    },
    {
      "verse": 2,
      "text": "Balak did as Balaam had said; and Balak and Balaam offered a bull and a ram on each altar."
    },
    {
      "verse": 3,
      "text": "Then Balaam said to Balak, “Stay here beside your burnt offerings while I go aside. Perhaps the Lord will come to meet me. Whatever he shows me I will tell you.” And he went to a bare height."
    },
    {
      "verse": 4,
      "text": "Then God met Balaam; and Balaam said to him, “I have arranged the seven altars, and have offered a bull and a ram on each altar.”"
    },
    {
      "verse": 5,
      "text": "The Lord put a word in Balaam's mouth, and said, “Return to Balak, and this is what you must say.”"
    },
    {
      "verse": 6,
      "text": "So he returned to Balak, who was standing beside his burnt offerings with all the officials of Moab."
    },
    {
      "verse": 7,
      "text": "Then Balaam uttered his oracle, saying: “Balak has brought me from Aram, the king of Moab from the eastern mountains: ‘Come, curse Jacob for me; Come, denounce Israel!’"
    },
    {
      "verse": 8,
      "text": "How can I curse whom God has not cursed? How can I denounce those whom the Lord has not denounced?"
    },
    {
      "verse": 9,
      "text": "For from the top of the crags I see him, from the hills I behold him; Here is a people living alone, and not reckoning itself among the nations!"
    },
    {
      "verse": 10,
      "text": "Who can count the dust of Jacob, or number the dust-cloud of Israel? Let me die the death of the upright, and let my end be like his!”"
    },
    {
      "verse": 11,
      "text": "Then Balak said to Balaam, “What have you done to me? I brought you to curse my enemies, but now you have done nothing but bless them.”"
    },
    {
      "verse": 12,
      "text": "He answered, “Must I not take care to say what the Lord puts into my mouth?”"
    },
    {
      "verse": 13,
      "text": "So Balak said to him, “Come with me to another place from which you may see them; you shall see only part of them, and shall not see them all; then curse them for me from there.”"
    },
    {
      "verse": 14,
      "text": "So he took him to the field of Zophim, to the top of Pisgah. He built seven altars, and offered a bull and a ram on each altar."
    },
    {
      "verse": 15,
      "text": "Balaam said to Balak, “Stand here beside your burnt offerings, while I meet the Lord over there.”"
    },
    {
      "verse": 16,
      "text": "The Lord met Balaam, put a word into his mouth, and said, “Return to Balak, and this is what you shall say.”"
    },
    {
      "verse": 17,
      "text": "When he came to him, he was standing beside his burnt offerings with the officials of Moab. Balak said to him, “What has the Lord said?”"
    },
    {
      "verse": 18,
      "text": "Then Balaam uttered his oracle, saying: “Rise, Balak, and hear; listen to me, O son of Zippor:"
    },
    {
      "verse": 19,
      "text": "God is not a human being, that he should lie, or a mortal, that he should change his mind. Has he promised, and will he not do it? Has he spoken, and will he not fulfill it?"
    },
    {
      "verse": 20,
      "text": "See, I received a command to bless; he has blessed, and I cannot revoke it."
    },
    {
      "verse": 21,
      "text": "He has not beheld misfortune in Jacob; nor has he seen trouble in Israel. The Lord their God is with them, acclaimed as a king among them."
    },
    {
      "verse": 22,
      "text": "God, who brings them out of Egypt, is like the horns of a wild ox for them."
    },
    {
      "verse": 23,
      "text": "Surely there is no enchantment against Jacob, no divination against Israel; now it shall be said of Jacob and Israel, ‘See what God has done!’"
    },
    {
      "verse": 24,
      "text": "Look, a people rising up like a lioness, and rousing itself like a lion! It does not lie down until it has eaten the prey and drunk the blood of the slain.”"
    },
    {
      "verse": 25,
      "text": "Then Balak said to Balaam, “Do not curse them at all, and do not bless them at all.”"
    },
    {
      "verse": 26,
      "text": "But Balaam answered Balak, “Did I not tell you, ‘Whatever the Lord says, that is what I must do’?”"
    },
    {
      "verse": 27,
      "text": "So Balak said to Balaam, “Come now, I will take you to another place; perhaps it will please God that you may curse them for me from there.”"
    },
    {
      "verse": 28,
      "text": "So Balak took Balaam to the top of Peor, which overlooks the wasteland."
    },
    {
      "verse": 29,
      "text": "Balaam said to Balak, “Build me seven altars here, and prepare seven bulls and seven rams for me.”"
    },
    {
      "verse": 30,
      "text": "So Balak did as Balaam had said, and offered a bull and a ram on each altar."
    }
  ],
  "timestamp": "2025-09-16T19:44:01.885532"
}