{
  "book": "NUM",
  "book_name": "Numbers",
  "chapter": 2,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/NUM.2",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord spoke to Moses and Aaron, saying:"
    },
    {
      "verse": 2,
      "text": "The Israelites shall camp each in their respective regiments, under ensigns by their ancestral houses; they shall camp facing the tent of meeting on every side."
    },
    {
      "verse": 3,
      "text": "Those to camp on the east side toward the sunrise shall be of the regimental encampment of Judah by companies. The leader of the people of Judah shall be Nahshon son of Amminadab,"
    },
    {
      "verse": 4,
      "text": "with a company as enrolled of seventy-four thousand six hundred."
    },
    {
      "verse": 5,
      "text": "Those to camp next to him shall be the tribe of Issachar. The leader of the Issacharites shall be Nethanel son of Zuar,"
    },
    {
      "verse": 6,
      "text": "with a company as enrolled of fifty-four thousand four hundred."
    },
    {
      "verse": 7,
      "text": "Then the tribe of Zebulun: The leader of the Zebulunites shall be Eliab son of Helon,"
    },
    {
      "verse": 8,
      "text": "with a company as enrolled of fifty-seven thousand four hundred."
    },
    {
      "verse": 9,
      "text": "The total enrollment of the camp of Judah, by companies, is one hundred eighty-six thousand four hundred. They shall set out first on the march."
    },
    {
      "verse": 10,
      "text": "On the south side shall be the regimental encampment of Reuben by companies. The leader of the Reubenites shall be Elizur son of Shedeur,"
    },
    {
      "verse": 11,
      "text": "with a company as enrolled of forty-six thousand five hundred."
    },
    {
      "verse": 12,
      "text": "And those to camp next to him shall be the tribe of Simeon. The leader of the Simeonites shall be Shelumiel son of Zurishaddai,"
    },
    {
      "verse": 13,
      "text": "with a company as enrolled of fifty-nine thousand three hundred."
    },
    {
      "verse": 14,
      "text": "Then the tribe of Gad: The leader of the Gadites shall be Eliasaph son of Reuel,"
    },
    {
      "verse": 15,
      "text": "with a company as enrolled of forty-five thousand six hundred fifty."
    },
    {
      "verse": 16,
      "text": "The total enrollment of the camp of Reuben, by companies, is one hundred fifty-one thousand four hundred fifty. They shall set out second."
    },
    {
      "verse": 17,
      "text": "The tent of meeting, with the camp of the Levites, shall set out in the center of the camps; they shall set out just as they camp, each in position, by their regiments."
    },
    {
      "verse": 18,
      "text": "On the west side shall be the regimental encampment of Ephraim by companies. The leader of the people of Ephraim shall be Elishama son of Ammihud,"
    },
    {
      "verse": 19,
      "text": "with a company as enrolled of forty thousand five hundred."
    },
    {
      "verse": 20,
      "text": "Next to him shall be the tribe of Manasseh. The leader of the people of Manasseh shall be Gamaliel son of Pedahzur,"
    },
    {
      "verse": 21,
      "text": "with a company as enrolled of thirty-two thousand two hundred."
    },
    {
      "verse": 22,
      "text": "Then the tribe of Benjamin: The leader of the Benjaminites shall be Abidan son of Gideoni,"
    },
    {
      "verse": 23,
      "text": "with a company as enrolled of thirty-five thousand four hundred."
    },
    {
      "verse": 24,
      "text": "The total enrollment of the camp of Ephraim, by companies, is one hundred eight thousand one hundred. They shall set out third on the march."
    },
    {
      "verse": 25,
      "text": "On the north side shall be the regimental encampment of Dan by companies. The leader of the Danites shall be Ahiezer son of Ammishaddai,"
    },
    {
      "verse": 26,
      "text": "with a company as enrolled of sixty-two thousand seven hundred."
    },
    {
      "verse": 27,
      "text": "Those to camp next to him shall be the tribe of Asher. The leader of the Asherites shall be Pagiel son of Ochran,"
    },
    {
      "verse": 28,
      "text": "with a company as enrolled of forty-one thousand five hundred."
    },
    {
      "verse": 29,
      "text": "Then the tribe of Naphtali: The leader of the Naphtalites shall be Ahira son of Enan,"
    },
    {
      "verse": 30,
      "text": "with a company as enrolled of fifty-three thousand four hundred."
    },
    {
      "verse": 31,
      "text": "The total enrollment of the camp of Dan is one hundred fifty-seven thousand six hundred. They shall set out last, by companies."
    },
    {
      "verse": 32,
      "text": "This was the enrollment of the Israelites by their ancestral houses; the total enrollment in the camps by their companies was six hundred three thousand five hundred fifty."
    },
    {
      "verse": 33,
      "text": "Just as the Lord had commanded Moses, the Levites were not enrolled among the other Israelites."
    },
    {
      "verse": 34,
      "text": "The Israelites did just as the Lord had commanded Moses: They camped by regiments, and they set out the same way, everyone by clans, according to ancestral houses."
    }
  ],
  "timestamp": "2025-09-16T19:43:55.529351"
}