{
  "book": "NUM",
  "book_name": "Numbers",
  "chapter": 16,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/NUM.16",
  "verses": [
    {
      "verse": 1,
      "text": "Now Korah son of Izhar son of Kohath son of Levi, along with Dathan and Abiram sons of Eliab, and On son of Peleth—descendants of Reuben—took"
    },
    {
      "verse": 2,
      "text": "two hundred fifty Israelite men, leaders of the congregation, chosen from the assembly, well-known men, and they confronted Moses."
    },
    {
      "verse": 3,
      "text": "They assembled against Moses and against Aaron, and said to them, “You have gone too far! All the congregation are holy, everyone of them, and the Lord is among them. So why then do you exalt yourselves above the assembly of the Lord?”"
    },
    {
      "verse": 4,
      "text": "When Moses heard it, he fell on his face."
    },
    {
      "verse": 5,
      "text": "Then he said to Korah and all his company, “In the morning the Lord will make known who is his, and who is holy, and who will be allowed to approach him; the one whom he will choose he will allow to approach him."
    },
    {
      "verse": 6,
      "text": "Do this: take censers, Korah and all your company,"
    },
    {
      "verse": 7,
      "text": "and tomorrow put fire in them, and lay incense on them before the Lord; and the man whom the Lord chooses shall be the holy one. You Levites have gone too far!”"
    },
    {
      "verse": 8,
      "text": "Then Moses said to Korah, “Hear now, you Levites!"
    },
    {
      "verse": 9,
      "text": "Is it too little for you that the God of Israel has separated you from the congregation of Israel, to allow you to approach him in order to perform the duties of the Lord 's tabernacle, and to stand before the congregation and serve them?"
    },
    {
      "verse": 10,
      "text": "He has allowed you to approach him, and all your brother Levites with you; yet you seek the priesthood as well!"
    },
    {
      "verse": 11,
      "text": "Therefore you and all your company have gathered together against the Lord. What is Aaron that you rail against him?”"
    },
    {
      "verse": 12,
      "text": "Moses sent for Dathan and Abiram sons of Eliab; but they said, “We will not come!"
    },
    {
      "verse": 13,
      "text": "Is it too little that you have brought us up out of a land flowing with milk and honey to kill us in the wilderness, that you must also lord it over us?"
    },
    {
      "verse": 14,
      "text": "It is clear you have not brought us into a land flowing with milk and honey, or given us an inheritance of fields and vineyards. Would you put out the eyes of these men? We will not come!”"
    },
    {
      "verse": 15,
      "text": "Moses was very angry and said to the Lord, “Pay no attention to their offering. I have not taken one donkey from them, and I have not harmed any one of them.”"
    },
    {
      "verse": 16,
      "text": "And Moses said to Korah, “As for you and all your company, be present tomorrow before the Lord, you and they and Aaron;"
    },
    {
      "verse": 17,
      "text": "and let each one of you take his censer, and put incense on it, and each one of you present his censer before the Lord, two hundred fifty censers; you also, and Aaron, each his censer.”"
    },
    {
      "verse": 18,
      "text": "So each man took his censer, and they put fire in the censers and laid incense on them, and they stood at the entrance of the tent of meeting with Moses and Aaron."
    },
    {
      "verse": 19,
      "text": "Then Korah assembled the whole congregation against them at the entrance of the tent of meeting. And the glory of the Lord appeared to the whole congregation."
    },
    {
      "verse": 20,
      "text": "Then the Lord spoke to Moses and to Aaron, saying:"
    },
    {
      "verse": 21,
      "text": "Separate yourselves from this congregation, so that I may consume them in a moment."
    },
    {
      "verse": 22,
      "text": "They fell on their faces, and said, “O God, the God of the spirits of all flesh, shall one person sin and you become angry with the whole congregation?”"
    },
    {
      "verse": 23,
      "text": "And the Lord spoke to Moses, saying:"
    },
    {
      "verse": 24,
      "text": "Say to the congregation: Get away from the dwellings of Korah, Dathan, and Abiram."
    },
    {
      "verse": 25,
      "text": "So Moses got up and went to Dathan and Abiram; the elders of Israel followed him."
    },
    {
      "verse": 26,
      "text": "He said to the congregation, “Turn away from the tents of these wicked men, and touch nothing of theirs, or you will be swept away for all their sins.”"
    },
    {
      "verse": 27,
      "text": "So they got away from the dwellings of Korah, Dathan, and Abiram; and Dathan and Abiram came out and stood at the entrance of their tents, together with their wives, their children, and their little ones."
    },
    {
      "verse": 28,
      "text": "And Moses said, “This is how you shall know that the Lord has sent me to do all these works; it has not been of my own accord:"
    },
    {
      "verse": 29,
      "text": "If these people die a natural death, or if a natural fate comes on them, then the Lord has not sent me."
    },
    {
      "verse": 30,
      "text": "But if the Lord creates something new, and the ground opens its mouth and swallows them up, with all that belongs to them, and they go down alive into Sheol, then you shall know that these men have despised the Lord.”"
    },
    {
      "verse": 31,
      "text": "As soon as he finished speaking all these words, the ground under them was split apart."
    },
    {
      "verse": 32,
      "text": "The earth opened its mouth and swallowed them up, along with their households—everyone who belonged to Korah and all their goods."
    },
    {
      "verse": 33,
      "text": "So they with all that belonged to them went down alive into Sheol; the earth closed over them, and they perished from the midst of the assembly."
    },
    {
      "verse": 34,
      "text": "All Israel around them fled at their outcry, for they said, “The earth will swallow us too!”"
    },
    {
      "verse": 35,
      "text": "And fire came out from the Lord and consumed the two hundred fifty men offering the incense."
    },
    {
      "verse": 36,
      "text": "Then the Lord spoke to Moses, saying:"
    },
    {
      "verse": 37,
      "text": "Tell Eleazar son of Aaron the priest to take the censers out of the blaze; then scatter the fire far and wide."
    },
    {
      "verse": 38,
      "text": "For the censers of these sinners have become holy at the cost of their lives. Make them into hammered plates as a covering for the altar, for they presented them before the Lord and they became holy. Thus they shall be a sign to the Israelites."
    },
    {
      "verse": 39,
      "text": "So Eleazar the priest took the bronze censers that had been presented by those who were burned; and they were hammered out as a covering for the altar—"
    },
    {
      "verse": 40,
      "text": "a reminder to the Israelites that no outsider, who is not of the descendants of Aaron, shall approach to offer incense before the Lord, so as not to become like Korah and his company—just as the Lord had said to him through Moses."
    },
    {
      "verse": 41,
      "text": "On the next day, however, the whole congregation of the Israelites rebelled against Moses and against Aaron, saying, “You have killed the people of the Lord.”"
    },
    {
      "verse": 42,
      "text": "And when the congregation had assembled against them, Moses and Aaron turned toward the tent of meeting; the cloud had covered it and the glory of the Lord appeared."
    },
    {
      "verse": 43,
      "text": "Then Moses and Aaron came to the front of the tent of meeting,"
    },
    {
      "verse": 44,
      "text": "and the Lord spoke to Moses, saying,"
    },
    {
      "verse": 45,
      "text": "“Get away from this congregation, so that I may consume them in a moment.” And they fell on their faces."
    },
    {
      "verse": 46,
      "text": "Moses said to Aaron, “Take your censer, put fire on it from the altar and lay incense on it, and carry it quickly to the congregation and make atonement for them. For wrath has gone out from the Lord; the plague has begun.”"
    },
    {
      "verse": 47,
      "text": "So Aaron took it as Moses had ordered, and ran into the middle of the assembly, where the plague had already begun among the people. He put on the incense, and made atonement for the people."
    },
    {
      "verse": 48,
      "text": "He stood between the dead and the living; and the plague was stopped."
    },
    {
      "verse": 49,
      "text": "Those who died by the plague were fourteen thousand seven hundred, besides those who died in the affair of Korah."
    },
    {
      "verse": 50,
      "text": "When the plague was stopped, Aaron returned to Moses at the entrance of the tent of meeting."
    }
  ],
  "timestamp": "2025-09-16T19:44:00.348013"
}