{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 27,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PRO.27",
  "verses": [
    {
      "verse": 1,
      "text": "Do not boast about tomorrow, for you do not know what a day may bring."
    },
    {
      "verse": 2,
      "text": "Let another praise you, and not your own mouth— a stranger, and not your own lips."
    },
    {
      "verse": 3,
      "text": "A stone is heavy, and sand is weighty, but a fool's provocation is heavier than both."
    },
    {
      "verse": 4,
      "text": "Wrath is cruel, anger is overwhelming, but who is able to stand before jealousy?"
    },
    {
      "verse": 5,
      "text": "Better is open rebuke than hidden love."
    },
    {
      "verse": 6,
      "text": "Well meant are the wounds a friend inflicts, but profuse are the kisses of an enemy."
    },
    {
      "verse": 7,
      "text": "The sated appetite spurns honey, but to a ravenous appetite even the bitter is sweet."
    },
    {
      "verse": 8,
      "text": "Like a bird that strays from its nest is one who strays from home."
    },
    {
      "verse": 9,
      "text": "Perfume and incense make the heart glad, but the soul is torn by trouble."
    },
    {
      "verse": 10,
      "text": "Do not forsake your friend or the friend of your parent; do not go to the house of your kindred in the day of your calamity. Better is a neighbor who is nearby than kindred who are far away."
    },
    {
      "verse": 11,
      "text": "Be wise, my child, and make my heart glad, so that I may answer whoever reproaches me."
    },
    {
      "verse": 12,
      "text": "The clever see danger and hide; but the simple go on, and suffer for it."
    },
    {
      "verse": 13,
      "text": "Take the garment of one who has given surety for a stranger; seize the pledge given as surety for foreigners."
    },
    {
      "verse": 14,
      "text": "Whoever blesses a neighbor with a loud voice, rising early in the morning, will be counted as cursing."
    },
    {
      "verse": 15,
      "text": "A continual dripping on a rainy day and a contentious wife are alike;"
    },
    {
      "verse": 16,
      "text": "to restrain her is to restrain the wind or to grasp oil in the right hand."
    },
    {
      "verse": 17,
      "text": "Iron sharpens iron, and one person sharpens the wits of another."
    },
    {
      "verse": 18,
      "text": "Anyone who tends a fig tree will eat its fruit, and anyone who takes care of a master will be honored."
    },
    {
      "verse": 19,
      "text": "Just as water reflects the face, so one human heart reflects another."
    },
    {
      "verse": 20,
      "text": "Sheol and Abaddon are never satisfied, and human eyes are never satisfied."
    },
    {
      "verse": 21,
      "text": "The crucible is for silver, and the furnace is for gold, so a person is tested by being praised."
    },
    {
      "verse": 22,
      "text": "Crush a fool in a mortar with a pestle along with crushed grain, but the folly will not be driven out."
    },
    {
      "verse": 23,
      "text": "Know well the condition of your flocks, and give attention to your herds;"
    },
    {
      "verse": 24,
      "text": "for riches do not last forever, nor a crown for all generations."
    },
    {
      "verse": 25,
      "text": "When the grass is gone, and new growth appears, and the herbage of the mountains is gathered,"
    },
    {
      "verse": 26,
      "text": "the lambs will provide your clothing, and the goats the price of a field;"
    },
    {
      "verse": 27,
      "text": "there will be enough goats' milk for your food, for the food of your household and nourishment for your servant-girls."
    }
  ],
  "timestamp": "2025-09-16T19:47:21.971425"
}