{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 12,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PRO.12",
  "verses": [
    {
      "verse": 1,
      "text": "Whoever loves discipline loves knowledge, but those who hate to be rebuked are stupid."
    },
    {
      "verse": 2,
      "text": "The good obtain favor from the Lord, but those who devise evil he condemns."
    },
    {
      "verse": 3,
      "text": "No one finds security by wickedness, but the root of the righteous will never be moved."
    },
    {
      "verse": 4,
      "text": "A good wife is the crown of her husband, but she who brings shame is like rottenness in his bones."
    },
    {
      "verse": 5,
      "text": "The thoughts of the righteous are just; the advice of the wicked is treacherous."
    },
    {
      "verse": 6,
      "text": "The words of the wicked are a deadly ambush, but the speech of the upright delivers them."
    },
    {
      "verse": 7,
      "text": "The wicked are overthrown and are no more, but the house of the righteous will stand."
    },
    {
      "verse": 8,
      "text": "One is commended for good sense, but a perverse mind is despised."
    },
    {
      "verse": 9,
      "text": "Better to be despised and have a servant, than to be self-important and lack food."
    },
    {
      "verse": 10,
      "text": "The righteous know the needs of their animals, but the mercy of the wicked is cruel."
    },
    {
      "verse": 11,
      "text": "Those who till their land will have plenty of food, but those who follow worthless pursuits have no sense."
    },
    {
      "verse": 12,
      "text": "The wicked covet the proceeds of wickedness, but the root of the righteous bears fruit."
    },
    {
      "verse": 13,
      "text": "The evil are ensnared by the transgression of their lips, but the righteous escape from trouble."
    },
    {
      "verse": 14,
      "text": "From the fruit of the mouth one is filled with good things, and manual labor has its reward."
    },
    {
      "verse": 15,
      "text": "Fools think their own way is right, but the wise listen to advice."
    },
    {
      "verse": 16,
      "text": "Fools show their anger at once, but the prudent ignore an insult."
    },
    {
      "verse": 17,
      "text": "Whoever speaks the truth gives honest evidence, but a false witness speaks deceitfully."
    },
    {
      "verse": 18,
      "text": "Rash words are like sword thrusts, but the tongue of the wise brings healing."
    },
    {
      "verse": 19,
      "text": "Truthful lips endure forever, but a lying tongue lasts only a moment."
    },
    {
      "verse": 20,
      "text": "Deceit is in the mind of those who plan evil, but those who counsel peace have joy."
    },
    {
      "verse": 21,
      "text": "No harm happens to the righteous, but the wicked are filled with trouble."
    },
    {
      "verse": 22,
      "text": "Lying lips are an abomination to the Lord, but those who act faithfully are his delight."
    },
    {
      "verse": 23,
      "text": "One who is clever conceals knowledge, but the mind of a fool broadcasts folly."
    },
    {
      "verse": 24,
      "text": "The hand of the diligent will rule, while the lazy will be put to forced labor."
    },
    {
      "verse": 25,
      "text": "Anxiety weighs down the human heart, but a good word cheers it up."
    },
    {
      "verse": 26,
      "text": "The righteous gives good advice to friends, but the way of the wicked leads astray."
    },
    {
      "verse": 27,
      "text": "The lazy do not roast their game, but the diligent obtain precious wealth."
    },
    {
      "verse": 28,
      "text": "In the path of righteousness there is life, in walking its path there is no death."
    }
  ],
  "timestamp": "2025-09-16T19:47:17.030651"
}