{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 5,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PRO.5",
  "verses": [
    {
      "verse": 1,
      "text": "My child, be attentive to my wisdom; incline your ear to my understanding,"
    },
    {
      "verse": 2,
      "text": "so that you may hold on to prudence, and your lips may guard knowledge."
    },
    {
      "verse": 3,
      "text": "For the lips of a loose woman drip honey, and her speech is smoother than oil;"
    },
    {
      "verse": 4,
      "text": "but in the end she is bitter as wormwood, sharp as a two-edged sword."
    },
    {
      "verse": 5,
      "text": "Her feet go down to death; her steps follow the path to Sheol."
    },
    {
      "verse": 6,
      "text": "She does not keep straight to the path of life; her ways wander, and she does not know it."
    },
    {
      "verse": 7,
      "text": "And now, my child, listen to me, and do not depart from the words of my mouth."
    },
    {
      "verse": 8,
      "text": "Keep your way far from her, and do not go near the door of her house;"
    },
    {
      "verse": 9,
      "text": "or you will give your honor to others, and your years to the merciless,"
    },
    {
      "verse": 10,
      "text": "and strangers will take their fill of your wealth, and your labors will go to the house of an alien;"
    },
    {
      "verse": 11,
      "text": "and at the end of your life you will groan, when your flesh and body are consumed,"
    },
    {
      "verse": 12,
      "text": "and you say, “Oh, how I hated discipline, and my heart despised reproof!"
    },
    {
      "verse": 13,
      "text": "I did not listen to the voice of my teachers or incline my ear to my instructors."
    },
    {
      "verse": 14,
      "text": "Now I am at the point of utter ruin in the public assembly.”"
    },
    {
      "verse": 15,
      "text": "Drink water from your own cistern, flowing water from your own well."
    },
    {
      "verse": 16,
      "text": "Should your springs be scattered abroad, streams of water in the streets?"
    },
    {
      "verse": 17,
      "text": "Let them be for yourself alone, and not for sharing with strangers."
    },
    {
      "verse": 18,
      "text": "Let your fountain be blessed, and rejoice in the wife of your youth,"
    },
    {
      "verse": 19,
      "text": "a lovely deer, a graceful doe. May her breasts satisfy you at all times; may you be intoxicated always by her love."
    },
    {
      "verse": 20,
      "text": "Why should you be intoxicated, my son, by another woman and embrace the bosom of an adulteress?"
    },
    {
      "verse": 21,
      "text": "For human ways are under the eyes of the Lord, and he examines all their paths."
    },
    {
      "verse": 22,
      "text": "The iniquities of the wicked ensnare them, and they are caught in the toils of their sin."
    },
    {
      "verse": 23,
      "text": "They die for lack of discipline, and because of their great folly they are lost."
    }
  ],
  "timestamp": "2025-09-16T19:47:14.432795"
}