{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 17,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PRO.17",
  "verses": [
    {
      "verse": 1,
      "text": "Better is a dry morsel with quiet than a house full of feasting with strife."
    },
    {
      "verse": 2,
      "text": "A slave who deals wisely will rule over a child who acts shamefully,"
    },
    {
      "verse": 3,
      "text": "The crucible is for silver, and the furnace is for gold, but the Lord tests the heart."
    },
    {
      "verse": 4,
      "text": "An evildoer listens to wicked lips; and a liar gives heed to a mischievous tongue."
    },
    {
      "verse": 5,
      "text": "Those who mock the poor insult their Maker; those who are glad at calamity will not go unpunished."
    },
    {
      "verse": 6,
      "text": "Grandchildren are the crown of the aged, and the glory of children is their parents."
    },
    {
      "verse": 7,
      "text": "Fine speech is not becoming to a fool; still less is false speech to a ruler."
    },
    {
      "verse": 8,
      "text": "A bribe is like a magic stone in the eyes of those who give it; wherever they turn they prosper."
    },
    {
      "verse": 9,
      "text": "One who forgives an affront fosters friendship, but one who dwells on disputes will alienate a friend."
    },
    {
      "verse": 10,
      "text": "A rebuke strikes deeper into a discerning person than a hundred blows into a fool."
    },
    {
      "verse": 11,
      "text": "Evil people seek only rebellion, but a cruel messenger will be sent against them."
    },
    {
      "verse": 12,
      "text": "Better to meet a she-bear robbed of its cubs than to confront a fool immersed in folly."
    },
    {
      "verse": 13,
      "text": "Evil will not depart from the house of one who returns evil for good."
    },
    {
      "verse": 14,
      "text": "The beginning of strife is like letting out water; so stop before the quarrel breaks out."
    },
    {
      "verse": 15,
      "text": "One who justifies the wicked and one who condemns the righteous are both alike an abomination to the Lord."
    },
    {
      "verse": 16,
      "text": "Why should fools have a price in hand to buy wisdom, when they have no mind to learn?"
    },
    {
      "verse": 17,
      "text": "A friend loves at all times,"
    },
    {
      "verse": 18,
      "text": "It is senseless to give a pledge, to become surety for a neighbor."
    },
    {
      "verse": 19,
      "text": "One who loves transgression loves strife; one who builds a high threshold invites broken bones."
    },
    {
      "verse": 20,
      "text": "The crooked of mind do not prosper, and the perverse of tongue fall into calamity."
    },
    {
      "verse": 21,
      "text": "The one who begets a fool gets trouble; the parent of a fool has no joy."
    },
    {
      "verse": 22,
      "text": "A cheerful heart is a good medicine, but a downcast spirit dries up the bones."
    },
    {
      "verse": 23,
      "text": "The wicked accept a concealed bribe to pervert the ways of justice."
    },
    {
      "verse": 24,
      "text": "The discerning person looks to wisdom, but the eyes of a fool to the ends of the earth."
    },
    {
      "verse": 25,
      "text": "Foolish children are a grief to their father and bitterness to her who bore them."
    },
    {
      "verse": 26,
      "text": "To impose a fine on the innocent is not right, or to flog the noble for their integrity."
    },
    {
      "verse": 27,
      "text": "One who spares words is knowledgeable; one who is cool in spirit has understanding."
    },
    {
      "verse": 28,
      "text": "Even fools who keep silent are considered wise; when they close their lips, they are deemed intelligent."
    }
  ],
  "timestamp": "2025-09-16T19:47:18.959265"
}