{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 30,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PRO.30",
  "verses": [
    {
      "verse": 1,
      "text": "The words of Agur son of Jakeh. An oracle. Thus says the man: I am weary, O God, I am weary, O God. How can I prevail?"
    },
    {
      "verse": 2,
      "text": "Surely I am too stupid to be human; I do not have human understanding."
    },
    {
      "verse": 3,
      "text": "I have not learned wisdom, nor have I knowledge of the holy ones."
    },
    {
      "verse": 4,
      "text": "Who has ascended to heaven and come down? Who has gathered the wind in the hollow of the hand? Who has wrapped up the waters in a garment? Who has established all the ends of the earth? What is the person's name? And what is the name of the person's child? Surely you know!"
    },
    {
      "verse": 5,
      "text": "Every word of God proves true; he is a shield to those who take refuge in him."
    },
    {
      "verse": 6,
      "text": "Do not add to his words, or else he will rebuke you, and you will be found a liar."
    },
    {
      "verse": 7,
      "text": "Two things I ask of you; do not deny them to me before I die:"
    },
    {
      "verse": 8,
      "text": "Remove far from me falsehood and lying; give me neither poverty nor riches; feed me with the food that I need,"
    },
    {
      "verse": 9,
      "text": "or I shall be full, and deny you, and say, “Who is the Lord?” or I shall be poor, and steal, and profane the name of my God."
    },
    {
      "verse": 10,
      "text": "Do not slander a servant to a master, or the servant will curse you, and you will be held guilty."
    },
    {
      "verse": 11,
      "text": "There are those who curse their fathers and do not bless their mothers."
    },
    {
      "verse": 12,
      "text": "There are those who are pure in their own eyes yet are not cleansed of their filthiness."
    },
    {
      "verse": 13,
      "text": "There are those—how lofty are their eyes, how high their eyelids lift!"
    },
    {
      "verse": 14,
      "text": "There are those whose teeth are swords, whose teeth are knives, to devour the poor from off the earth, the needy from among mortals."
    },
    {
      "verse": 15,
      "text": "The leech has two daughters; “Give, give,” they cry. Three things are never satisfied; four never say, “Enough”:"
    },
    {
      "verse": 16,
      "text": "Sheol, the barren womb, the earth ever thirsty for water, and the fire that never says, “Enough.”"
    },
    {
      "verse": 17,
      "text": "The eye that mocks a father and scorns to obey a mother will be pecked out by the ravens of the valley and eaten by the vultures."
    },
    {
      "verse": 18,
      "text": "Three things are too wonderful for me; four I do not understand:"
    },
    {
      "verse": 19,
      "text": "the way of an eagle in the sky, the way of a snake on a rock, the way of a ship on the high seas, and the way of a man with a girl."
    },
    {
      "verse": 20,
      "text": "This is the way of an adulteress: she eats, and wipes her mouth, and says, “I have done no wrong.”"
    },
    {
      "verse": 21,
      "text": "Under three things the earth trembles; under four it cannot bear up:"
    },
    {
      "verse": 22,
      "text": "a slave when he becomes king, and a fool when glutted with food;"
    },
    {
      "verse": 23,
      "text": "an unloved woman when she gets a husband, and a maid when she succeeds her mistress."
    },
    {
      "verse": 24,
      "text": "Four things on earth are small, yet they are exceedingly wise:"
    },
    {
      "verse": 25,
      "text": "the ants are a people without strength, yet they provide their food in the summer;"
    },
    {
      "verse": 26,
      "text": "the badgers are a people without power, yet they make their homes in the rocks;"
    },
    {
      "verse": 27,
      "text": "the locusts have no king, yet all of them march in rank;"
    },
    {
      "verse": 28,
      "text": "the lizard can be grasped in the hand, yet it is found in kings' palaces."
    },
    {
      "verse": 29,
      "text": "Three things are stately in their stride; four are stately in their gait:"
    },
    {
      "verse": 30,
      "text": "the lion, which is mightiest among wild animals and does not turn back before any;"
    },
    {
      "verse": 31,
      "text": "the strutting rooster, the he-goat, and a king striding before his people."
    },
    {
      "verse": 32,
      "text": "If you have been foolish, exalting yourself, or if you have been devising evil, put your hand on your mouth."
    },
    {
      "verse": 33,
      "text": "For as pressing milk produces curds, and pressing the nose produces blood, so pressing anger produces strife."
    }
  ],
  "timestamp": "2025-09-16T19:47:23.249976"
}