{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 16,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PRO.16",
  "verses": [
    {
      "verse": 1,
      "text": "The plans of the mind belong to mortals, but the answer of the tongue is from the Lord."
    },
    {
      "verse": 2,
      "text": "All one's ways may be pure in one's own eyes, but the Lord weighs the spirit."
    },
    {
      "verse": 3,
      "text": "Commit your work to the Lord, and your plans will be established."
    },
    {
      "verse": 4,
      "text": "The Lord has made everything for its purpose, even the wicked for the day of trouble."
    },
    {
      "verse": 5,
      "text": "All those who are arrogant are an abomination to the Lord; be assured, they will not go unpunished."
    },
    {
      "verse": 6,
      "text": "By loyalty and faithfulness iniquity is atoned for, and by the fear of the Lord one avoids evil."
    },
    {
      "verse": 7,
      "text": "When the ways of people please the Lord, he causes even their enemies to be at peace with them."
    },
    {
      "verse": 8,
      "text": "Better is a little with righteousness than large income with injustice."
    },
    {
      "verse": 9,
      "text": "The human mind plans the way, but the Lord directs the steps."
    },
    {
      "verse": 10,
      "text": "Inspired decisions are on the lips of a king; his mouth does not sin in judgment."
    },
    {
      "verse": 11,
      "text": "Honest balances and scales are the Lord 's; all the weights in the bag are his work."
    },
    {
      "verse": 12,
      "text": "It is an abomination to kings to do evil, for the throne is established by righteousness."
    },
    {
      "verse": 13,
      "text": "Righteous lips are the delight of a king, and he loves those who speak what is right."
    },
    {
      "verse": 14,
      "text": "A king's wrath is a messenger of death, and whoever is wise will appease it."
    },
    {
      "verse": 15,
      "text": "In the light of a king's face there is life, and his favor is like the clouds that bring the spring rain."
    },
    {
      "verse": 16,
      "text": "How much better to get wisdom than gold! To get understanding is to be chosen rather than silver."
    },
    {
      "verse": 17,
      "text": "The highway of the upright avoids evil; those who guard their way preserve their lives."
    },
    {
      "verse": 18,
      "text": "Pride goes before destruction, and a haughty spirit before a fall."
    },
    {
      "verse": 19,
      "text": "It is better to be of a lowly spirit among the poor than to divide the spoil with the proud."
    },
    {
      "verse": 20,
      "text": "Those who are attentive to a matter will prosper, and happy are those who trust in the Lord."
    },
    {
      "verse": 21,
      "text": "The wise of heart is called perceptive, and pleasant speech increases persuasiveness."
    },
    {
      "verse": 22,
      "text": "Wisdom is a fountain of life to one who has it, but folly is the punishment of fools."
    },
    {
      "verse": 23,
      "text": "The mind of the wise makes their speech judicious, and adds persuasiveness to their lips."
    },
    {
      "verse": 24,
      "text": "Pleasant words are like a honeycomb, sweetness to the soul and health to the body."
    },
    {
      "verse": 25,
      "text": "Sometimes there is a way that seems to be right, but in the end it is the way to death."
    },
    {
      "verse": 26,
      "text": "The appetite of workers works for them; their hunger urges them on."
    },
    {
      "verse": 27,
      "text": "Scoundrels concoct evil, and their speech is like a scorching fire."
    },
    {
      "verse": 28,
      "text": "A perverse person spreads strife, and a whisperer separates close friends."
    },
    {
      "verse": 29,
      "text": "The violent entice their neighbors, and lead them in a way that is not good."
    },
    {
      "verse": 30,
      "text": "One who winks the eyes plans perverse things; one who compresses the lips brings evil to pass."
    },
    {
      "verse": 31,
      "text": "Gray hair is a crown of glory; it is gained in a righteous life."
    },
    {
      "verse": 32,
      "text": "One who is slow to anger is better than the mighty, and one whose temper is controlled than one who captures a city."
    },
    {
      "verse": 33,
      "text": "The lot is cast into the lap, but the decision is the Lord 's alone."
    }
  ],
  "timestamp": "2025-09-16T19:47:18.886758"
}