{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 15,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PRO.15",
  "verses": [
    {
      "verse": 1,
      "text": "A soft answer turns away wrath, but a harsh word stirs up anger."
    },
    {
      "verse": 2,
      "text": "The tongue of the wise dispenses knowledge, but the mouths of fools pour out folly."
    },
    {
      "verse": 3,
      "text": "The eyes of the Lord are in every place, keeping watch on the evil and the good."
    },
    {
      "verse": 4,
      "text": "A gentle tongue is a tree of life, but perverseness in it breaks the spirit."
    },
    {
      "verse": 5,
      "text": "A fool despises a parent's instruction, but the one who heeds admonition is prudent."
    },
    {
      "verse": 6,
      "text": "In the house of the righteous there is much treasure, but trouble befalls the income of the wicked."
    },
    {
      "verse": 7,
      "text": "The lips of the wise spread knowledge; not so the minds of fools."
    },
    {
      "verse": 8,
      "text": "The sacrifice of the wicked is an abomination to the Lord, but the prayer of the upright is his delight."
    },
    {
      "verse": 9,
      "text": "The way of the wicked is an abomination to the Lord, but he loves the one who pursues righteousness."
    },
    {
      "verse": 10,
      "text": "There is severe discipline for one who forsakes the way, but one who hates a rebuke will die."
    },
    {
      "verse": 11,
      "text": "Sheol and Abaddon lie open before the Lord, how much more human hearts!"
    },
    {
      "verse": 12,
      "text": "Scoffers do not like to be rebuked; they will not go to the wise."
    },
    {
      "verse": 13,
      "text": "A glad heart makes a cheerful countenance, but by sorrow of heart the spirit is broken."
    },
    {
      "verse": 14,
      "text": "The mind of one who has understanding seeks knowledge, but the mouths of fools feed on folly."
    },
    {
      "verse": 15,
      "text": "All the days of the poor are hard, but a cheerful heart has a continual feast."
    },
    {
      "verse": 16,
      "text": "Better is a little with the fear of the Lord than great treasure and trouble with it."
    },
    {
      "verse": 17,
      "text": "Better is a dinner of vegetables where love is than a fatted ox and hatred with it."
    },
    {
      "verse": 18,
      "text": "Those who are hot-tempered stir up strife, but those who are slow to anger calm contention."
    },
    {
      "verse": 19,
      "text": "The way of the lazy is overgrown with thorns, but the path of the upright is a level highway."
    },
    {
      "verse": 20,
      "text": "A wise child makes a glad father, but the foolish despise their mothers."
    },
    {
      "verse": 21,
      "text": "Folly is a joy to one who has no sense, but a person of understanding walks straight ahead."
    },
    {
      "verse": 22,
      "text": "Without counsel, plans go wrong, but with many advisers they succeed."
    },
    {
      "verse": 23,
      "text": "To make an apt answer is a joy to anyone, and a word in season, how good it is!"
    },
    {
      "verse": 24,
      "text": "For the wise the path of life leads upward, in order to avoid Sheol below."
    },
    {
      "verse": 25,
      "text": "The Lord tears down the house of the proud, but maintains the widow's boundaries."
    },
    {
      "verse": 26,
      "text": "Evil plans are an abomination to the Lord, but gracious words are pure."
    },
    {
      "verse": 27,
      "text": "Those who are greedy for unjust gain make trouble for their households, but those who hate bribes will live."
    },
    {
      "verse": 28,
      "text": "The mind of the righteous ponders how to answer, but the mouth of the wicked pours out evil."
    },
    {
      "verse": 29,
      "text": "The Lord is far from the wicked, but he hears the prayer of the righteous."
    },
    {
      "verse": 30,
      "text": "The light of the eyes rejoices the heart, and good news refreshes the body."
    },
    {
      "verse": 31,
      "text": "The ear that heeds wholesome admonition will lodge among the wise."
    },
    {
      "verse": 32,
      "text": "Those who ignore instruction despise themselves, but those who heed admonition gain understanding."
    },
    {
      "verse": 33,
      "text": "The fear of the Lord is instruction in wisdom, and humility goes before honor."
    }
  ],
  "timestamp": "2025-09-16T19:47:18.520626"
}