{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 40,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.40",
  "verses": [
    {
      "verse": 1,
      "text": "I waited patiently for the Lord; he inclined to me and heard my cry."
    },
    {
      "verse": 2,
      "text": "He drew me up from the desolate pit, out of the miry bog, and set my feet upon a rock, making my steps secure."
    },
    {
      "verse": 3,
      "text": "He put a new song in my mouth, a song of praise to our God. Many will see and fear, and put their trust in the Lord."
    },
    {
      "verse": 4,
      "text": "Happy are those who make the Lord their trust, who do not turn to the proud, to those who go astray after false gods."
    },
    {
      "verse": 5,
      "text": "You have multiplied, O Lord my God, your wondrous deeds and your thoughts toward us; none can compare with you. Were I to proclaim and tell of them, they would be more than can be counted."
    },
    {
      "verse": 6,
      "text": "Sacrifice and offering you do not desire, but you have given me an open ear. Burnt offering and sin offering you have not required."
    },
    {
      "verse": 7,
      "text": "Then I said, “Here I am; in the scroll of the book it is written of me."
    },
    {
      "verse": 8,
      "text": "I delight to do your will, O my God; your law is within my heart.”"
    },
    {
      "verse": 9,
      "text": "I have told the glad news of deliverance in the great congregation; see, I have not restrained my lips, as you know, O Lord."
    },
    {
      "verse": 10,
      "text": "I have not hidden your saving help within my heart, I have spoken of your faithfulness and your salvation; I have not concealed your steadfast love and your faithfulness from the great congregation."
    },
    {
      "verse": 11,
      "text": "Do not, O Lord, withhold your mercy from me; let your steadfast love and your faithfulness keep me safe forever."
    },
    {
      "verse": 12,
      "text": "For evils have encompassed me without number; my iniquities have overtaken me, until I cannot see; they are more than the hairs of my head, and my heart fails me."
    },
    {
      "verse": 13,
      "text": "Be pleased, O Lord, to deliver me; O Lord, make haste to help me."
    },
    {
      "verse": 14,
      "text": "Let all those be put to shame and confusion who seek to snatch away my life; let those be turned back and brought to dishonor who desire my hurt."
    },
    {
      "verse": 15,
      "text": "Let those be appalled because of their shame who say to me, “Aha, Aha!”"
    },
    {
      "verse": 16,
      "text": "But may all who seek you rejoice and be glad in you; may those who love your salvation say continually, “Great is the Lord!”"
    },
    {
      "verse": 17,
      "text": "As for me, I am poor and needy, but the Lord takes thought for me. You are my help and my deliverer; do not delay, O my God."
    }
  ],
  "timestamp": "2025-09-16T19:46:34.198185"
}