{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 49,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.49",
  "verses": [
    {
      "verse": 1,
      "text": "Hear this, all you peoples; give ear, all inhabitants of the world,"
    },
    {
      "verse": 2,
      "text": "both low and high, rich and poor together."
    },
    {
      "verse": 3,
      "text": "My mouth shall speak wisdom; the meditation of my heart shall be understanding."
    },
    {
      "verse": 4,
      "text": "I will incline my ear to a proverb; I will solve my riddle to the music of the harp."
    },
    {
      "verse": 5,
      "text": "Why should I fear in times of trouble, when the iniquity of my persecutors surrounds me,"
    },
    {
      "verse": 6,
      "text": "those who trust in their wealth and boast of the abundance of their riches?"
    },
    {
      "verse": 7,
      "text": "Truly, no ransom avails for one's life, there is no price one can give to God for it."
    },
    {
      "verse": 8,
      "text": "For the ransom of life is costly, and can never suffice"
    },
    {
      "verse": 9,
      "text": "that one should live on forever and never see the grave."
    },
    {
      "verse": 10,
      "text": "When we look at the wise, they die; fool and dolt perish together and leave their wealth to others."
    },
    {
      "verse": 11,
      "text": "Their graves are their homes forever, their dwelling places to all generations, though they named lands their own."
    },
    {
      "verse": 12,
      "text": "Mortals cannot abide in their pomp; they are like the animals that perish."
    },
    {
      "verse": 13,
      "text": "Such is the fate of the foolhardy, the end of those who are pleased with their lot. Selah"
    },
    {
      "verse": 14,
      "text": "Like sheep they are appointed for Sheol; Death shall be their shepherd; straight to the grave they descend, and their form shall waste away; Sheol shall be their home."
    },
    {
      "verse": 15,
      "text": "But God will ransom my soul from the power of Sheol, for he will receive me. Selah"
    },
    {
      "verse": 16,
      "text": "Do not be afraid when some become rich, when the wealth of their houses increases."
    },
    {
      "verse": 17,
      "text": "For when they die they will carry nothing away; their wealth will not go down after them."
    },
    {
      "verse": 18,
      "text": "Though in their lifetime they count themselves happy —for you are praised when you do well for yourself—"
    },
    {
      "verse": 19,
      "text": "they will go to the company of their ancestors, who will never again see the light."
    },
    {
      "verse": 20,
      "text": "Mortals cannot abide in their pomp; they are like the animals that perish."
    }
  ],
  "timestamp": "2025-09-16T19:46:38.177899"
}