{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 9,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.9",
  "verses": [
    {
      "verse": 1,
      "text": "I will give thanks to the Lord with my whole heart; I will tell of all your wonderful deeds."
    },
    {
      "verse": 2,
      "text": "I will be glad and exult in you; I will sing praise to your name, O Most High."
    },
    {
      "verse": 3,
      "text": "When my enemies turned back, they stumbled and perished before you."
    },
    {
      "verse": 4,
      "text": "For you have maintained my just cause; you have sat on the throne giving righteous judgment."
    },
    {
      "verse": 5,
      "text": "You have rebuked the nations, you have destroyed the wicked; you have blotted out their name forever and ever."
    },
    {
      "verse": 6,
      "text": "The enemies have vanished in everlasting ruins; their cities you have rooted out; the very memory of them has perished."
    },
    {
      "verse": 7,
      "text": "But the Lord sits enthroned forever, he has established his throne for judgment."
    },
    {
      "verse": 8,
      "text": "He judges the world with righteousness; he judges the peoples with equity."
    },
    {
      "verse": 9,
      "text": "The Lord is a stronghold for the oppressed, a stronghold in times of trouble."
    },
    {
      "verse": 10,
      "text": "And those who know your name put their trust in you, for you, O Lord, have not forsaken those who seek you."
    },
    {
      "verse": 11,
      "text": "Sing praises to the Lord, who dwells in Zion. Declare his deeds among the peoples."
    },
    {
      "verse": 12,
      "text": "For he who avenges blood is mindful of them; he does not forget the cry of the afflicted."
    },
    {
      "verse": 13,
      "text": "Be gracious to me, O Lord. See what I suffer from those who hate me; you are the one who lifts me up from the gates of death,"
    },
    {
      "verse": 14,
      "text": "so that I may recount all your praises, and, in the gates of daughter Zion, rejoice in your deliverance."
    },
    {
      "verse": 15,
      "text": "The nations have sunk in the pit that they made; in the net that they hid has their own foot been caught."
    },
    {
      "verse": 16,
      "text": "The Lord has made himself known, he has executed judgment; the wicked are snared in the work of their own hands. [Higgaion. Selah]"
    },
    {
      "verse": 17,
      "text": "The wicked shall depart to Sheol, all the nations that forget God."
    },
    {
      "verse": 18,
      "text": "For the needy shall not always be forgotten, nor the hope of the poor perish forever."
    },
    {
      "verse": 19,
      "text": "Rise up, O Lord! Do not let mortals prevail; let the nations be judged before you."
    },
    {
      "verse": 20,
      "text": "Put them in fear, O Lord; let the nations know that they are only human. Selah"
    }
  ],
  "timestamp": "2025-09-16T19:46:22.624722"
}