{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 59,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.59",
  "verses": [
    {
      "verse": 1,
      "text": "Deliver me from my enemies, O my God; protect me from those who rise up against me."
    },
    {
      "verse": 2,
      "text": "Deliver me from those who work evil; from the bloodthirsty save me."
    },
    {
      "verse": 3,
      "text": "Even now they lie in wait for my life; the mighty stir up strife against me. For no transgression or sin of mine, O Lord,"
    },
    {
      "verse": 4,
      "text": "for no fault of mine, they run and make ready. Rouse yourself, come to my help and see!"
    },
    {
      "verse": 5,
      "text": "You, Lord God of hosts, are God of Israel. Awake to punish all the nations; spare none of those who treacherously plot evil. Selah"
    },
    {
      "verse": 6,
      "text": "Each evening they come back, howling like dogs and prowling about the city."
    },
    {
      "verse": 7,
      "text": "There they are, bellowing with their mouths, with sharp words on their lips— for “Who,” they think, “will hear us?”"
    },
    {
      "verse": 8,
      "text": "But you laugh at them, O Lord; you hold all the nations in derision."
    },
    {
      "verse": 9,
      "text": "O my strength, I will watch for you; for you, O God, are my fortress."
    },
    {
      "verse": 10,
      "text": "My God in his steadfast love will meet me; my God will let me look in triumph on my enemies."
    },
    {
      "verse": 11,
      "text": "Do not kill them, or my people may forget; make them totter by your power, and bring them down, O Lord, our shield."
    },
    {
      "verse": 12,
      "text": "For the sin of their mouths, the words of their lips, let them be trapped in their pride. For the cursing and lies that they utter,"
    },
    {
      "verse": 13,
      "text": "consume them in wrath; consume them until they are no more. Then it will be known to the ends of the earth that God rules over Jacob. Selah"
    },
    {
      "verse": 14,
      "text": "Each evening they come back, howling like dogs and prowling about the city."
    },
    {
      "verse": 15,
      "text": "They roam about for food, and growl if they do not get their fill."
    },
    {
      "verse": 16,
      "text": "But I will sing of your might; I will sing aloud of your steadfast love in the morning. For you have been a fortress for me and a refuge in the day of my distress."
    },
    {
      "verse": 17,
      "text": "O my strength, I will sing praises to you, for you, O God, are my fortress, the God who shows me steadfast love."
    }
  ],
  "timestamp": "2025-09-16T19:46:41.466846"
}