{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 83,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.83",
  "verses": [
    {
      "verse": 1,
      "text": "O God, do not keep silence; do not hold your peace or be still, O God!"
    },
    {
      "verse": 2,
      "text": "Even now your enemies are in tumult; those who hate you have raised their heads."
    },
    {
      "verse": 3,
      "text": "They lay crafty plans against your people; they consult together against those you protect."
    },
    {
      "verse": 4,
      "text": "They say, “Come, let us wipe them out as a nation; let the name of Israel be remembered no more.”"
    },
    {
      "verse": 5,
      "text": "They conspire with one accord; against you they make a covenant—"
    },
    {
      "verse": 6,
      "text": "the tents of Edom and the Ishmaelites, Moab and the Hagrites,"
    },
    {
      "verse": 7,
      "text": "Gebal and Ammon and Amalek, Philistia with the inhabitants of Tyre;"
    },
    {
      "verse": 8,
      "text": "Assyria also has joined them; they are the strong arm of the children of Lot. Selah"
    },
    {
      "verse": 9,
      "text": "Do to them as you did to Midian, as to Sisera and Jabin at the Wadi Kishon,"
    },
    {
      "verse": 10,
      "text": "who were destroyed at En-dor, who became dung for the ground."
    },
    {
      "verse": 11,
      "text": "Make their nobles like Oreb and Zeeb, all their princes like Zebah and Zalmunna,"
    },
    {
      "verse": 12,
      "text": "who said, “Let us take the pastures of God for our own possession.”"
    },
    {
      "verse": 13,
      "text": "O my God, make them like whirling dust, like chaff before the wind."
    },
    {
      "verse": 14,
      "text": "As fire consumes the forest, as the flame sets the mountains ablaze,"
    },
    {
      "verse": 15,
      "text": "so pursue them with your tempest and terrify them with your hurricane."
    },
    {
      "verse": 16,
      "text": "Fill their faces with shame, so that they may seek your name, O Lord."
    },
    {
      "verse": 17,
      "text": "Let them be put to shame and dismayed forever; let them perish in disgrace."
    },
    {
      "verse": 18,
      "text": "Let them know that you alone, whose name is the Lord, are the Most High over all the earth."
    }
  ],
  "timestamp": "2025-09-16T19:46:48.294365"
}