{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 7,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.7",
  "verses": [
    {
      "verse": 1,
      "text": "O Lord my God, in you I take refuge; save me from all my pursuers, and deliver me,"
    },
    {
      "verse": 2,
      "text": "or like a lion they will tear me apart; they will drag me away, with no one to rescue."
    },
    {
      "verse": 3,
      "text": "O Lord my God, if I have done this, if there is wrong in my hands,"
    },
    {
      "verse": 4,
      "text": "if I have repaid my ally with harm or plundered my foe without cause,"
    },
    {
      "verse": 5,
      "text": "then let the enemy pursue and overtake me, trample my life to the ground, and lay my soul in the dust. Selah"
    },
    {
      "verse": 6,
      "text": "Rise up, O Lord, in your anger; lift yourself up against the fury of my enemies; awake, O my God; you have appointed a judgment."
    },
    {
      "verse": 7,
      "text": "Let the assembly of the peoples be gathered around you, and over it take your seat on high."
    },
    {
      "verse": 8,
      "text": "The Lord judges the peoples; judge me, O Lord, according to my righteousness and according to the integrity that is in me."
    },
    {
      "verse": 9,
      "text": "O let the evil of the wicked come to an end, but establish the righteous, you who test the minds and hearts, O righteous God."
    },
    {
      "verse": 10,
      "text": "God is my shield, who saves the upright in heart."
    },
    {
      "verse": 11,
      "text": "God is a righteous judge, and a God who has indignation every day."
    },
    {
      "verse": 12,
      "text": "If one does not repent, God will whet his sword; he has bent and strung his bow;"
    },
    {
      "verse": 13,
      "text": "he has prepared his deadly weapons, making his arrows fiery shafts."
    },
    {
      "verse": 14,
      "text": "See how they conceive evil, and are pregnant with mischief, and bring forth lies."
    },
    {
      "verse": 15,
      "text": "They make a pit, digging it out, and fall into the hole that they have made."
    },
    {
      "verse": 16,
      "text": "Their mischief returns upon their own heads, and on their own heads their violence descends."
    },
    {
      "verse": 17,
      "text": "I will give to the Lord the thanks due to his righteousness, and sing praise to the name of the Lord, the Most High."
    }
  ],
  "timestamp": "2025-09-16T19:46:22.055757"
}