{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 89,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.89",
  "verses": [
    {
      "verse": 1,
      "text": "I will sing of your steadfast love, O Lord, forever; with my mouth I will proclaim your faithfulness to all generations."
    },
    {
      "verse": 2,
      "text": "I declare that your steadfast love is established forever; your faithfulness is as firm as the heavens."
    },
    {
      "verse": 3,
      "text": "You said, “I have made a covenant with my chosen one, I have sworn to my servant David:"
    },
    {
      "verse": 4,
      "text": "‘I will establish your descendants forever, and build your throne for all generations.’ ” Selah"
    },
    {
      "verse": 5,
      "text": "Let the heavens praise your wonders, O Lord, your faithfulness in the assembly of the holy ones."
    },
    {
      "verse": 6,
      "text": "For who in the skies can be compared to the Lord? Who among the heavenly beings is like the Lord,"
    },
    {
      "verse": 7,
      "text": "a God feared in the council of the holy ones, great and awesome above all that are around him?"
    },
    {
      "verse": 8,
      "text": "O Lord God of hosts, who is as mighty as you, O Lord? Your faithfulness surrounds you."
    },
    {
      "verse": 9,
      "text": "You rule the raging of the sea; when its waves rise, you still them."
    },
    {
      "verse": 10,
      "text": "You crushed Rahab like a carcass; you scattered your enemies with your mighty arm."
    },
    {
      "verse": 11,
      "text": "The heavens are yours, the earth also is yours; the world and all that is in it—you have founded them."
    },
    {
      "verse": 12,
      "text": "The north and the south —you created them; Tabor and Hermon joyously praise your name."
    },
    {
      "verse": 13,
      "text": "You have a mighty arm; strong is your hand, high your right hand."
    },
    {
      "verse": 14,
      "text": "Righteousness and justice are the foundation of your throne; steadfast love and faithfulness go before you."
    },
    {
      "verse": 15,
      "text": "Happy are the people who know the festal shout, who walk, O Lord, in the light of your countenance;"
    },
    {
      "verse": 16,
      "text": "they exult in your name all day long, and extol your righteousness."
    },
    {
      "verse": 17,
      "text": "For you are the glory of their strength; by your favor our horn is exalted."
    },
    {
      "verse": 18,
      "text": "For our shield belongs to the Lord, our king to the Holy One of Israel."
    },
    {
      "verse": 19,
      "text": "Then you spoke in a vision to your faithful one, and said: “I have set the crown on one who is mighty, I have exalted one chosen from the people."
    },
    {
      "verse": 20,
      "text": "I have found my servant David; with my holy oil I have anointed him;"
    },
    {
      "verse": 21,
      "text": "my hand shall always remain with him; my arm also shall strengthen him."
    },
    {
      "verse": 22,
      "text": "The enemy shall not outwit him, the wicked shall not humble him."
    },
    {
      "verse": 23,
      "text": "I will crush his foes before him and strike down those who hate him."
    },
    {
      "verse": 24,
      "text": "My faithfulness and steadfast love shall be with him; and in my name his horn shall be exalted."
    },
    {
      "verse": 25,
      "text": "I will set his hand on the sea and his right hand on the rivers."
    },
    {
      "verse": 26,
      "text": "He shall cry to me, ‘You are my Father, my God, and the Rock of my salvation!’"
    },
    {
      "verse": 27,
      "text": "I will make him the firstborn, the highest of the kings of the earth."
    },
    {
      "verse": 28,
      "text": "Forever I will keep my steadfast love for him, and my covenant with him will stand firm."
    },
    {
      "verse": 29,
      "text": "I will establish his line forever, and his throne as long as the heavens endure."
    },
    {
      "verse": 30,
      "text": "If his children forsake my law and do not walk according to my ordinances,"
    },
    {
      "verse": 31,
      "text": "if they violate my statutes and do not keep my commandments,"
    },
    {
      "verse": 32,
      "text": "then I will punish their transgression with the rod and their iniquity with scourges;"
    },
    {
      "verse": 33,
      "text": "but I will not remove from him my steadfast love, or be false to my faithfulness."
    },
    {
      "verse": 34,
      "text": "I will not violate my covenant, or alter the word that went forth from my lips."
    },
    {
      "verse": 35,
      "text": "Once and for all I have sworn by my holiness; I will not lie to David."
    },
    {
      "verse": 36,
      "text": "His line shall continue forever, and his throne endure before me like the sun."
    },
    {
      "verse": 37,
      "text": "It shall be established forever like the moon, an enduring witness in the skies.” Selah"
    },
    {
      "verse": 38,
      "text": "But now you have spurned and rejected him; you are full of wrath against your anointed."
    },
    {
      "verse": 39,
      "text": "You have renounced the covenant with your servant; you have defiled his crown in the dust."
    },
    {
      "verse": 40,
      "text": "You have broken through all his walls; you have laid his strongholds in ruins."
    },
    {
      "verse": 41,
      "text": "All who pass by plunder him; he has become the scorn of his neighbors."
    },
    {
      "verse": 42,
      "text": "You have exalted the right hand of his foes; you have made all his enemies rejoice."
    },
    {
      "verse": 43,
      "text": "Moreover, you have turned back the edge of his sword, and you have not supported him in battle."
    },
    {
      "verse": 44,
      "text": "You have removed the scepter from his hand, and hurled his throne to the ground."
    },
    {
      "verse": 45,
      "text": "You have cut short the days of his youth; you have covered him with shame. Selah"
    },
    {
      "verse": 46,
      "text": "How long, O Lord? Will you hide yourself forever? How long will your wrath burn like fire?"
    },
    {
      "verse": 47,
      "text": "Remember how short my time is— for what vanity you have created all mortals!"
    },
    {
      "verse": 48,
      "text": "Who can live and never see death? Who can escape the power of Sheol? Selah"
    },
    {
      "verse": 49,
      "text": "Lord, where is your steadfast love of old, which by your faithfulness you swore to David?"
    },
    {
      "verse": 50,
      "text": "Remember, O Lord, how your servant is taunted; how I bear in my bosom the insults of the peoples,"
    },
    {
      "verse": 51,
      "text": "with which your enemies taunt, O Lord, with which they taunted the footsteps of your anointed."
    },
    {
      "verse": 52,
      "text": "Blessed be the Lord forever. Amen and Amen."
    }
  ],
  "timestamp": "2025-09-16T19:46:50.075056"
}