{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 33,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.33",
  "verses": [
    {
      "verse": 1,
      "text": "Rejoice in the Lord, O you righteous. Praise befits the upright."
    },
    {
      "verse": 2,
      "text": "Praise the Lord with the lyre; make melody to him with the harp of ten strings."
    },
    {
      "verse": 3,
      "text": "Sing to him a new song; play skillfully on the strings, with loud shouts."
    },
    {
      "verse": 4,
      "text": "For the word of the Lord is upright, and all his work is done in faithfulness."
    },
    {
      "verse": 5,
      "text": "He loves righteousness and justice; the earth is full of the steadfast love of the Lord."
    },
    {
      "verse": 6,
      "text": "By the word of the Lord the heavens were made, and all their host by the breath of his mouth."
    },
    {
      "verse": 7,
      "text": "He gathered the waters of the sea as in a bottle; he put the deeps in storehouses."
    },
    {
      "verse": 8,
      "text": "Let all the earth fear the Lord; let all the inhabitants of the world stand in awe of him."
    },
    {
      "verse": 9,
      "text": "For he spoke, and it came to be; he commanded, and it stood firm."
    },
    {
      "verse": 10,
      "text": "The Lord brings the counsel of the nations to nothing; he frustrates the plans of the peoples."
    },
    {
      "verse": 11,
      "text": "The counsel of the Lord stands forever, the thoughts of his heart to all generations."
    },
    {
      "verse": 12,
      "text": "Happy is the nation whose God is the Lord, the people whom he has chosen as his heritage."
    },
    {
      "verse": 13,
      "text": "The Lord looks down from heaven; he sees all humankind."
    },
    {
      "verse": 14,
      "text": "From where he sits enthroned he watches all the inhabitants of the earth—"
    },
    {
      "verse": 15,
      "text": "he who fashions the hearts of them all, and observes all their deeds."
    },
    {
      "verse": 16,
      "text": "A king is not saved by his great army; a warrior is not delivered by his great strength."
    },
    {
      "verse": 17,
      "text": "The war horse is a vain hope for victory, and by its great might it cannot save."
    },
    {
      "verse": 18,
      "text": "Truly the eye of the Lord is on those who fear him, on those who hope in his steadfast love,"
    },
    {
      "verse": 19,
      "text": "to deliver their soul from death, and to keep them alive in famine."
    },
    {
      "verse": 20,
      "text": "Our soul waits for the Lord; he is our help and shield."
    },
    {
      "verse": 21,
      "text": "Our heart is glad in him, because we trust in his holy name."
    },
    {
      "verse": 22,
      "text": "Let your steadfast love, O Lord, be upon us, even as we hope in you."
    }
  ],
  "timestamp": "2025-09-16T19:46:31.534126"
}