{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 34,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.34",
  "verses": [
    {
      "verse": 1,
      "text": "I will bless the Lord at all times; his praise shall continually be in my mouth."
    },
    {
      "verse": 2,
      "text": "My soul makes its boast in the Lord; let the humble hear and be glad."
    },
    {
      "verse": 3,
      "text": "O magnify the Lord with me, and let us exalt his name together."
    },
    {
      "verse": 4,
      "text": "I sought the Lord, and he answered me, and delivered me from all my fears."
    },
    {
      "verse": 5,
      "text": "Look to him, and be radiant; so your faces shall never be ashamed."
    },
    {
      "verse": 6,
      "text": "This poor soul cried, and was heard by the Lord, and was saved from every trouble."
    },
    {
      "verse": 7,
      "text": "The angel of the Lord encamps around those who fear him, and delivers them."
    },
    {
      "verse": 8,
      "text": "O taste and see that the Lord is good; happy are those who take refuge in him."
    },
    {
      "verse": 9,
      "text": "O fear the Lord, you his holy ones, for those who fear him have no want."
    },
    {
      "verse": 10,
      "text": "The young lions suffer want and hunger, but those who seek the Lord lack no good thing."
    },
    {
      "verse": 11,
      "text": "Come, O children, listen to me; I will teach you the fear of the Lord."
    },
    {
      "verse": 12,
      "text": "Which of you desires life, and covets many days to enjoy good?"
    },
    {
      "verse": 13,
      "text": "Keep your tongue from evil, and your lips from speaking deceit."
    },
    {
      "verse": 14,
      "text": "Depart from evil, and do good; seek peace, and pursue it."
    },
    {
      "verse": 15,
      "text": "The eyes of the Lord are on the righteous, and his ears are open to their cry."
    },
    {
      "verse": 16,
      "text": "The face of the Lord is against evildoers, to cut off the remembrance of them from the earth."
    },
    {
      "verse": 17,
      "text": "When the righteous cry for help, the Lord hears, and rescues them from all their troubles."
    },
    {
      "verse": 18,
      "text": "The Lord is near to the brokenhearted, and saves the crushed in spirit."
    },
    {
      "verse": 19,
      "text": "Many are the afflictions of the righteous, but the Lord rescues them from them all."
    },
    {
      "verse": 20,
      "text": "He keeps all their bones; not one of them will be broken."
    },
    {
      "verse": 21,
      "text": "Evil brings death to the wicked, and those who hate the righteous will be condemned."
    },
    {
      "verse": 22,
      "text": "The Lord redeems the life of his servants; none of those who take refuge in him will be condemned."
    }
  ],
  "timestamp": "2025-09-16T19:46:31.612117"
}