{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 68,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.68",
  "verses": [
    {
      "verse": 1,
      "text": "Let God rise up, let his enemies be scattered; let those who hate him flee before him."
    },
    {
      "verse": 2,
      "text": "As smoke is driven away, so drive them away; as wax melts before the fire, let the wicked perish before God."
    },
    {
      "verse": 3,
      "text": "But let the righteous be joyful; let them exult before God; let them be jubilant with joy."
    },
    {
      "verse": 4,
      "text": "Sing to God, sing praises to his name; lift up a song to him who rides upon the clouds — his name is the Lord — be exultant before him."
    },
    {
      "verse": 5,
      "text": "Father of orphans and protector of widows is God in his holy habitation."
    },
    {
      "verse": 6,
      "text": "God gives the desolate a home to live in; he leads out the prisoners to prosperity, but the rebellious live in a parched land."
    },
    {
      "verse": 7,
      "text": "O God, when you went out before your people, when you marched through the wilderness, Selah"
    },
    {
      "verse": 8,
      "text": "the earth quaked, the heavens poured down rain at the presence of God, the God of Sinai, at the presence of God, the God of Israel."
    },
    {
      "verse": 9,
      "text": "Rain in abundance, O God, you showered abroad; you restored your heritage when it languished;"
    },
    {
      "verse": 10,
      "text": "your flock found a dwelling in it; in your goodness, O God, you provided for the needy."
    },
    {
      "verse": 11,
      "text": "The Lord gives the command; great is the company of those who bore the tidings:"
    },
    {
      "verse": 12,
      "text": "“The kings of the armies, they flee, they flee!” The women at home divide the spoil,"
    },
    {
      "verse": 13,
      "text": "though they stay among the sheepfolds— the wings of a dove covered with silver, its pinions with green gold."
    },
    {
      "verse": 14,
      "text": "When the Almighty scattered kings there, snow fell on Zalmon."
    },
    {
      "verse": 15,
      "text": "O mighty mountain, mountain of Bashan; O many-peaked mountain, mountain of Bashan!"
    },
    {
      "verse": 16,
      "text": "Why do you look with envy, O many-peaked mountain, at the mount that God desired for his abode, where the Lord will reside forever?"
    },
    {
      "verse": 17,
      "text": "With mighty chariotry, twice ten thousand, thousands upon thousands, the Lord came from Sinai into the holy place."
    },
    {
      "verse": 18,
      "text": "You ascended the high mount, leading captives in your train and receiving gifts from people, even from those who rebel against the Lord God's abiding there."
    },
    {
      "verse": 19,
      "text": "Blessed be the Lord, who daily bears us up; God is our salvation. Selah"
    },
    {
      "verse": 20,
      "text": "Our God is a God of salvation, and to God, the Lord, belongs escape from death."
    },
    {
      "verse": 21,
      "text": "But God will shatter the heads of his enemies, the hairy crown of those who walk in their guilty ways."
    },
    {
      "verse": 22,
      "text": "The Lord said, “I will bring them back from Bashan, I will bring them back from the depths of the sea,"
    },
    {
      "verse": 23,
      "text": "so that you may bathe your feet in blood,"
    },
    {
      "verse": 24,
      "text": "Your solemn processions are seen, O God, the processions of my God, my King, into the sanctuary—"
    },
    {
      "verse": 25,
      "text": "the singers in front, the musicians last, between them girls playing tambourines:"
    },
    {
      "verse": 26,
      "text": "“Bless God in the great congregation, the Lord, O you who are of Israel's fountain!”"
    },
    {
      "verse": 27,
      "text": "There is Benjamin, the least of them, in the lead, the princes of Judah in a body, the princes of Zebulun, the princes of Naphtali."
    },
    {
      "verse": 28,
      "text": "Summon your might, O God; show your strength, O God, as you have done for us before."
    },
    {
      "verse": 29,
      "text": "Because of your temple at Jerusalem kings bear gifts to you."
    },
    {
      "verse": 30,
      "text": "Rebuke the wild animals that live among the reeds, the herd of bulls with the calves of the peoples. Trample under foot those who lust after tribute; scatter the peoples who delight in war."
    },
    {
      "verse": 31,
      "text": "Let bronze be brought from Egypt; let Ethiopia hasten to stretch out its hands to God."
    },
    {
      "verse": 32,
      "text": "Sing to God, O kingdoms of the earth; sing praises to the Lord, Selah"
    },
    {
      "verse": 33,
      "text": "O rider in the heavens, the ancient heavens; listen, he sends out his voice, his mighty voice."
    },
    {
      "verse": 34,
      "text": "Ascribe power to God, whose majesty is over Israel; and whose power is in the skies."
    },
    {
      "verse": 35,
      "text": "Awesome is God in his sanctuary, the God of Israel; he gives power and strength to his people. Blessed be God!"
    }
  ],
  "timestamp": "2025-09-16T19:46:43.946163"
}