{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 118,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.118",
  "verses": [
    {
      "verse": 1,
      "text": "O give thanks to the Lord, for he is good; his steadfast love endures forever!"
    },
    {
      "verse": 2,
      "text": "Let Israel say, “His steadfast love endures forever.”"
    },
    {
      "verse": 3,
      "text": "Let the house of Aaron say, “His steadfast love endures forever.”"
    },
    {
      "verse": 4,
      "text": "Let those who fear the Lord say, “His steadfast love endures forever.”"
    },
    {
      "verse": 5,
      "text": "Out of my distress I called on the Lord; the Lord answered me and set me in a broad place."
    },
    {
      "verse": 6,
      "text": "With the Lord on my side I do not fear. What can mortals do to me?"
    },
    {
      "verse": 7,
      "text": "The Lord is on my side to help me; I shall look in triumph on those who hate me."
    },
    {
      "verse": 8,
      "text": "It is better to take refuge in the Lord than to put confidence in mortals."
    },
    {
      "verse": 9,
      "text": "It is better to take refuge in the Lord than to put confidence in princes."
    },
    {
      "verse": 10,
      "text": "All nations surrounded me; in the name of the Lord I cut them off!"
    },
    {
      "verse": 11,
      "text": "They surrounded me, surrounded me on every side; in the name of the Lord I cut them off!"
    },
    {
      "verse": 12,
      "text": "They surrounded me like bees; they blazed like a fire of thorns; in the name of the Lord I cut them off!"
    },
    {
      "verse": 13,
      "text": "I was pushed hard, so that I was falling, but the Lord helped me."
    },
    {
      "verse": 14,
      "text": "The Lord is my strength and my might; he has become my salvation."
    },
    {
      "verse": 15,
      "text": "There are glad songs of victory in the tents of the righteous: “The right hand of the Lord does valiantly;"
    },
    {
      "verse": 16,
      "text": "the right hand of the Lord is exalted; the right hand of the Lord does valiantly.”"
    },
    {
      "verse": 17,
      "text": "I shall not die, but I shall live, and recount the deeds of the Lord."
    },
    {
      "verse": 18,
      "text": "The Lord has punished me severely, but he did not give me over to death."
    },
    {
      "verse": 19,
      "text": "Open to me the gates of righteousness, that I may enter through them and give thanks to the Lord."
    },
    {
      "verse": 20,
      "text": "This is the gate of the Lord; the righteous shall enter through it."
    },
    {
      "verse": 21,
      "text": "I thank you that you have answered me and have become my salvation."
    },
    {
      "verse": 22,
      "text": "The stone that the builders rejected has become the chief cornerstone."
    },
    {
      "verse": 23,
      "text": "This is the Lord 's doing; it is marvelous in our eyes."
    },
    {
      "verse": 24,
      "text": "This is the day that the Lord has made; let us rejoice and be glad in it."
    },
    {
      "verse": 25,
      "text": "Save us, we beseech you, O Lord! O Lord, we beseech you, give us success!"
    },
    {
      "verse": 26,
      "text": "Blessed is the one who comes in the name of the Lord. We bless you from the house of the Lord."
    },
    {
      "verse": 27,
      "text": "The Lord is God, and he has given us light. Bind the festal procession with branches, up to the horns of the altar."
    },
    {
      "verse": 28,
      "text": "You are my God, and I will give thanks to you; you are my God, I will extol you."
    },
    {
      "verse": 29,
      "text": "O give thanks to the Lord, for he is good, for his steadfast love endures forever."
    }
  ],
  "timestamp": "2025-09-16T19:47:00.209565"
}