{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 107,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.107",
  "verses": [
    {
      "verse": 1,
      "text": "O give thanks to the Lord, for he is good; for his steadfast love endures forever."
    },
    {
      "verse": 2,
      "text": "Let the redeemed of the Lord say so, those he redeemed from trouble"
    },
    {
      "verse": 3,
      "text": "and gathered in from the lands, from the east and from the west, from the north and from the south."
    },
    {
      "verse": 4,
      "text": "Some wandered in desert wastes, finding no way to an inhabited town;"
    },
    {
      "verse": 5,
      "text": "hungry and thirsty, their soul fainted within them."
    },
    {
      "verse": 6,
      "text": "Then they cried to the Lord in their trouble, and he delivered them from their distress;"
    },
    {
      "verse": 7,
      "text": "he led them by a straight way, until they reached an inhabited town."
    },
    {
      "verse": 8,
      "text": "Let them thank the Lord for his steadfast love, for his wonderful works to humankind."
    },
    {
      "verse": 9,
      "text": "For he satisfies the thirsty, and the hungry he fills with good things."
    },
    {
      "verse": 10,
      "text": "Some sat in darkness and in gloom, prisoners in misery and in irons,"
    },
    {
      "verse": 11,
      "text": "for they had rebelled against the words of God, and spurned the counsel of the Most High."
    },
    {
      "verse": 12,
      "text": "Their hearts were bowed down with hard labor; they fell down, with no one to help."
    },
    {
      "verse": 13,
      "text": "Then they cried to the Lord in their trouble, and he saved them from their distress;"
    },
    {
      "verse": 14,
      "text": "he brought them out of darkness and gloom, and broke their bonds asunder."
    },
    {
      "verse": 15,
      "text": "Let them thank the Lord for his steadfast love, for his wonderful works to humankind."
    },
    {
      "verse": 16,
      "text": "For he shatters the doors of bronze, and cuts in two the bars of iron."
    },
    {
      "verse": 17,
      "text": "Some were sick through their sinful ways, and because of their iniquities endured affliction;"
    },
    {
      "verse": 18,
      "text": "they loathed any kind of food, and they drew near to the gates of death."
    },
    {
      "verse": 19,
      "text": "Then they cried to the Lord in their trouble, and he saved them from their distress;"
    },
    {
      "verse": 20,
      "text": "he sent out his word and healed them, and delivered them from destruction."
    },
    {
      "verse": 21,
      "text": "Let them thank the Lord for his steadfast love, for his wonderful works to humankind."
    },
    {
      "verse": 22,
      "text": "And let them offer thanksgiving sacrifices, and tell of his deeds with songs of joy."
    },
    {
      "verse": 23,
      "text": "Some went down to the sea in ships, doing business on the mighty waters;"
    },
    {
      "verse": 24,
      "text": "they saw the deeds of the Lord, his wondrous works in the deep."
    },
    {
      "verse": 25,
      "text": "For he commanded and raised the stormy wind, which lifted up the waves of the sea."
    },
    {
      "verse": 26,
      "text": "They mounted up to heaven, they went down to the depths; their courage melted away in their calamity;"
    },
    {
      "verse": 27,
      "text": "they reeled and staggered like drunkards, and were at their wits' end."
    },
    {
      "verse": 28,
      "text": "Then they cried to the Lord in their trouble, and he brought them out from their distress;"
    },
    {
      "verse": 29,
      "text": "he made the storm be still, and the waves of the sea were hushed."
    },
    {
      "verse": 30,
      "text": "Then they were glad because they had quiet, and he brought them to their desired haven."
    },
    {
      "verse": 31,
      "text": "Let them thank the Lord for his steadfast love, for his wonderful works to humankind."
    },
    {
      "verse": 32,
      "text": "Let them extol him in the congregation of the people, and praise him in the assembly of the elders."
    },
    {
      "verse": 33,
      "text": "He turns rivers into a desert, springs of water into thirsty ground,"
    },
    {
      "verse": 34,
      "text": "a fruitful land into a salty waste, because of the wickedness of its inhabitants."
    },
    {
      "verse": 35,
      "text": "He turns a desert into pools of water, a parched land into springs of water."
    },
    {
      "verse": 36,
      "text": "And there he lets the hungry live, and they establish a town to live in;"
    },
    {
      "verse": 37,
      "text": "they sow fields, and plant vineyards, and get a fruitful yield."
    },
    {
      "verse": 38,
      "text": "By his blessing they multiply greatly, and he does not let their cattle decrease."
    },
    {
      "verse": 39,
      "text": "When they are diminished and brought low through oppression, trouble, and sorrow,"
    },
    {
      "verse": 40,
      "text": "he pours contempt on princes and makes them wander in trackless wastes;"
    },
    {
      "verse": 41,
      "text": "but he raises up the needy out of distress, and makes their families like flocks."
    },
    {
      "verse": 42,
      "text": "The upright see it and are glad; and all wickedness stops its mouth."
    },
    {
      "verse": 43,
      "text": "Let those who are wise give heed to these things, and consider the steadfast love of the Lord."
    }
  ],
  "timestamp": "2025-09-16T19:46:56.766088"
}