{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 65,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.65",
  "verses": [
    {
      "verse": 1,
      "text": "Praise is due to you, O God, in Zion; and to you shall vows be performed,"
    },
    {
      "verse": 2,
      "text": "O you who answer prayer! To you all flesh shall come."
    },
    {
      "verse": 3,
      "text": "When deeds of iniquity overwhelm us, you forgive our transgressions."
    },
    {
      "verse": 4,
      "text": "Happy are those whom you choose and bring near to live in your courts. We shall be satisfied with the goodness of your house, your holy temple."
    },
    {
      "verse": 5,
      "text": "By awesome deeds you answer us with deliverance, O God of our salvation; you are the hope of all the ends of the earth and of the farthest seas."
    },
    {
      "verse": 6,
      "text": "By your strength you established the mountains; you are girded with might."
    },
    {
      "verse": 7,
      "text": "You silence the roaring of the seas, the roaring of their waves, the tumult of the peoples."
    },
    {
      "verse": 8,
      "text": "Those who live at earth's farthest bounds are awed by your signs; you make the gateways of the morning and the evening shout for joy."
    },
    {
      "verse": 9,
      "text": "You visit the earth and water it, you greatly enrich it; the river of God is full of water; you provide the people with grain, for so you have prepared it."
    },
    {
      "verse": 10,
      "text": "You water its furrows abundantly, settling its ridges, softening it with showers, and blessing its growth."
    },
    {
      "verse": 11,
      "text": "You crown the year with your bounty; your wagon tracks overflow with richness."
    },
    {
      "verse": 12,
      "text": "The pastures of the wilderness overflow, the hills gird themselves with joy,"
    },
    {
      "verse": 13,
      "text": "the meadows clothe themselves with flocks, the valleys deck themselves with grain, they shout and sing together for joy."
    }
  ],
  "timestamp": "2025-09-16T19:46:42.841790"
}