{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 74,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.74",
  "verses": [
    {
      "verse": 1,
      "text": "O God, why do you cast us off forever? Why does your anger smoke against the sheep of your pasture?"
    },
    {
      "verse": 2,
      "text": "Remember your congregation, which you acquired long ago, which you redeemed to be the tribe of your heritage. Remember Mount Zion, where you came to dwell."
    },
    {
      "verse": 3,
      "text": "Direct your steps to the perpetual ruins; the enemy has destroyed everything in the sanctuary."
    },
    {
      "verse": 4,
      "text": "Your foes have roared within your holy place; they set up their emblems there."
    },
    {
      "verse": 5,
      "text": "At the upper entrance they hacked the wooden trellis with axes."
    },
    {
      "verse": 6,
      "text": "And then, with hatchets and hammers, they smashed all its carved work."
    },
    {
      "verse": 7,
      "text": "They set your sanctuary on fire; they desecrated the dwelling place of your name, bringing it to the ground."
    },
    {
      "verse": 8,
      "text": "They said to themselves, “We will utterly subdue them”; they burned all the meeting places of God in the land."
    },
    {
      "verse": 9,
      "text": "We do not see our emblems; there is no longer any prophet, and there is no one among us who knows how long."
    },
    {
      "verse": 10,
      "text": "How long, O God, is the foe to scoff? Is the enemy to revile your name forever?"
    },
    {
      "verse": 11,
      "text": "Why do you hold back your hand; why do you keep your hand in your bosom?"
    },
    {
      "verse": 12,
      "text": "Yet God my King is from of old, working salvation in the earth."
    },
    {
      "verse": 13,
      "text": "You divided the sea by your might; you broke the heads of the dragons in the waters."
    },
    {
      "verse": 14,
      "text": "You crushed the heads of Leviathan; you gave him as food for the creatures of the wilderness."
    },
    {
      "verse": 15,
      "text": "You cut openings for springs and torrents; you dried up ever-flowing streams."
    },
    {
      "verse": 16,
      "text": "Yours is the day, yours also the night; you established the luminaries and the sun."
    },
    {
      "verse": 17,
      "text": "You have fixed all the bounds of the earth; you made summer and winter."
    },
    {
      "verse": 18,
      "text": "Remember this, O Lord, how the enemy scoffs, and an impious people reviles your name."
    },
    {
      "verse": 19,
      "text": "Do not deliver the soul of your dove to the wild animals; do not forget the life of your poor forever."
    },
    {
      "verse": 20,
      "text": "Have regard for your covenant, for the dark places of the land are full of the haunts of violence."
    },
    {
      "verse": 21,
      "text": "Do not let the downtrodden be put to shame; let the poor and needy praise your name."
    },
    {
      "verse": 22,
      "text": "Rise up, O God, plead your cause; remember how the impious scoff at you all day long."
    },
    {
      "verse": 23,
      "text": "Do not forget the clamor of your foes, the uproar of your adversaries that goes up continually."
    }
  ],
  "timestamp": "2025-09-16T19:46:45.507116"
}