{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 73,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.73",
  "verses": [
    {
      "verse": 1,
      "text": "Truly God is good to the upright, to those who are pure in heart."
    },
    {
      "verse": 2,
      "text": "But as for me, my feet had almost stumbled; my steps had nearly slipped."
    },
    {
      "verse": 3,
      "text": "For I was envious of the arrogant; I saw the prosperity of the wicked."
    },
    {
      "verse": 4,
      "text": "For they have no pain; their bodies are sound and sleek."
    },
    {
      "verse": 5,
      "text": "They are not in trouble as others are; they are not plagued like other people."
    },
    {
      "verse": 6,
      "text": "Therefore pride is their necklace; violence covers them like a garment."
    },
    {
      "verse": 7,
      "text": "Their eyes swell out with fatness; their hearts overflow with follies."
    },
    {
      "verse": 8,
      "text": "They scoff and speak with malice; loftily they threaten oppression."
    },
    {
      "verse": 9,
      "text": "They set their mouths against heaven, and their tongues range over the earth."
    },
    {
      "verse": 10,
      "text": "Therefore the people turn and praise them, and find no fault in them."
    },
    {
      "verse": 11,
      "text": "And they say, “How can God know? Is there knowledge in the Most High?”"
    },
    {
      "verse": 12,
      "text": "Such are the wicked; always at ease, they increase in riches."
    },
    {
      "verse": 13,
      "text": "All in vain I have kept my heart clean and washed my hands in innocence."
    },
    {
      "verse": 14,
      "text": "For all day long I have been plagued, and am punished every morning."
    },
    {
      "verse": 15,
      "text": "If I had said, “I will talk on in this way,” I would have been untrue to the circle of your children."
    },
    {
      "verse": 16,
      "text": "But when I thought how to understand this, it seemed to me a wearisome task,"
    },
    {
      "verse": 17,
      "text": "until I went into the sanctuary of God; then I perceived their end."
    },
    {
      "verse": 18,
      "text": "Truly you set them in slippery places; you make them fall to ruin."
    },
    {
      "verse": 19,
      "text": "How they are destroyed in a moment, swept away utterly by terrors!"
    },
    {
      "verse": 20,
      "text": "They are like a dream when one awakes; on awaking you despise their phantoms."
    },
    {
      "verse": 21,
      "text": "When my soul was embittered, when I was pricked in heart,"
    },
    {
      "verse": 22,
      "text": "I was stupid and ignorant; I was like a brute beast toward you."
    },
    {
      "verse": 23,
      "text": "Nevertheless I am continually with you; you hold my right hand."
    },
    {
      "verse": 24,
      "text": "You guide me with your counsel, and afterward you will receive me with honor."
    },
    {
      "verse": 25,
      "text": "Whom have I in heaven but you? And there is nothing on earth that I desire other than you."
    },
    {
      "verse": 26,
      "text": "My flesh and my heart may fail, but God is the strength of my heart and my portion forever."
    },
    {
      "verse": 27,
      "text": "Indeed, those who are far from you will perish; you put an end to those who are false to you."
    },
    {
      "verse": 28,
      "text": "But for me it is good to be near God; I have made the Lord God my refuge, to tell of all your works."
    }
  ],
  "timestamp": "2025-09-16T19:46:45.414929"
}