{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 41,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.41",
  "verses": [
    {
      "verse": 1,
      "text": "Happy are those who consider the poor; the Lord delivers them in the day of trouble."
    },
    {
      "verse": 2,
      "text": "The Lord protects them and keeps them alive; they are called happy in the land. You do not give them up to the will of their enemies."
    },
    {
      "verse": 3,
      "text": "The Lord sustains them on their sickbed; in their illness you heal all their infirmities."
    },
    {
      "verse": 4,
      "text": "As for me, I said, “O Lord, be gracious to me; heal me, for I have sinned against you.”"
    },
    {
      "verse": 5,
      "text": "My enemies wonder in malice when I will die, and my name perish."
    },
    {
      "verse": 6,
      "text": "And when they come to see me, they utter empty words, while their hearts gather mischief; when they go out, they tell it abroad."
    },
    {
      "verse": 7,
      "text": "All who hate me whisper together about me; they imagine the worst for me."
    },
    {
      "verse": 8,
      "text": "They think that a deadly thing has fastened on me, that I will not rise again from where I lie."
    },
    {
      "verse": 9,
      "text": "Even my bosom friend in whom I trusted, who ate of my bread, has lifted the heel against me."
    },
    {
      "verse": 10,
      "text": "But you, O Lord, be gracious to me, and raise me up, that I may repay them."
    },
    {
      "verse": 11,
      "text": "By this I know that you are pleased with me; because my enemy has not triumphed over me."
    },
    {
      "verse": 12,
      "text": "But you have upheld me because of my integrity, and set me in your presence forever."
    },
    {
      "verse": 13,
      "text": "Blessed be the Lord, the God of Israel, from everlasting to everlasting. Amen and Amen."
    }
  ],
  "timestamp": "2025-09-16T19:46:34.765860"
}