{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 31,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.31",
  "verses": [
    {
      "verse": 1,
      "text": "In you, O Lord, I seek refuge; do not let me ever be put to shame; in your righteousness deliver me."
    },
    {
      "verse": 2,
      "text": "Incline your ear to me; rescue me speedily. Be a rock of refuge for me, a strong fortress to save me."
    },
    {
      "verse": 3,
      "text": "You are indeed my rock and my fortress; for your name's sake lead me and guide me,"
    },
    {
      "verse": 4,
      "text": "take me out of the net that is hidden for me, for you are my refuge."
    },
    {
      "verse": 5,
      "text": "Into your hand I commit my spirit; you have redeemed me, O Lord, faithful God."
    },
    {
      "verse": 6,
      "text": "You hate those who pay regard to worthless idols, but I trust in the Lord."
    },
    {
      "verse": 7,
      "text": "I will exult and rejoice in your steadfast love, because you have seen my affliction; you have taken heed of my adversities,"
    },
    {
      "verse": 8,
      "text": "and have not delivered me into the hand of the enemy; you have set my feet in a broad place."
    },
    {
      "verse": 9,
      "text": "Be gracious to me, O Lord, for I am in distress; my eye wastes away from grief, my soul and body also."
    },
    {
      "verse": 10,
      "text": "For my life is spent with sorrow, and my years with sighing; my strength fails because of my misery, and my bones waste away."
    },
    {
      "verse": 11,
      "text": "I am the scorn of all my adversaries, a horror to my neighbors, an object of dread to my acquaintances; those who see me in the street flee from me."
    },
    {
      "verse": 12,
      "text": "I have passed out of mind like one who is dead; I have become like a broken vessel."
    },
    {
      "verse": 13,
      "text": "For I hear the whispering of many— terror all around!— as they scheme together against me, as they plot to take my life."
    },
    {
      "verse": 14,
      "text": "But I trust in you, O Lord; I say, “You are my God.”"
    },
    {
      "verse": 15,
      "text": "My times are in your hand; deliver me from the hand of my enemies and persecutors."
    },
    {
      "verse": 16,
      "text": "Let your face shine upon your servant; save me in your steadfast love."
    },
    {
      "verse": 17,
      "text": "Do not let me be put to shame, O Lord, for I call on you; let the wicked be put to shame; let them go dumbfounded to Sheol."
    },
    {
      "verse": 18,
      "text": "Let the lying lips be stilled that speak insolently against the righteous with pride and contempt."
    },
    {
      "verse": 19,
      "text": "O how abundant is your goodness that you have laid up for those who fear you, and accomplished for those who take refuge in you, in the sight of everyone!"
    },
    {
      "verse": 20,
      "text": "In the shelter of your presence you hide them from human plots; you hold them safe under your shelter from contentious tongues."
    },
    {
      "verse": 21,
      "text": "Blessed be the Lord, for he has wondrously shown his steadfast love to me when I was beset as a city under siege."
    },
    {
      "verse": 22,
      "text": "I had said in my alarm, “I am driven far from your sight.” But you heard my supplications when I cried out to you for help."
    },
    {
      "verse": 23,
      "text": "Love the Lord, all you his saints. The Lord preserves the faithful, but abundantly repays the one who acts haughtily."
    },
    {
      "verse": 24,
      "text": "Be strong, and let your heart take courage, all you who wait for the Lord."
    }
  ],
  "timestamp": "2025-09-16T19:46:30.699297"
}