{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 22,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/PSA.22",
  "verses": [
    {
      "verse": 1,
      "text": "My God, my God, why have you forsaken me? Why are you so far from helping me, from the words of my groaning?"
    },
    {
      "verse": 2,
      "text": "O my God, I cry by day, but you do not answer; and by night, but find no rest."
    },
    {
      "verse": 3,
      "text": "Yet you are holy, enthroned on the praises of Israel."
    },
    {
      "verse": 4,
      "text": "In you our ancestors trusted; they trusted, and you delivered them."
    },
    {
      "verse": 5,
      "text": "To you they cried, and were saved; in you they trusted, and were not put to shame."
    },
    {
      "verse": 6,
      "text": "But I am a worm, and not human; scorned by others, and despised by the people."
    },
    {
      "verse": 7,
      "text": "All who see me mock at me; they make mouths at me, they shake their heads;"
    },
    {
      "verse": 8,
      "text": "“Commit your cause to the Lord; let him deliver— let him rescue the one in whom he delights!”"
    },
    {
      "verse": 9,
      "text": "Yet it was you who took me from the womb; you kept me safe on my mother's breast."
    },
    {
      "verse": 10,
      "text": "On you I was cast from my birth, and since my mother bore me you have been my God."
    },
    {
      "verse": 11,
      "text": "Do not be far from me, for trouble is near and there is no one to help."
    },
    {
      "verse": 12,
      "text": "Many bulls encircle me, strong bulls of Bashan surround me;"
    },
    {
      "verse": 13,
      "text": "they open wide their mouths at me, like a ravening and roaring lion."
    },
    {
      "verse": 14,
      "text": "I am poured out like water, and all my bones are out of joint; my heart is like wax; it is melted within my breast;"
    },
    {
      "verse": 15,
      "text": "my mouth is dried up like a potsherd, and my tongue sticks to my jaws; you lay me in the dust of death."
    },
    {
      "verse": 16,
      "text": "For dogs are all around me; a company of evildoers encircles me. My hands and feet have shriveled;"
    },
    {
      "verse": 17,
      "text": "I can count all my bones. They stare and gloat over me;"
    },
    {
      "verse": 18,
      "text": "they divide my clothes among themselves, and for my clothing they cast lots."
    },
    {
      "verse": 19,
      "text": "But you, O Lord, do not be far away! O my help, come quickly to my aid!"
    },
    {
      "verse": 20,
      "text": "Deliver my soul from the sword, my life from the power of the dog!"
    },
    {
      "verse": 21,
      "text": "Save me from the mouth of the lion! From the horns of the wild oxen you have rescued me."
    },
    {
      "verse": 22,
      "text": "I will tell of your name to my brothers and sisters; in the midst of the congregation I will praise you:"
    },
    {
      "verse": 23,
      "text": "You who fear the Lord, praise him! All you offspring of Jacob, glorify him; stand in awe of him, all you offspring of Israel!"
    },
    {
      "verse": 24,
      "text": "For he did not despise or abhor the affliction of the afflicted; he did not hide his face from me, but heard when I cried to him."
    },
    {
      "verse": 25,
      "text": "From you comes my praise in the great congregation; my vows I will pay before those who fear him."
    },
    {
      "verse": 26,
      "text": "The poor shall eat and be satisfied; those who seek him shall praise the Lord. May your hearts live forever!"
    },
    {
      "verse": 27,
      "text": "All the ends of the earth shall remember and turn to the Lord; and all the families of the nations shall worship before him."
    },
    {
      "verse": 28,
      "text": "For dominion belongs to the Lord, and he rules over the nations."
    },
    {
      "verse": 29,
      "text": "To him, indeed, shall all who sleep in the earth bow down; before him shall bow all who go down to the dust, and I shall live for him."
    },
    {
      "verse": 30,
      "text": "Posterity will serve him; future generations will be told about the Lord,"
    },
    {
      "verse": 31,
      "text": "and proclaim his deliverance to a people yet unborn, saying that he has done it."
    }
  ],
  "timestamp": "2025-09-16T19:46:27.761697"
}