{
  "book": "REV",
  "book_name": "Revelation",
  "chapter": 18,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/REV.18",
  "verses": [
    {
      "verse": 1,
      "text": "After this I saw another angel coming down from heaven, having great authority; and the earth was made bright with his splendor."
    },
    {
      "verse": 2,
      "text": "He called out with a mighty voice, “Fallen, fallen is Babylon the great! It has become a dwelling place of demons, a haunt of every foul spirit, a haunt of every foul bird, a haunt of every foul and hateful beast."
    },
    {
      "verse": 3,
      "text": "For all the nations have drunk of the wine of the wrath of her fornication, and the kings of the earth have committed fornication with her, and the merchants of the earth have grown rich from the power of her luxury.”"
    },
    {
      "verse": 4,
      "text": "Then I heard another voice from heaven saying, “Come out of her, my people, so that you do not take part in her sins, in her plagues;"
    },
    {
      "verse": 5,
      "text": "for her sins are heaped high as heaven, and God has remembered her iniquities."
    },
    {
      "verse": 6,
      "text": "Render to her as she herself has rendered, and repay her double for her deeds; mix a double draught for her in the cup she mixed."
    },
    {
      "verse": 7,
      "text": "As she glorified herself and lived luxuriously, so give her a like measure of torment and grief. Since in her heart she says, ‘I rule as a queen; I am no widow, and I will never see grief,’"
    },
    {
      "verse": 8,
      "text": "therefore her plagues will come in a single day— pestilence and mourning and famine— and she will be burned with fire; for mighty is the Lord God who judges her.”"
    },
    {
      "verse": 9,
      "text": "And the kings of the earth, who committed fornication and lived in luxury with her, will weep and wail over her when they see the smoke of her burning;"
    },
    {
      "verse": 10,
      "text": "they will stand far off, in fear of her torment, and say, “Alas, alas, the great city, Babylon, the mighty city! For in one hour your judgment has come.”"
    },
    {
      "verse": 11,
      "text": "And the merchants of the earth weep and mourn for her, since no one buys their cargo anymore,"
    },
    {
      "verse": 12,
      "text": "cargo of gold, silver, jewels and pearls, fine linen, purple, silk and scarlet, all kinds of scented wood, all articles of ivory, all articles of costly wood, bronze, iron, and marble,"
    },
    {
      "verse": 13,
      "text": "cinnamon, spice, incense, myrrh, frankincense, wine, olive oil, choice flour and wheat, cattle and sheep, horses and chariots, slaves—and human lives."
    },
    {
      "verse": 14,
      "text": "“The fruit for which your soul longed has gone from you, and all your dainties and your splendor are lost to you, never to be found again!”"
    },
    {
      "verse": 15,
      "text": "The merchants of these wares, who gained wealth from her, will stand far off, in fear of her torment, weeping and mourning aloud,"
    },
    {
      "verse": 16,
      "text": "“Alas, alas, the great city, clothed in fine linen, in purple and scarlet, adorned with gold, with jewels, and with pearls!"
    },
    {
      "verse": 17,
      "text": "For in one hour all this wealth has been laid waste!” And all shipmasters and seafarers, sailors and all whose trade is on the sea, stood far off"
    },
    {
      "verse": 18,
      "text": "and cried out as they saw the smoke of her burning, “What city was like the great city?”"
    },
    {
      "verse": 19,
      "text": "And they threw dust on their heads, as they wept and mourned, crying out, “Alas, alas, the great city, where all who had ships at sea grew rich by her wealth! For in one hour she has been laid waste."
    },
    {
      "verse": 20,
      "text": "Rejoice over her, O heaven, you saints and apostles and prophets! For God has given judgment for you against her.”"
    },
    {
      "verse": 21,
      "text": "Then a mighty angel took up a stone like a great millstone and threw it into the sea, saying, “With such violence Babylon the great city will be thrown down, and will be found no more;"
    },
    {
      "verse": 22,
      "text": "and the sound of harpists and minstrels and of flutists and trumpeters will be heard in you no more; and an artisan of any trade will be found in you no more; and the sound of the millstone will be heard in you no more;"
    },
    {
      "verse": 23,
      "text": "and the light of a lamp will shine in you no more; and the voice of bridegroom and bride will be heard in you no more; for your merchants were the magnates of the earth, and all nations were deceived by your sorcery."
    },
    {
      "verse": 24,
      "text": "And in you was found the blood of prophets and of saints, and of all who have been slaughtered on earth.”"
    }
  ],
  "timestamp": "2025-09-16T19:51:19.404280"
}