{
  "book": "REV",
  "book_name": "Revelation",
  "chapter": 20,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/REV.20",
  "verses": [
    {
      "verse": 1,
      "text": "Then I saw an angel coming down from heaven, holding in his hand the key to the bottomless pit and a great chain."
    },
    {
      "verse": 2,
      "text": "He seized the dragon, that ancient serpent, who is the Devil and Satan, and bound him for a thousand years,"
    },
    {
      "verse": 3,
      "text": "and threw him into the pit, and locked and sealed it over him, so that he would deceive the nations no more, until the thousand years were ended. After that he must be let out for a little while."
    },
    {
      "verse": 4,
      "text": "Then I saw thrones, and those seated on them were given authority to judge. I also saw the souls of those who had been beheaded for their testimony to Jesus and for the word of God. They had not worshiped the beast or its image and had not received its mark on their foreheads or their hands. They came to life and reigned with Christ a thousand years."
    },
    {
      "verse": 5,
      "text": "(The rest of the dead did not come to life until the thousand years were ended.) This is the first resurrection."
    },
    {
      "verse": 7,
      "text": "When the thousand years are ended, Satan will be released from his prison"
    },
    {
      "verse": 8,
      "text": "and will come out to deceive the nations at the four corners of the earth, Gog and Magog, in order to gather them for battle; they are as numerous as the sands of the sea."
    },
    {
      "verse": 9,
      "text": "They marched up over the breadth of the earth and surrounded the camp of the saints and the beloved city. And fire came down from heaven and consumed them."
    },
    {
      "verse": 10,
      "text": "And the devil who had deceived them was thrown into the lake of fire and sulfur, where the beast and the false prophet were, and they will be tormented day and night forever and ever."
    },
    {
      "verse": 11,
      "text": "Then I saw a great white throne and the one who sat on it; the earth and the heaven fled from his presence, and no place was found for them."
    },
    {
      "verse": 12,
      "text": "And I saw the dead, great and small, standing before the throne, and books were opened. Also another book was opened, the book of life. And the dead were judged according to their works, as recorded in the books."
    },
    {
      "verse": 13,
      "text": "And the sea gave up the dead that were in it, Death and Hades gave up the dead that were in them, and all were judged according to what they had done."
    },
    {
      "verse": 14,
      "text": "Then Death and Hades were thrown into the lake of fire. This is the second death, the lake of fire;"
    },
    {
      "verse": 15,
      "text": "and anyone whose name was not found written in the book of life was thrown into the lake of fire."
    }
  ],
  "timestamp": "2025-09-16T19:51:20.007473"
}