{
  "book": "ROM",
  "book_name": "Romans",
  "chapter": 2,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/ROM.2",
  "verses": [
    {
      "verse": 1,
      "text": "Therefore you have no excuse, whoever you are, when you judge others; for in passing judgment on another you condemn yourself, because you, the judge, are doing the very same things."
    },
    {
      "verse": 2,
      "text": "You say, “We know that God's judgment on those who do such things is in accordance with truth.”"
    },
    {
      "verse": 3,
      "text": "Do you imagine, whoever you are, that when you judge those who do such things and yet do them yourself, you will escape the judgment of God?"
    },
    {
      "verse": 4,
      "text": "Or do you despise the riches of his kindness and forbearance and patience? Do you not realize that God's kindness is meant to lead you to repentance?"
    },
    {
      "verse": 5,
      "text": "But by your hard and impenitent heart you are storing up wrath for yourself on the day of wrath, when God's righteous judgment will be revealed."
    },
    {
      "verse": 6,
      "text": "For he will repay according to each one's deeds:"
    },
    {
      "verse": 7,
      "text": "to those who by patiently doing good seek for glory and honor and immortality, he will give eternal life;"
    },
    {
      "verse": 8,
      "text": "while for those who are self-seeking and who obey not the truth but wickedness, there will be wrath and fury."
    },
    {
      "verse": 9,
      "text": "There will be anguish and distress for everyone who does evil, the Jew first and also the Greek,"
    },
    {
      "verse": 10,
      "text": "but glory and honor and peace for everyone who does good, the Jew first and also the Greek."
    },
    {
      "verse": 11,
      "text": "For God shows no partiality."
    },
    {
      "verse": 12,
      "text": "All who have sinned apart from the law will also perish apart from the law, and all who have sinned under the law will be judged by the law."
    },
    {
      "verse": 13,
      "text": "For it is not the hearers of the law who are righteous in God's sight, but the doers of the law who will be justified."
    },
    {
      "verse": 14,
      "text": "When Gentiles, who do not possess the law, do instinctively what the law requires, these, though not having the law, are a law to themselves."
    },
    {
      "verse": 15,
      "text": "They show that what the law requires is written on their hearts, to which their own conscience also bears witness; and their conflicting thoughts will accuse or perhaps excuse them"
    },
    {
      "verse": 16,
      "text": "on the day when, according to my gospel, God, through Jesus Christ, will judge the secret thoughts of all."
    },
    {
      "verse": 17,
      "text": "But if you call yourself a Jew and rely on the law and boast of your relation to God"
    },
    {
      "verse": 18,
      "text": "and know his will and determine what is best because you are instructed in the law,"
    },
    {
      "verse": 19,
      "text": "and if you are sure that you are a guide to the blind, a light to those who are in darkness,"
    },
    {
      "verse": 20,
      "text": "a corrector of the foolish, a teacher of children, having in the law the embodiment of knowledge and truth,"
    },
    {
      "verse": 21,
      "text": "you, then, that teach others, will you not teach yourself? While you preach against stealing, do you steal?"
    },
    {
      "verse": 22,
      "text": "You that forbid adultery, do you commit adultery? You that abhor idols, do you rob temples?"
    },
    {
      "verse": 23,
      "text": "You that boast in the law, do you dishonor God by breaking the law?"
    },
    {
      "verse": 24,
      "text": "For, as it is written, “The name of God is blasphemed among the Gentiles because of you.”"
    },
    {
      "verse": 25,
      "text": "Circumcision indeed is of value if you obey the law; but if you break the law, your circumcision has become uncircumcision."
    },
    {
      "verse": 26,
      "text": "So, if those who are uncircumcised keep the requirements of the law, will not their uncircumcision be regarded as circumcision?"
    },
    {
      "verse": 27,
      "text": "Then those who are physically uncircumcised but keep the law will condemn you that have the written code and circumcision but break the law."
    },
    {
      "verse": 28,
      "text": "For a person is not a Jew who is one outwardly, nor is true circumcision something external and physical."
    },
    {
      "verse": 29,
      "text": "Rather, a person is a Jew who is one inwardly, and real circumcision is a matter of the heart—it is spiritual and not literal. Such a person receives praise not from others but from God."
    }
  ],
  "timestamp": "2025-09-16T19:50:07.406042"
}