{
  "book": "RUT",
  "book_name": "Ruth",
  "chapter": 2,
  "version_id": 2016,
  "url": "https://www.bible.com/bible/2016/RUT.2",
  "verses": [
    {
      "verse": 1,
      "text": "Now Naomi had a kinsman on her husband's side, a prominent rich man, of the family of Elimelech, whose name was Boaz."
    },
    {
      "verse": 2,
      "text": "And Ruth the Moabite said to Naomi, “Let me go to the field and glean among the ears of grain, behind someone in whose sight I may find favor.” She said to her, “Go, my daughter.”"
    },
    {
      "verse": 3,
      "text": "So she went. She came and gleaned in the field behind the reapers. As it happened, she came to the part of the field belonging to Boaz, who was of the family of Elimelech."
    },
    {
      "verse": 4,
      "text": "Just then Boaz came from Bethlehem. He said to the reapers, “The Lord be with you.” They answered, “The Lord bless you.”"
    },
    {
      "verse": 5,
      "text": "Then Boaz said to his servant who was in charge of the reapers, “To whom does this young woman belong?”"
    },
    {
      "verse": 6,
      "text": "The servant who was in charge of the reapers answered, “She is the Moabite who came back with Naomi from the country of Moab."
    },
    {
      "verse": 7,
      "text": "She said, ‘Please, let me glean and gather among the sheaves behind the reapers.’ So she came, and she has been on her feet from early this morning until now, without resting even for a moment.”"
    },
    {
      "verse": 8,
      "text": "Then Boaz said to Ruth, “Now listen, my daughter, do not go to glean in another field or leave this one, but keep close to my young women."
    },
    {
      "verse": 9,
      "text": "Keep your eyes on the field that is being reaped, and follow behind them. I have ordered the young men not to bother you. If you get thirsty, go to the vessels and drink from what the young men have drawn.”"
    },
    {
      "verse": 10,
      "text": "Then she fell prostrate, with her face to the ground, and said to him, “Why have I found favor in your sight, that you should take notice of me, when I am a foreigner?”"
    },
    {
      "verse": 11,
      "text": "But Boaz answered her, “All that you have done for your mother-in-law since the death of your husband has been fully told me, and how you left your father and mother and your native land and came to a people that you did not know before."
    },
    {
      "verse": 12,
      "text": "May the Lord reward you for your deeds, and may you have a full reward from the Lord, the God of Israel, under whose wings you have come for refuge!”"
    },
    {
      "verse": 13,
      "text": "Then she said, “May I continue to find favor in your sight, my lord, for you have comforted me and spoken kindly to your servant, even though I am not one of your servants.”"
    },
    {
      "verse": 14,
      "text": "At mealtime Boaz said to her, “Come here, and eat some of this bread, and dip your morsel in the sour wine.” So she sat beside the reapers, and he heaped up for her some parched grain. She ate until she was satisfied, and she had some left over."
    },
    {
      "verse": 15,
      "text": "When she got up to glean, Boaz instructed his young men, “Let her glean even among the standing sheaves, and do not reproach her."
    },
    {
      "verse": 16,
      "text": "You must also pull out some handfuls for her from the bundles, and leave them for her to glean, and do not rebuke her.”"
    },
    {
      "verse": 17,
      "text": "So she gleaned in the field until evening. Then she beat out what she had gleaned, and it was about an ephah of barley."
    },
    {
      "verse": 18,
      "text": "She picked it up and came into the town, and her mother-in-law saw how much she had gleaned. Then she took out and gave her what was left over after she herself had been satisfied."
    },
    {
      "verse": 19,
      "text": "Her mother-in-law said to her, “Where did you glean today? And where have you worked? Blessed be the man who took notice of you.” So she told her mother-in-law with whom she had worked, and said, “The name of the man with whom I worked today is Boaz.”"
    },
    {
      "verse": 20,
      "text": "Then Naomi said to her daughter-in-law, “Blessed be he by the Lord, whose kindness has not forsaken the living or the dead!” Naomi also said to her, “The man is a relative of ours, one of our nearest kin.”"
    },
    {
      "verse": 21,
      "text": "Then Ruth the Moabite said, “He even said to me, ‘Stay close by my servants, until they have finished all my harvest.’ ”"
    },
    {
      "verse": 22,
      "text": "Naomi said to Ruth, her daughter-in-law, “It is better, my daughter, that you go out with his young women, otherwise you might be bothered in another field.”"
    },
    {
      "verse": 23,
      "text": "So she stayed close to the young women of Boaz, gleaning until the end of the barley and wheat harvests; and she lived with her mother-in-law."
    }
  ],
  "timestamp": "2025-09-16T19:44:40.659200"
}