{
  "book": "1CH",
  "book_name": "1 Chronicles",
  "chapter": 1,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1CH.1",
  "verses": [
    {
      "verse": 1,
      "text": "Adam, Seth, Enosh;"
    },
    {
      "verse": 2,
      "text": "Kenan, Mahalalel, Jared;"
    },
    {
      "verse": 3,
      "text": "Enoch, Methuselah, Lamech;"
    },
    {
      "verse": 4,
      "text": "Noah, Shem, Ham, and Japheth."
    },
    {
      "verse": 5,
      "text": "The descendants of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras."
    },
    {
      "verse": 6,
      "text": "The descendants of Gomer: Ashkenaz, Diphath, and Togarmah."
    },
    {
      "verse": 7,
      "text": "The descendants of Javan: Elishah, Tarshish, Kittim, and Rodanim."
    },
    {
      "verse": 8,
      "text": "The descendants of Ham: Cush and Egypt, Put, and Canaan."
    },
    {
      "verse": 9,
      "text": "The descendants of Cush: Seba, Havilah, Sabta, Raama, and Sabteca. The descendants of Raama: Sheba and Dedan."
    },
    {
      "verse": 10,
      "text": "Cush became the father of Nimrod; he was the first to be a mighty one on the earth."
    },
    {
      "verse": 11,
      "text": "Egypt became the father of Ludim, Anamim, Lehabim, Naphtuhim,"
    },
    {
      "verse": 12,
      "text": "Pathrusim, Casluhim, and Caphtorim, from whom the Philistines come."
    },
    {
      "verse": 13,
      "text": "Canaan became the father of Sidon his firstborn, and Heth,"
    },
    {
      "verse": 14,
      "text": "and the Jebusites, the Amorites, the Girgashites,"
    },
    {
      "verse": 15,
      "text": "the Hivites, the Arkites, the Sinites,"
    },
    {
      "verse": 16,
      "text": "the Arvadites, the Zemarites, and the Hamathites."
    },
    {
      "verse": 17,
      "text": "The descendants of Shem: Elam, Asshur, Arpachshad, Lud, and Aram. The sons of Aram: Uz, Hul, Gether, and Meshech."
    },
    {
      "verse": 18,
      "text": "Arpachshad became the father of Shelah, and Shelah became the father of Eber."
    },
    {
      "verse": 19,
      "text": "To Eber were born two sons: the name of the one was Peleg (for in his days the earth was divided), and the name of his brother was Joktan."
    },
    {
      "verse": 20,
      "text": "Joktan became the father of Almodad, Sheleph, Hazarmaveth, Jerah,"
    },
    {
      "verse": 21,
      "text": "Hadoram, Uzal, Diklah,"
    },
    {
      "verse": 22,
      "text": "Ebal, Abimael, Sheba,"
    },
    {
      "verse": 23,
      "text": "Ophir, Havilah, and Jobab; all these were the descendants of Joktan."
    },
    {
      "verse": 24,
      "text": "Shem, Arpachshad, Shelah;"
    },
    {
      "verse": 25,
      "text": "Eber, Peleg, Reu;"
    },
    {
      "verse": 26,
      "text": "Serug, Nahor, Terah;"
    },
    {
      "verse": 27,
      "text": "Abram, that is, Abraham."
    },
    {
      "verse": 28,
      "text": "The sons of Abraham: Isaac and Ishmael."
    },
    {
      "verse": 29,
      "text": "These are their genealogies: the firstborn of Ishmael was Nebaioth, then Kedar, Adbeel, Mibsam,"
    },
    {
      "verse": 30,
      "text": "Mishma, Dumah, Massa, Hadad, Tema,"
    },
    {
      "verse": 31,
      "text": "Jetur, Naphish, and Kedemah. These are the sons of Ishmael."
    },
    {
      "verse": 32,
      "text": "The sons of Keturah, Abraham’s concubine: she bore Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan."
    },
    {
      "verse": 33,
      "text": "The sons of Midian: Ephah, Epher, Hanoch, Abida, and Eldaah. All these were the descendants of Keturah."
    },
    {
      "verse": 34,
      "text": "Abraham became the father of Isaac. The sons of Isaac: Esau and Israel."
    },
    {
      "verse": 35,
      "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah."
    },
    {
      "verse": 36,
      "text": "The sons of Eliphaz: Teman, Omar, Zephi, Gatam, Kenaz, Timna, and Amalek."
    },
    {
      "verse": 37,
      "text": "The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
    },
    {
      "verse": 38,
      "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan."
    },
    {
      "verse": 39,
      "text": "The sons of Lotan: Hori and Homam; and Lotan’s sister was Timna."
    },
    {
      "verse": 40,
      "text": "The sons of Shobal: Alian, Manahath, Ebal, Shephi, and Onam. The sons of Zibeon: Aiah and Anah."
    },
    {
      "verse": 41,
      "text": "The son of Anah: Dishon. The sons of Dishon: Hamran, Eshban, Ithran, and Cheran."
    },
    {
      "verse": 42,
      "text": "The sons of Ezer: Bilhan, Zaavan, and Jaakan. The sons of Dishan: Uz and Aran."
    },
    {
      "verse": 43,
      "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor, whose city was called Dinhabah."
    },
    {
      "verse": 44,
      "text": "When Bela died, Jobab son of Zerah of Bozrah succeeded him."
    },
    {
      "verse": 45,
      "text": "When Jobab died, Husham of the land of the Temanites succeeded him."
    },
    {
      "verse": 46,
      "text": "When Husham died, Hadad son of Bedad, who defeated Midian in the country of Moab, succeeded him, and the name of his city was Avith."
    },
    {
      "verse": 47,
      "text": "When Hadad died, Samlah of Masrekah succeeded him."
    },
    {
      "verse": 48,
      "text": "When Samlah died, Shaul of Rehoboth on the River succeeded him."
    },
    {
      "verse": 49,
      "text": "When Shaul died, Baal-hanan son of Achbor succeeded him."
    },
    {
      "verse": 50,
      "text": "When Baal-hanan died, Hadad succeeded him; the name of his city was Pai, and his wife’s name was Mehetabel daughter of Matred daughter of Me-zahab."
    },
    {
      "verse": 51,
      "text": "And Hadad died. The clans of Edom were: clans Timna, Aliah, Jetheth,"
    },
    {
      "verse": 52,
      "text": "Oholibamah, Elah, Pinon,"
    },
    {
      "verse": 53,
      "text": "Kenaz, Teman, Mibzar,"
    },
    {
      "verse": 54,
      "text": "Magdiel, and Iram; these are the clans of Edom."
    }
  ],
  "timestamp": "2025-08-08T15:49:15.485154"
}