{
  "book": "1CO",
  "book_name": "1 Corinthians",
  "chapter": 16,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1CO.16",
  "verses": [
    {
      "verse": 1,
      "text": "Now concerning the collection for the saints: you should follow the directions I gave to the churches of Galatia."
    },
    {
      "verse": 2,
      "text": "On the first day of every week, each of you is to put aside and save whatever extra you earn, so that collections need not be taken when I come."
    },
    {
      "verse": 3,
      "text": "And when I arrive, I will send any whom you approve with letters to take your gift to Jerusalem."
    },
    {
      "verse": 4,
      "text": "If it seems advisable that I should go also, they will accompany me."
    },
    {
      "verse": 5,
      "text": "I will visit you after passing through Macedonia—for I intend to pass through Macedonia—"
    },
    {
      "verse": 6,
      "text": "and perhaps I will stay with you or even spend the winter, so that you may send me on my way, wherever I go."
    },
    {
      "verse": 7,
      "text": "I do not want to see you now just in passing, for I hope to spend some time with you, if the Lord permits."
    },
    {
      "verse": 8,
      "text": "But I will stay in Ephesus until Pentecost,"
    },
    {
      "verse": 9,
      "text": "for a wide door for effective work has opened to me, and there are many adversaries."
    },
    {
      "verse": 10,
      "text": "If Timothy comes, see that he has nothing to fear among you, for he is doing the work of the Lord just as I am;"
    },
    {
      "verse": 11,
      "text": "therefore let no one despise him. Send him on his way in peace, so that he may come to me, for I am expecting him with the brothers and sisters."
    },
    {
      "verse": 12,
      "text": "Now concerning our brother Apollos, I strongly urged him to visit you with the other brothers and sisters, but he was not at all willing to come now. He will come when he has the opportunity."
    },
    {
      "verse": 13,
      "text": "Keep alert; stand firm in the faith; be courageous; be strong."
    },
    {
      "verse": 14,
      "text": "Let all that you do be done in love."
    },
    {
      "verse": 15,
      "text": "Now, brothers and sisters, you know that members of the household of Stephanas were the first fruits in Achaia, and they have devoted themselves to the service of the saints;"
    },
    {
      "verse": 16,
      "text": "I urge you to put yourselves at the service of such people and of everyone who works and toils with them."
    },
    {
      "verse": 17,
      "text": "I rejoice at the coming of Stephanas and Fortunatus and Achaicus, because they have made up for your absence,"
    },
    {
      "verse": 18,
      "text": "for they refreshed my spirit as well as yours. So give recognition to such persons."
    },
    {
      "verse": 19,
      "text": "The churches of Asia send greetings. Aquila and Prisca, together with the church in their house, greet you warmly in the Lord."
    },
    {
      "verse": 20,
      "text": "All the brothers and sisters send greetings. Greet one another with a holy kiss."
    },
    {
      "verse": 21,
      "text": "I, Paul, write this greeting with my own hand."
    },
    {
      "verse": 22,
      "text": "Let anyone be accursed who has no love for the Lord. Our Lord, come!"
    },
    {
      "verse": 23,
      "text": "The grace of the Lord Jesus be with you."
    },
    {
      "verse": 24,
      "text": "My love be with all of you in Christ Jesus."
    }
  ],
  "timestamp": "2025-08-08T15:51:56.221603"
}