{
  "book": "1CO",
  "book_name": "1 Corinthians",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1CO.3",
  "verses": [
    {
      "verse": 1,
      "text": "And so, brothers and sisters, I could not speak to you as spiritual people but rather as fleshly, as infants in Christ."
    },
    {
      "verse": 2,
      "text": "I fed you with milk, not solid food, for you were not ready for solid food. Even now you are still not ready,"
    },
    {
      "verse": 3,
      "text": "for you are still fleshly. For as long as there is jealousy and quarreling among you, are you not fleshly and behaving according to human inclinations?"
    },
    {
      "verse": 4,
      "text": "For when one says, “I belong to Paul,” and another, “I belong to Apollos,” are you not all too human?"
    },
    {
      "verse": 5,
      "text": "What then is Apollos? What is Paul? Servants through whom you came to believe, as the Lord assigned to each."
    },
    {
      "verse": 6,
      "text": "I planted, Apollos watered, but God gave the growth."
    },
    {
      "verse": 7,
      "text": "So neither the one who plants nor the one who waters is anything, but only God who gives the growth."
    },
    {
      "verse": 8,
      "text": "The one who plants and the one who waters have one purpose, and each will receive wages according to their own labor."
    },
    {
      "verse": 9,
      "text": "For we are God’s coworkers, working together; you are God’s field, God’s building."
    },
    {
      "verse": 10,
      "text": "According to the grace of God given to me, like a wise master builder I laid a foundation, and someone else is building on it. Let each builder choose with care how to build on it."
    },
    {
      "verse": 11,
      "text": "For no one can lay any foundation other than the one that has been laid; that foundation is Jesus Christ."
    },
    {
      "verse": 12,
      "text": "Now if anyone builds on the foundation with gold, silver, precious stones, wood, hay, straw—"
    },
    {
      "verse": 13,
      "text": "the work of each builder will become visible, for the day will disclose it, because it will be revealed with fire, and the fire will test what sort of work each has done."
    },
    {
      "verse": 14,
      "text": "If the work that someone has built on the foundation survives, the builder will receive a wage."
    },
    {
      "verse": 15,
      "text": "If the work is burned up, the builder will suffer loss; the builder will be saved, but only as through fire."
    },
    {
      "verse": 16,
      "text": "Do you not know that you are God’s temple and that God’s Spirit dwells in you?"
    },
    {
      "verse": 17,
      "text": "If anyone destroys God’s temple, God will destroy that person. For God’s temple is holy, and you are that temple."
    },
    {
      "verse": 18,
      "text": "Do not deceive yourselves. If you think that you are wise in this age, you should become fools so that you may become wise."
    },
    {
      "verse": 19,
      "text": "For the wisdom of this world is foolishness with God. For it is written, “He catches the wise in their craftiness,”"
    },
    {
      "verse": 20,
      "text": "and again, “The Lord knows the thoughts of the wise, that they are futile.”"
    },
    {
      "verse": 21,
      "text": "So let no one boast about people. For all things are yours,"
    },
    {
      "verse": 22,
      "text": "whether Paul or Apollos or Cephas or the world or life or death or the present or the future—all are yours,"
    },
    {
      "verse": 23,
      "text": "and you are Christ’s, and Christ is God’s."
    }
  ],
  "timestamp": "2025-08-08T15:51:54.141325"
}