{
  "book": "1CO",
  "book_name": "1 Corinthians",
  "chapter": 13,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1CO.13",
  "verses": [
    {
      "verse": 1,
      "text": "If I speak in the tongues of humans and of angels but do not have love, I am a noisy gong or a clanging cymbal."
    },
    {
      "verse": 2,
      "text": "And if I have prophetic powers and understand all mysteries and all knowledge and if I have all faith so as to remove mountains but do not have love, I am nothing."
    },
    {
      "verse": 3,
      "text": "If I give away all my possessions and if I hand over my body so that I may boast but do not have love, I gain nothing."
    },
    {
      "verse": 4,
      "text": "Love is patient; love is kind; love is not envious or boastful or arrogant"
    },
    {
      "verse": 5,
      "text": "or rude. It does not insist on its own way; it is not irritable; it keeps no record of wrongs;"
    },
    {
      "verse": 6,
      "text": "it does not rejoice in wrongdoing but rejoices in the truth."
    },
    {
      "verse": 7,
      "text": "It bears all things, believes all things, hopes all things, endures all things."
    },
    {
      "verse": 8,
      "text": "Love never ends. But as for prophecies, they will come to an end; as for tongues, they will cease; as for knowledge, it will come to an end."
    },
    {
      "verse": 9,
      "text": "For we know only in part, and we prophesy only in part,"
    },
    {
      "verse": 10,
      "text": "but when the complete comes, the partial will come to an end."
    },
    {
      "verse": 11,
      "text": "When I was a child, I spoke like a child, I thought like a child, I reasoned like a child. When I became an adult, I put an end to childish ways."
    },
    {
      "verse": 12,
      "text": "For now we see only a reflection, as in a mirror, but then we will see face to face. Now I know only in part; then I will know fully, even as I have been fully known."
    },
    {
      "verse": 13,
      "text": "And now faith, hope, and love remain, these three, and the greatest of these is love."
    }
  ],
  "timestamp": "2025-08-08T15:51:55.884499"
}