{
  "book": "1CO",
  "book_name": "1 Corinthians",
  "chapter": 9,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1CO.9",
  "verses": [
    {
      "verse": 1,
      "text": "Am I not free? Am I not an apostle? Have I not seen Jesus our Lord? Are you not my work in the Lord?"
    },
    {
      "verse": 2,
      "text": "If I am not an apostle to others, at least I am to you, for you are the seal of my apostleship in the Lord."
    },
    {
      "verse": 3,
      "text": "This is my defense to those who would examine me."
    },
    {
      "verse": 4,
      "text": "Do we not have the right to our food and drink?"
    },
    {
      "verse": 5,
      "text": "Do we not have the right to be accompanied by a believing wife, as do the other apostles and the brothers of the Lord and Cephas?"
    },
    {
      "verse": 6,
      "text": "Or is it only Barnabas and I who have no right to refrain from working for a living?"
    },
    {
      "verse": 7,
      "text": "Who at any time pays the expenses for doing military service? Who plants a vineyard and does not eat any of its fruit? Or who tends a flock and does not get any of its milk?"
    },
    {
      "verse": 8,
      "text": "Do I say this on human authority? Does not the law also say the same?"
    },
    {
      "verse": 9,
      "text": "For it is written in the law of Moses, “You shall not muzzle an ox while it is treading out the grain.” Is it for oxen that God is concerned?"
    },
    {
      "verse": 11,
      "text": "If we have sown spiritual things among you, is it too much if we harvest material things?"
    },
    {
      "verse": 12,
      "text": "Nevertheless, we have not made use of this right, but we endure anything rather than put an obstacle in the way of the gospel of Christ."
    },
    {
      "verse": 14,
      "text": "In the same way, the Lord commanded that those who proclaim the gospel should get their living by the gospel."
    },
    {
      "verse": 15,
      "text": "But I have made no use of any of these rights, nor am I writing this so that they may be applied in my case. Indeed, I would rather die than that—no one will deprive me of my ground for boasting!"
    },
    {
      "verse": 16,
      "text": "If I proclaim the gospel, this gives me no ground for boasting, for an obligation is laid on me, and woe to me if I do not proclaim the gospel!"
    },
    {
      "verse": 17,
      "text": "For if I do this of my own will, I have a wage, but if not of my own will, I am entrusted with a commission."
    },
    {
      "verse": 18,
      "text": "What then is my wage? Just this: that in my proclamation I may make the gospel free of charge, so as not to make full use of my rights in the gospel."
    },
    {
      "verse": 19,
      "text": "For though I am free with respect to all, I have made myself a slave to all, so that I might gain all the more."
    },
    {
      "verse": 20,
      "text": "To the Jews I became as a Jew, in order to gain Jews. To those under the law I became as one under the law (though I myself am not under the law) so that I might gain those under the law."
    },
    {
      "verse": 21,
      "text": "To those outside the law I became as one outside the law (though I am not outside God’s law but am within Christ’s law) so that I might gain those outside the law."
    },
    {
      "verse": 22,
      "text": "To the weak I became weak, so that I might gain the weak. I have become all things to all people, that I might by all means save some."
    },
    {
      "verse": 23,
      "text": "I do it all for the sake of the gospel, so that I might become a partner in it."
    },
    {
      "verse": 24,
      "text": "Do you not know that in a race the runners all compete, but only one receives the prize? Run in such a way that you may win it."
    },
    {
      "verse": 25,
      "text": "Athletes exercise self-control in all things; they do it to receive a perishable wreath, but we an imperishable one."
    },
    {
      "verse": 26,
      "text": "So I do not run aimlessly, nor do I box as though beating the air,"
    },
    {
      "verse": 27,
      "text": "but I punish my body and enslave it, so that after proclaiming to others I myself should not be disqualified."
    }
  ],
  "timestamp": "2025-08-08T15:51:55.278157"
}