{
  "book": "1JN",
  "book_name": "1 John",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1JN.3",
  "verses": [
    {
      "verse": 1,
      "text": "See what love the Father has given us, that we should be called children of God, and that is what we are. The reason the world does not know us is that it did not know him."
    },
    {
      "verse": 2,
      "text": "Beloved, we are God’s children now; what we will be has not yet been revealed. What we do know is this: when he is revealed, we will be like him, for we will see him as he is."
    },
    {
      "verse": 3,
      "text": "And all who have this hope in him purify themselves, just as he is pure."
    },
    {
      "verse": 4,
      "text": "Everyone who commits sin is guilty of lawlessness; sin is lawlessness."
    },
    {
      "verse": 5,
      "text": "You know that he was revealed to take away sins, and in him there is no sin."
    },
    {
      "verse": 6,
      "text": "No one who abides in him sins; no one who sins has either seen him or known him."
    },
    {
      "verse": 7,
      "text": "Little children, let no one deceive you. Everyone who does what is right is righteous, just as he is righteous."
    },
    {
      "verse": 8,
      "text": "Everyone who commits sin is of the devil, for the devil has been sinning from the beginning. The Son of God was revealed for this purpose: to destroy the works of the devil."
    },
    {
      "verse": 9,
      "text": "Those who have been born of God do not sin because God’s seed abides in them; they cannot sin because they have been born of God."
    },
    {
      "verse": 10,
      "text": "The children of God and the children of the devil are revealed in this way: all who do not do what is right are not from God, nor are those who do not love a brother or sister."
    },
    {
      "verse": 11,
      "text": "For this is the message you have heard from the beginning, that we should love one another."
    },
    {
      "verse": 12,
      "text": "We must not be like Cain, who was from the evil one and murdered his brother. And why did he murder him? Because his own deeds were evil and his brother’s righteous."
    },
    {
      "verse": 13,
      "text": "Do not be astonished, brothers and sisters, that the world hates you."
    },
    {
      "verse": 14,
      "text": "We know that we have passed from death to life because we love the brothers and sisters. Whoever does not love abides in death."
    },
    {
      "verse": 15,
      "text": "All who hate a brother or sister are murderers, and you know that murderers do not have eternal life abiding in them."
    },
    {
      "verse": 16,
      "text": "We know love by this, that he laid down his life for us—and we ought to lay down our lives for the brothers and sisters."
    },
    {
      "verse": 17,
      "text": "How does God’s love abide in anyone who has the world’s goods and sees a brother or sister in need and yet refuses help?"
    },
    {
      "verse": 18,
      "text": "Little children, let us love not in word or speech but in deed and truth."
    },
    {
      "verse": 19,
      "text": "And by this we will know that we are from the truth and will reassure our hearts before him"
    },
    {
      "verse": 20,
      "text": "whenever our hearts condemn us, for God is greater than our hearts, and he knows everything."
    },
    {
      "verse": 21,
      "text": "Beloved, if our hearts do not condemn us, we have boldness before God,"
    },
    {
      "verse": 22,
      "text": "and we receive from him whatever we ask, because we obey his commandments and do what pleases him."
    },
    {
      "verse": 23,
      "text": "And this is his commandment, that we should believe in the name of his Son Jesus Christ and love one another, just as he has commanded us."
    },
    {
      "verse": 24,
      "text": "All who obey his commandments abide in him, and he abides in them. And by this we know that he abides in us, by the Spirit that he has given us."
    }
  ],
  "timestamp": "2025-08-08T15:52:31.628094"
}