{
  "book": "1SA",
  "book_name": "1 Samuel",
  "chapter": 17,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1SA.17",
  "verses": [
    {
      "verse": 1,
      "text": "Now the Philistines gathered their armies for battle; they were gathered at Socoh, which belongs to Judah, and encamped between Socoh and Azekah, in Ephes-dammim."
    },
    {
      "verse": 2,
      "text": "Saul and the Israelites gathered and encamped in the valley of Elah and formed ranks against the Philistines."
    },
    {
      "verse": 3,
      "text": "The Philistines stood on the mountain on the one side, and Israel stood on the mountain on the other side, with a valley between them."
    },
    {
      "verse": 4,
      "text": "And there came out from the camp of the Philistines a champion named Goliath, of Gath, whose height was four cubits and a span."
    },
    {
      "verse": 5,
      "text": "He had a helmet of bronze on his head, and he was armed with a coat of mail; the weight of the coat was five thousand shekels of bronze."
    },
    {
      "verse": 6,
      "text": "He had greaves of bronze on his legs and a javelin of bronze slung between his shoulders."
    },
    {
      "verse": 7,
      "text": "The shaft of his spear was like a weaver’s beam, and his spear’s head weighed six hundred shekels of iron, and his shield-bearer went before him."
    },
    {
      "verse": 8,
      "text": "He stood and shouted to the ranks of Israel, “Why have you come out to draw up for battle? Am I not a Philistine, and are you not servants of Saul? Choose a man for yourselves, and let him come down to me."
    },
    {
      "verse": 9,
      "text": "If he is able to fight with me and kill me, then we will be your servants, but if I prevail against him and kill him, then you shall be our servants and serve us.”"
    },
    {
      "verse": 10,
      "text": "And the Philistine said, “Today I defy the ranks of Israel! Give me a man, that we may fight together.”"
    },
    {
      "verse": 11,
      "text": "When Saul and all Israel heard these words of the Philistine, they were dismayed and greatly afraid."
    },
    {
      "verse": 12,
      "text": "Now David was the son of an Ephrathite of Bethlehem in Judah named Jesse, who had eight sons. In the days of Saul the man was already old and advanced in years."
    },
    {
      "verse": 13,
      "text": "The three eldest sons of Jesse had followed Saul to the battle; the names of his three sons who went to the battle were Eliab the firstborn, and next to him Abinadab, and the third Shammah."
    },
    {
      "verse": 14,
      "text": "David was the youngest; the three eldest followed Saul,"
    },
    {
      "verse": 15,
      "text": "but David went back and forth from Saul to feed his father’s sheep at Bethlehem."
    },
    {
      "verse": 16,
      "text": "For forty days the Philistine came forward and took his stand, morning and evening."
    },
    {
      "verse": 17,
      "text": "Jesse said to his son David, “Take for your brothers an ephah of this parched grain and these ten loaves, and carry them quickly to the camp to your brothers;"
    },
    {
      "verse": 18,
      "text": "also take these ten cheeses to the commander of their thousand. See how your brothers fare, and bring some token from them.”"
    },
    {
      "verse": 19,
      "text": "Now Saul, and they, and all the men of Israel were in the valley of Elah fighting with the Philistines."
    },
    {
      "verse": 20,
      "text": "David rose early in the morning, left the sheep with a keeper, took the provisions, and went as Jesse had commanded him. He came to the encampment as the army was going forth to the battle line, shouting the war cry."
    },
    {
      "verse": 21,
      "text": "Israel and the Philistines drew up for battle, army against army."
    },
    {
      "verse": 22,
      "text": "David left the things in charge of the keeper of the baggage, ran to the ranks, and went and greeted his brothers."
    },
    {
      "verse": 23,
      "text": "As he talked with them, the champion, the Philistine of Gath, Goliath by name, came up out of the ranks of the Philistines and spoke the same words as before. And David heard him."
    },
    {
      "verse": 24,
      "text": "All the Israelites, when they saw the man, fled from him and were very much afraid."
    },
    {
      "verse": 25,
      "text": "The Israelites said, “Have you seen this man who has come up? Surely he has come up to defy Israel. The king will greatly enrich the man who kills him and will give him his daughter and make his family free in Israel.”"
    },
    {
      "verse": 26,
      "text": "David said to the men who stood by him, “What shall be done for the man who kills this Philistine and takes away the reproach from Israel? For who is this uncircumcised Philistine that he should defy the armies of the living God?”"
    },
    {
      "verse": 27,
      "text": "The people answered him in the same way, “So shall it be done for the man who kills him.”"
    },
    {
      "verse": 28,
      "text": "His eldest brother Eliab heard him talking to the men, and Eliab’s anger was kindled against David. He said, “Why have you come down? With whom have you left those few sheep in the wilderness? I know your presumption and the evil of your heart, for you have come down just to see the battle.”"
    },
    {
      "verse": 29,
      "text": "David said, “What have I done now? It was only a question.”"
    },
    {
      "verse": 30,
      "text": "He turned away from him toward another and spoke in the same way, and the people answered him again as before."
    },
    {
      "verse": 31,
      "text": "When the words that David spoke were heard, they repeated them before Saul, and he sent for him."
    },
    {
      "verse": 32,
      "text": "David said to Saul, “Let no one’s heart fail because of him; your servant will go and fight with this Philistine.”"
    },
    {
      "verse": 33,
      "text": "Saul said to David, “You are not able to go against this Philistine to fight with him, for you are just a boy, and he has been a warrior from his youth.”"
    },
    {
      "verse": 34,
      "text": "But David said to Saul, “Your servant used to keep sheep for his father, and whenever a lion or a bear came and took a lamb from the flock,"
    },
    {
      "verse": 35,
      "text": "I went after it and struck it down, rescuing the lamb from its mouth, and if it turned against me, I would catch it by the jaw, strike it down, and kill it."
    },
    {
      "verse": 36,
      "text": "Your servant has killed both lions and bears, and this uncircumcised Philistine shall be like one of them, since he has defied the armies of the living God.”"
    },
    {
      "verse": 37,
      "text": "David said, “The Lord, who saved me from the paw of the lion and from the paw of the bear, will save me from the hand of this Philistine.” So Saul said to David, “Go, and may the Lord be with you!”"
    },
    {
      "verse": 38,
      "text": "Saul clothed David with his armor; he put a bronze helmet on his head and clothed him with a coat of mail."
    },
    {
      "verse": 39,
      "text": "David strapped Saul’s sword over the armor, and he tried in vain to walk, for he was not used to them. Then David said to Saul, “I cannot walk with these, for I am not used to them.” So David removed them."
    },
    {
      "verse": 40,
      "text": "Then he took his staff in his hand and chose five smooth stones from the wadi and put them in his shepherd’s bag, in the pouch; his sling was in his hand, and he drew near to the Philistine."
    },
    {
      "verse": 41,
      "text": "The Philistine came on and drew near to David, with his shield-bearer in front of him."
    },
    {
      "verse": 42,
      "text": "When the Philistine looked and saw David, he disdained him, for he was only a youth, ruddy and handsome in appearance."
    },
    {
      "verse": 43,
      "text": "The Philistine said to David, “Am I a dog, that you come to me with sticks?” And the Philistine cursed David by his gods."
    },
    {
      "verse": 44,
      "text": "The Philistine said to David, “Come to me, and I will give your flesh to the birds of the air and to the wild animals of the field.”"
    },
    {
      "verse": 45,
      "text": "But David said to the Philistine, “You come to me with sword and spear and javelin, but I come to you in the name of the Lord of hosts, the God of the armies of Israel, whom you have defied."
    },
    {
      "verse": 46,
      "text": "This very day the Lord will deliver you into my hand, and I will strike you down and cut off your head, and I will give the dead bodies of the Philistine army this very day to the birds of the air and to the wild animals of the earth, so that all the earth may know that there is a God in Israel"
    },
    {
      "verse": 47,
      "text": "and that all this assembly may know that the Lord does not save by sword and spear, for the battle is the Lord ’s, and he will give you into our hand.”"
    },
    {
      "verse": 48,
      "text": "When the Philistine drew nearer to meet David, David ran quickly toward the battle line to meet the Philistine."
    },
    {
      "verse": 49,
      "text": "David put his hand in his bag, took out a stone, slung it, and struck the Philistine on his forehead; the stone sank into his forehead, and he fell face down on the ground."
    },
    {
      "verse": 50,
      "text": "So David prevailed over the Philistine with a sling and a stone, striking down the Philistine and killing him; there was no sword in David’s hand."
    },
    {
      "verse": 51,
      "text": "Then David ran and stood over the Philistine; he grasped his sword, drew it out of its sheath, and killed him; then he cut off his head with it. When the Philistines saw that their champion was dead, they fled."
    },
    {
      "verse": 52,
      "text": "The troops of Israel and Judah rose up with a shout and pursued the Philistines as far as Gath and the gates of Ekron, so that the wounded Philistines fell on the way from Shaaraim as far as Gath and Ekron."
    },
    {
      "verse": 53,
      "text": "The Israelites came back from chasing the Philistines, and they plundered their camp."
    },
    {
      "verse": 54,
      "text": "David took the head of the Philistine and brought it to Jerusalem, but he put his armor in his tent."
    },
    {
      "verse": 55,
      "text": "When Saul saw David go out against the Philistine, he said to Abner, the commander of the army, “Abner, whose son is this young man?” Abner said, “As your soul lives, O king, I do not know.”"
    },
    {
      "verse": 56,
      "text": "The king said, “Inquire whose son the young man is.”"
    },
    {
      "verse": 57,
      "text": "On David’s return from killing the Philistine, Abner took him and brought him before Saul, with the head of the Philistine in his hand."
    },
    {
      "verse": 58,
      "text": "Saul said to him, “Whose son are you, young man?” And David answered, “I am the son of your servant Jesse the Bethlehemite.”"
    }
  ],
  "timestamp": "2025-08-08T15:48:56.582091"
}