{
  "book": "1SA",
  "book_name": "1 Samuel",
  "chapter": 24,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1SA.24",
  "verses": [
    {
      "verse": 1,
      "text": "When Saul returned from following the Philistines, he was told, “David is in the wilderness of En-gedi.”"
    },
    {
      "verse": 2,
      "text": "Then Saul took three thousand chosen men out of all Israel and went to look for David and his men in the direction of the Rocks of the Wild Goats."
    },
    {
      "verse": 3,
      "text": "He came to the sheepfolds beside the road, where there was a cave, and Saul went in to relieve himself. Now David and his men were sitting in the innermost parts of the cave."
    },
    {
      "verse": 4,
      "text": "The men of David said to him, “Here is the day of which the Lord said to you, ‘I will give your enemy into your hand, and you shall do to him as it seems good to you.’ ” Then David went and stealthily cut off a corner of Saul’s cloak."
    },
    {
      "verse": 5,
      "text": "Afterward David was stricken to the heart because he had cut off a corner of Saul’s cloak."
    },
    {
      "verse": 6,
      "text": "He said to his men, “The Lord forbid that I should do this thing to my lord, the Lord ’s anointed, to raise my hand against him, for he is the Lord ’s anointed.”"
    },
    {
      "verse": 7,
      "text": "So David rebuked his men severely and did not permit them to attack Saul. Then Saul got up and left the cave and went on his way."
    },
    {
      "verse": 8,
      "text": "Afterward David also rose up and went out of the cave and called after Saul, “My lord the king!” When Saul looked behind him, David bowed with his face to the ground and did obeisance."
    },
    {
      "verse": 9,
      "text": "David said to Saul, “Why do you listen to the words of those who say, ‘David seeks to do you harm’?"
    },
    {
      "verse": 10,
      "text": "This very day your eyes have seen how the Lord gave you into my hand in the cave, and some urged me to kill you, but I spared you. I said, ‘I will not raise my hand against my lord, for he is the Lord ’s anointed.’"
    },
    {
      "verse": 11,
      "text": "See, my father, see the corner of your cloak in my hand, for by the fact that I cut off the corner of your cloak and did not kill you, you may know for certain that there is no wrong or treason in my hands. I have not sinned against you, though you are hunting me to take my life."
    },
    {
      "verse": 12,
      "text": "May the Lord judge between me and you! May the Lord avenge me on you, but my hand shall not be against you."
    },
    {
      "verse": 13,
      "text": "As the ancient proverb says, ‘Out of the wicked comes forth wickedness,’ but my hand shall not be against you."
    },
    {
      "verse": 14,
      "text": "Against whom has the king of Israel come out? Whom do you pursue? A dead dog? A single flea?"
    },
    {
      "verse": 15,
      "text": "May the Lord, therefore, be judge and give sentence between me and you. May he see to it and plead my cause and vindicate me against you.”"
    },
    {
      "verse": 16,
      "text": "When David had finished speaking these words to Saul, Saul said, “Is this your voice, my son David?” Saul lifted up his voice and wept."
    },
    {
      "verse": 17,
      "text": "He said to David, “You are more righteous than I, for you have repaid me good, whereas I have repaid you evil."
    },
    {
      "verse": 18,
      "text": "Today you have explained how you have dealt well with me, in that you did not kill me when the Lord put me into your hands."
    },
    {
      "verse": 19,
      "text": "For who has ever found an enemy and sent the enemy safely away? So may the Lord reward you with good for what you have done to me this day."
    },
    {
      "verse": 20,
      "text": "Now I know that you shall surely be king and that the kingdom of Israel shall be established in your hand."
    },
    {
      "verse": 21,
      "text": "Swear to me, therefore, by the Lord that you will not cut off my descendants after me and that you will not wipe out my name from my father’s house.”"
    },
    {
      "verse": 22,
      "text": "So David swore this to Saul. Then Saul went home, but David and his men went up to the stronghold."
    }
  ],
  "timestamp": "2025-08-08T15:48:57.531331"
}