{
  "book": "1TI",
  "book_name": "1 Timothy",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1TI.3",
  "verses": [
    {
      "verse": 1,
      "text": "The saying is sure: whoever aspires to the office of bishop desires a noble task."
    },
    {
      "verse": 2,
      "text": "Now a bishop must be above reproach, married only once, temperate, self-controlled, respectable, hospitable, an apt teacher,"
    },
    {
      "verse": 3,
      "text": "not a drunkard, not violent but gentle, not quarrelsome, and not a lover of money."
    },
    {
      "verse": 4,
      "text": "He must manage his own household well, keeping his children submissive and respectful in every way,"
    },
    {
      "verse": 5,
      "text": "for if someone does not know how to manage his own household, how can he take care of God’s church?"
    },
    {
      "verse": 6,
      "text": "He must not be a recent convert, or he may be puffed up with conceit and fall into the condemnation of the devil."
    },
    {
      "verse": 7,
      "text": "Moreover, he must be well thought of by outsiders, so that he may not fall into disgrace and the snare of the devil."
    },
    {
      "verse": 8,
      "text": "Deacons likewise must be serious, not double-tongued, not indulging in much wine, not greedy for money;"
    },
    {
      "verse": 9,
      "text": "they must hold fast to the mystery of the faith with a clear conscience."
    },
    {
      "verse": 10,
      "text": "And let them first be tested; then, if they prove themselves blameless, let them serve as deacons."
    },
    {
      "verse": 11,
      "text": "Women likewise must be serious, not slanderers, but temperate, faithful in all things."
    },
    {
      "verse": 12,
      "text": "Let deacons be married only once, and let them manage their children and their households well;"
    },
    {
      "verse": 13,
      "text": "for those who serve well as deacons gain a good standing for themselves and great boldness in the faith that is in Christ Jesus."
    },
    {
      "verse": 14,
      "text": "I hope to come to you soon, but I am writing these instructions to you so that,"
    },
    {
      "verse": 15,
      "text": "if I am delayed, you may know how one ought to behave in the household of God, which is the church of the living God, the pillar and support of the truth."
    },
    {
      "verse": 16,
      "text": "Without any doubt, the mystery of godliness is great: He was revealed in flesh, vindicated in spirit, seen by angels, proclaimed among gentiles, believed in throughout the world, taken up in glory."
    }
  ],
  "timestamp": "2025-08-08T15:52:14.130922"
}