{
  "book": "1TI",
  "book_name": "1 Timothy",
  "chapter": 1,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/1TI.1",
  "verses": [
    {
      "verse": 1,
      "text": "Paul, an apostle of Christ Jesus by the command of God our Savior and of Christ Jesus our hope,"
    },
    {
      "verse": 2,
      "text": "To Timothy, my true child in the faith: Grace, mercy, and peace from God the Father and Christ Jesus our Lord."
    },
    {
      "verse": 3,
      "text": "I urge you, as I did when I was on my way to Macedonia, to remain in Ephesus so that you may instruct certain people not to teach different teachings"
    },
    {
      "verse": 4,
      "text": "and not to occupy themselves with myths and endless genealogies that promote speculations rather than the divine training that is known by faith."
    },
    {
      "verse": 5,
      "text": "But the aim of such instruction is love that comes from a pure heart, a good conscience, and sincere faith."
    },
    {
      "verse": 6,
      "text": "Some people have deviated from these and turned to meaningless talk,"
    },
    {
      "verse": 7,
      "text": "desiring to be teachers of the law without understanding either what they are saying or the things about which they make assertions."
    },
    {
      "verse": 8,
      "text": "Now we know that the law is good, if one uses it legitimately;"
    },
    {
      "verse": 9,
      "text": "this means understanding that the law is laid down not for the righteous but for the lawless and disobedient, for the godless and sinful, for the unholy and profane, for those who kill their father or mother, for murderers,"
    },
    {
      "verse": 10,
      "text": "the sexually immoral, men who engage in illicit sex, slave traders, liars, perjurers, and whatever else is contrary to the sound teaching"
    },
    {
      "verse": 11,
      "text": "that conforms to the glorious gospel of the blessed God, with which I was entrusted."
    },
    {
      "verse": 12,
      "text": "I am grateful to Christ Jesus our Lord, who has strengthened me, because he considered me faithful and appointed me to his service,"
    },
    {
      "verse": 13,
      "text": "even though I was formerly a blasphemer, a persecutor, and a man of violence. But I received mercy because I had acted ignorantly in unbelief,"
    },
    {
      "verse": 14,
      "text": "and the grace of our Lord overflowed for me with the faith and love that are in Christ Jesus."
    },
    {
      "verse": 15,
      "text": "The saying is sure and worthy of full acceptance: that Christ Jesus came into the world to save sinners—of whom I am the foremost."
    },
    {
      "verse": 16,
      "text": "But for that very reason I received mercy, so that in me, as the foremost, Jesus Christ might display the utmost patience as an example to those who would come to believe in him for eternal life."
    },
    {
      "verse": 17,
      "text": "To the King of the ages, immortal, invisible, the only God, be honor and glory forever and ever. Amen."
    },
    {
      "verse": 18,
      "text": "This charge I commit to you, Timothy, my child, in accordance with the prophecies made earlier about you, so that by following them you may fight the good fight,"
    },
    {
      "verse": 19,
      "text": "having faith and a good conscience. By rejecting conscience, certain persons have suffered shipwreck in the faith;"
    },
    {
      "verse": 20,
      "text": "among them are Hymenaeus and Alexander, whom I have turned over to Satan, so that they may be taught not to blaspheme."
    }
  ],
  "timestamp": "2025-08-08T15:52:13.922021"
}