{
  "book": "2CH",
  "book_name": "2 Chronicles",
  "chapter": 28,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2CH.28",
  "verses": [
    {
      "verse": 1,
      "text": "Ahaz was twenty years old when he began to reign; he reigned sixteen years in Jerusalem. He did not do what was right in the sight of the Lord, as his ancestor David had done,"
    },
    {
      "verse": 2,
      "text": "but he walked in the ways of the kings of Israel. He even made cast images for the Baals,"
    },
    {
      "verse": 3,
      "text": "and he made offerings in the valley of the son of Hinnom and made his sons pass through fire, according to the abominable practices of the nations whom the Lord had driven out before the people of Israel."
    },
    {
      "verse": 4,
      "text": "He sacrificed and made offerings on the high places, on the hills, and under every green tree."
    },
    {
      "verse": 5,
      "text": "Therefore the Lord his God gave him into the hand of the king of Aram, who defeated him and took captive a great number of his people and brought them to Damascus. He was also given into the hand of the king of Israel, who defeated him with great slaughter."
    },
    {
      "verse": 6,
      "text": "Pekah son of Remaliah killed one hundred twenty thousand in Judah in one day, all of them valiant warriors, because they had abandoned the Lord, the God of their ancestors."
    },
    {
      "verse": 7,
      "text": "And Zichri, a mighty warrior of Ephraim, killed the king’s son Maaseiah, Azrikam the commander of the palace, and Elkanah the next in authority to the king."
    },
    {
      "verse": 8,
      "text": "The people of Israel took captive two hundred thousand of their kin: women, sons, and daughters; they also took much spoil from them and brought the spoil to Samaria."
    },
    {
      "verse": 9,
      "text": "But a prophet of the Lord was there whose name was Oded; he went out to meet the army that came to Samaria and said to them, “Because the Lord, the God of your ancestors, was angry with Judah, he gave them into your hand, but you have killed them in a rage that has reached up to heaven."
    },
    {
      "verse": 10,
      "text": "Now you intend to subjugate the people of Judah and Jerusalem, male and female, as your slaves. But what have you except sins against the Lord your God?"
    },
    {
      "verse": 11,
      "text": "Now hear me, and send back the captives whom you have taken from your kindred, for the fierce wrath of the Lord is upon you.”"
    },
    {
      "verse": 12,
      "text": "Moreover, certain chiefs of the Ephraimites, Azariah son of Johanan, Berechiah son of Meshillemoth, Jehizkiah son of Shallum, and Amasa son of Hadlai, stood up against those who were coming from the war"
    },
    {
      "verse": 13,
      "text": "and said to them, “You shall not bring the captives in here, for you propose to bring on us guilt against the Lord in addition to our present sins and guilt. For our guilt is already great, and there is fierce wrath against Israel.”"
    },
    {
      "verse": 14,
      "text": "So the warriors left the captives and the plunder before the officials and all the assembly."
    },
    {
      "verse": 15,
      "text": "Then those who were mentioned by name got up and took the captives, and with the spoil they clothed all who were naked among them; they clothed them, gave them sandals, provided them with food and drink, and anointed them; and carrying all the feeble among them on donkeys, they brought them to their kindred at Jericho, the city of palm trees. Then they returned to Samaria."
    },
    {
      "verse": 16,
      "text": "At that time King Ahaz sent to the king of Assyria for help."
    },
    {
      "verse": 17,
      "text": "For the Edomites had again invaded and defeated Judah and carried away captives."
    },
    {
      "verse": 18,
      "text": "And the Philistines had made raids on the cities in the Shephelah and the Negeb of Judah and had taken Beth-shemesh, Aijalon, Gederoth, Soco with its villages, Timnah with its villages, and Gimzo with its villages, and they settled there."
    },
    {
      "verse": 19,
      "text": "For the Lord brought Judah low because of King Ahaz of Israel, for he had behaved without restraint in Judah and had been faithless to the Lord."
    },
    {
      "verse": 20,
      "text": "So King Tiglath-pileser of Assyria came against him and oppressed him instead of strengthening him."
    },
    {
      "verse": 21,
      "text": "For Ahaz plundered the house of the Lord and the houses of the king and of the officials and gave tribute to the king of Assyria, but it did not help him."
    },
    {
      "verse": 22,
      "text": "In the time of his distress he became yet more faithless to the Lord —this same King Ahaz."
    },
    {
      "verse": 23,
      "text": "For he sacrificed to the gods of Damascus that had defeated him and said, “Because the gods of the kings of Aram helped them, I will sacrifice to them so that they may help me.” But they were the ruin of him and of all Israel."
    },
    {
      "verse": 24,
      "text": "Ahaz gathered together the utensils of the house of God and cut in pieces the utensils of the house of God. He shut up the doors of the house of the Lord and made himself altars in every corner of Jerusalem."
    },
    {
      "verse": 25,
      "text": "In every city of Judah he made high places to make offerings to other gods, provoking to anger the Lord, the God of his ancestors."
    },
    {
      "verse": 26,
      "text": "Now the rest of his acts and all his ways, from first to last, are written in the Book of the Kings of Judah and Israel."
    },
    {
      "verse": 27,
      "text": "Ahaz slept with his ancestors, and they buried him in the city, in Jerusalem, but they did not bring him into the tombs of the kings of Israel. His son Hezekiah succeeded him."
    }
  ],
  "timestamp": "2025-08-08T15:49:25.485392"
}