{
  "book": "2CO",
  "book_name": "2 Corinthians",
  "chapter": 9,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2CO.9",
  "verses": [
    {
      "verse": 1,
      "text": "Now it is not necessary for me to write you about the ministry to the saints,"
    },
    {
      "verse": 2,
      "text": "for I know your eagerness, which is the subject of my boasting about you to the people of Macedonia, saying that Achaia has been ready since last year, and your zeal has stirred up most of them."
    },
    {
      "verse": 3,
      "text": "But I am sending the brothers in order that our boasting about you may not prove to have been empty in this case, so that you may be ready, as I said you would be;"
    },
    {
      "verse": 4,
      "text": "otherwise, if some Macedonians come with me and find that you are not ready, we would be put to shame—to say nothing of you—in this undertaking."
    },
    {
      "verse": 5,
      "text": "So I thought it necessary to urge the brothers to go on ahead to you and arrange in advance for this bountiful gift that you have promised, so that it may be ready as a bountiful gift and not as an extortion."
    },
    {
      "verse": 6,
      "text": "The point is this: the one who sows sparingly will also reap sparingly, and the one who sows bountifully will also reap bountifully."
    },
    {
      "verse": 7,
      "text": "Each of you must give as you have made up your mind, not regretfully or under compulsion, for God loves a cheerful giver."
    },
    {
      "verse": 9,
      "text": "As it is written, “He scatters abroad; he gives to the poor; his righteousness endures forever.”"
    },
    {
      "verse": 10,
      "text": "He who supplies seed to the sower and bread for food will supply and multiply your seed for sowing and increase the harvest of your righteousness."
    },
    {
      "verse": 11,
      "text": "You will be enriched in every way for your great generosity, which will produce thanksgiving to God through us,"
    },
    {
      "verse": 12,
      "text": "for the rendering of this ministry not only supplies the needs of the saints but also overflows with many thanksgivings to God."
    },
    {
      "verse": 13,
      "text": "Through the testing of this ministry you glorify God by your obedience to the confession of the gospel of Christ and by the generosity of your partnership with them and with all others,"
    },
    {
      "verse": 14,
      "text": "while they long for you and pray for you because of the surpassing grace of God that he has given you."
    },
    {
      "verse": 15,
      "text": "Thanks be to God for his indescribable gift!"
    }
  ],
  "timestamp": "2025-08-08T15:51:59.076505"
}