{
  "book": "2CO",
  "book_name": "2 Corinthians",
  "chapter": 13,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2CO.13",
  "verses": [
    {
      "verse": 1,
      "text": "This is the third time I am coming to you. “Any charge must be sustained by the evidence of two or three witnesses.”"
    },
    {
      "verse": 2,
      "text": "I warned those who sinned previously and all the others, and I warn them now while absent, as I did when present on my second visit, that if I come again I will not be lenient—"
    },
    {
      "verse": 3,
      "text": "since you desire proof that Christ is speaking in me. He is not weak in dealing with you but is powerful in you."
    },
    {
      "verse": 4,
      "text": "For he was crucified in weakness but lives by the power of God. For we are weak in him, but in dealing with you we will live with him by the power of God."
    },
    {
      "verse": 5,
      "text": "Examine yourselves to see whether you are living in the faith. Test yourselves. Do you not realize that Jesus Christ is in you?—unless, indeed, you fail to meet the test!"
    },
    {
      "verse": 6,
      "text": "I hope you will find out that we have not failed."
    },
    {
      "verse": 7,
      "text": "But we pray to God that you may not do anything wrong—not that we may appear to have met the test but that you may do what is right, though we may seem to have failed."
    },
    {
      "verse": 8,
      "text": "For we cannot do anything against the truth but only for the truth."
    },
    {
      "verse": 9,
      "text": "For we rejoice when we are weak but you are strong. This is what we pray for, that you may be restored."
    },
    {
      "verse": 10,
      "text": "So I write these things while I am away from you, so that when I come I may not have to be severe in using the authority that the Lord has given me for building up and not for tearing down."
    },
    {
      "verse": 11,
      "text": "Finally, brothers and sisters, farewell. Be restored; listen to my appeal; agree with one another; live in peace; and the God of love and peace will be with you."
    },
    {
      "verse": 12,
      "text": "Greet one another with a holy kiss. All the saints greet you."
    },
    {
      "verse": 13,
      "text": "The grace of the Lord Jesus Christ, the love of God, and the communion of the Holy Spirit be with all of you."
    }
  ],
  "timestamp": "2025-08-08T15:51:59.682706"
}