{
  "book": "2CO",
  "book_name": "2 Corinthians",
  "chapter": 8,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2CO.8",
  "verses": [
    {
      "verse": 1,
      "text": "We want you to know, brothers and sisters, about the grace of God that has been granted to the churches of Macedonia,"
    },
    {
      "verse": 2,
      "text": "for during a severe ordeal of affliction their abundant joy and their extreme poverty have overflowed in a wealth of generosity on their part."
    },
    {
      "verse": 3,
      "text": "For, as I can testify, they voluntarily gave according to their means and even beyond their means,"
    },
    {
      "verse": 4,
      "text": "begging us earnestly for the favor of partnering in this ministry to the saints,"
    },
    {
      "verse": 5,
      "text": "and not as we expected. Instead, they gave themselves first to the Lord and, by the will of God, to us,"
    },
    {
      "verse": 6,
      "text": "so that we might urge Titus that, as he had already made a beginning, so he should also complete this generous undertaking among you."
    },
    {
      "verse": 7,
      "text": "Now as you excel in everything—in faith, in speech, in knowledge, in utmost eagerness, and in our love for you —so we want you to excel also in this generous undertaking."
    },
    {
      "verse": 8,
      "text": "I do not say this as a command, but I am, by mentioning the eagerness of others, testing the genuineness of your love."
    },
    {
      "verse": 9,
      "text": "For you know the generous act of our Lord Jesus Christ, that though he was rich, yet for your sakes he became poor, so that by his poverty you might become rich."
    },
    {
      "verse": 10,
      "text": "And in this matter I am giving my opinion: it is beneficial for you who began last year not only to do something but even to desire to do something."
    },
    {
      "verse": 11,
      "text": "Now finish doing it, so that your eagerness may be matched by completing it according to your means."
    },
    {
      "verse": 12,
      "text": "For if the eagerness is there, the gift is acceptable according to what one has, not according to what one does not have."
    },
    {
      "verse": 13,
      "text": "For I do not mean that there should be relief for others and hardship for you, but it is a question of equality between"
    },
    {
      "verse": 14,
      "text": "your present abundance and their need, so that their abundance may also supply your need, in order that there may be equality."
    },
    {
      "verse": 15,
      "text": "As it is written, “The one who had much did not have too much, and the one who had little did not have too little.”"
    },
    {
      "verse": 16,
      "text": "But thanks be to God, who put in the heart of Titus the same eagerness for you that I myself have."
    },
    {
      "verse": 17,
      "text": "For he not only accepted our appeal, but since he is more eager than ever, he is going to you of his own accord."
    },
    {
      "verse": 18,
      "text": "With him we are sending the brother who is praised among all the churches for his work for the gospel,"
    },
    {
      "verse": 19,
      "text": "and not only that, but he has also been appointed by the churches to travel with us while we are administering this generous undertaking for the glory of the Lord himself and to show our goodwill."
    },
    {
      "verse": 20,
      "text": "We are making this arrangement lest anyone blame us about this generous gift that we are administering,"
    },
    {
      "verse": 21,
      "text": "for we are setting our minds on what is right not only before the Lord but also before the people."
    },
    {
      "verse": 22,
      "text": "And with them we are sending our brother whom we have often tested and found eager in many matters but who is now more eager than ever because of his great confidence in you."
    },
    {
      "verse": 23,
      "text": "As for Titus, he is my partner and coworker in your service; as for our brothers, they are messengers of the churches, the glory of Christ."
    },
    {
      "verse": 24,
      "text": "Therefore openly before the churches, show them the proof of your love and of our reason for boasting about you to them."
    }
  ],
  "timestamp": "2025-08-08T15:51:58.786767"
}