{
  "book": "2CO",
  "book_name": "2 Corinthians",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2CO.3",
  "verses": [
    {
      "verse": 1,
      "text": "Are we beginning to commend ourselves again? Surely we do not need, as some do, letters of recommendation to you or from you, do we?"
    },
    {
      "verse": 2,
      "text": "You yourselves are our letter, written on our hearts, known and read by all,"
    },
    {
      "verse": 3,
      "text": "and you show that you are a letter of Christ, prepared by us, written not with ink but with the Spirit of the living God, not on tablets of stone but on tablets that are human hearts."
    },
    {
      "verse": 4,
      "text": "Such is the confidence that we have through Christ toward God."
    },
    {
      "verse": 5,
      "text": "Not that we are qualified of ourselves to claim anything as coming from us; our qualification is from God,"
    },
    {
      "verse": 6,
      "text": "who has made us qualified to be ministers of a new covenant, not of letter but of spirit, for the letter kills, but the Spirit gives life."
    },
    {
      "verse": 7,
      "text": "Now if the ministry of death, chiseled in letters on stone tablets, came in glory so that the people of Israel could not gaze at Moses’s face because of the glory of his face, a glory now set aside,"
    },
    {
      "verse": 8,
      "text": "how much more will the ministry of the Spirit come in glory?"
    },
    {
      "verse": 9,
      "text": "For if there was glory in the ministry of condemnation, much more does the ministry of justification abound in glory!"
    },
    {
      "verse": 10,
      "text": "Indeed, what once had glory has in this respect lost its glory because of the greater glory,"
    },
    {
      "verse": 11,
      "text": "for if what was set aside came through glory, much more has the permanent come in glory!"
    },
    {
      "verse": 12,
      "text": "Since, then, we have such a hope, we act with complete frankness,"
    },
    {
      "verse": 13,
      "text": "not like Moses, who put a veil over his face to keep the people of Israel from gazing at the end of the glory that was being set aside."
    },
    {
      "verse": 14,
      "text": "But their minds were hardened. Indeed, to this very day, when they hear the reading of the old covenant, the same veil is still there; it is not unveiled since in Christ it is set aside."
    },
    {
      "verse": 15,
      "text": "Indeed, to this very day whenever Moses is read, a veil lies over their minds,"
    },
    {
      "verse": 16,
      "text": "but when one turns to the Lord, the veil is removed."
    },
    {
      "verse": 17,
      "text": "Now the Lord is the Spirit, and where the Spirit of the Lord is, there is freedom."
    },
    {
      "verse": 18,
      "text": "And all of us, with unveiled faces, seeing the glory of the Lord as though reflected in a mirror, are being transformed into the same image from one degree of glory to another, for this comes from the Lord, the Spirit."
    }
  ],
  "timestamp": "2025-08-08T15:51:57.969976"
}