{
  "book": "2KI",
  "book_name": "2 Kings",
  "chapter": 13,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2KI.13",
  "verses": [
    {
      "verse": 1,
      "text": "In the twenty-third year of King Joash son of Ahaziah of Judah, Jehoahaz son of Jehu began to reign over Israel in Samaria; he reigned seventeen years."
    },
    {
      "verse": 2,
      "text": "He did what was evil in the sight of the Lord and followed the sins of Jeroboam son of Nebat that he caused Israel to sin; he did not depart from them."
    },
    {
      "verse": 3,
      "text": "The anger of the Lord was kindled against Israel, so he gave them repeatedly into the hand of King Hazael of Aram, then into the hand of Ben-hadad son of Hazael."
    },
    {
      "verse": 4,
      "text": "But Jehoahaz entreated the Lord, and the Lord heeded him, for he saw the oppression of Israel, how the king of Aram oppressed them."
    },
    {
      "verse": 5,
      "text": "Therefore the Lord gave Israel a savior, so they escaped from the hand of the Arameans, and the people of Israel lived in their homes as formerly."
    },
    {
      "verse": 6,
      "text": "Nevertheless, they did not depart from the sins of the house of Jeroboam that he caused Israel to sin but walked in them; the sacred pole also remained in Samaria."
    },
    {
      "verse": 7,
      "text": "So Jehoahaz was left with an army of not more than fifty horsemen, ten chariots, and ten thousand footmen, for the king of Aram had destroyed them and made them like the dust at threshing."
    },
    {
      "verse": 8,
      "text": "Now the rest of the acts of Jehoahaz and all that he did, including his might, are they not written in the Book of the Annals of the Kings of Israel?"
    },
    {
      "verse": 9,
      "text": "So Jehoahaz slept with his ancestors, and they buried him in Samaria; then his son Joash succeeded him."
    },
    {
      "verse": 10,
      "text": "In the thirty-seventh year of King Joash of Judah, Jehoash son of Jehoahaz began to reign over Israel in Samaria; he reigned sixteen years."
    },
    {
      "verse": 11,
      "text": "He also did what was evil in the sight of the Lord; he did not depart from all the sins of Jeroboam son of Nebat that he caused Israel to sin, but he walked in them."
    },
    {
      "verse": 12,
      "text": "Now the rest of the acts of Joash and all that he did, as well as the might with which he fought against King Amaziah of Judah, are they not written in the Book of the Annals of the Kings of Israel?"
    },
    {
      "verse": 13,
      "text": "So Joash slept with his ancestors, and Jeroboam sat upon his throne; Joash was buried in Samaria with the kings of Israel."
    },
    {
      "verse": 14,
      "text": "Now when Elisha had fallen sick with the illness of which he was to die, King Joash of Israel went down to him and wept before him, crying, “My father, my father! The chariots of Israel and its horsemen!”"
    },
    {
      "verse": 15,
      "text": "Elisha said to him, “Take a bow and arrows,” so he took a bow and arrows."
    },
    {
      "verse": 16,
      "text": "Then he said to the king of Israel, “Draw the bow,” and he drew it. Elisha laid his hands on the king’s hands."
    },
    {
      "verse": 17,
      "text": "Then he said, “Open the window eastward,” and he opened it. Elisha said, “Shoot,” and he shot. Then he said, “The Lord ’s arrow of victory, the arrow of victory over Aram! For you shall fight the Arameans in Aphek until you have made an end of them.”"
    },
    {
      "verse": 18,
      "text": "He continued, “Take the arrows,” and he took them. He said to the king of Israel, “Strike the ground with them”; he struck three times and stopped."
    },
    {
      "verse": 19,
      "text": "Then the man of God was angry with him and said, “You should have struck five or six times; then you would have struck down Aram until you had made an end of it, but now you will strike down Aram only three times.”"
    },
    {
      "verse": 20,
      "text": "So Elisha died, and they buried him. Now bands of Moabites used to invade the land in the spring of the year."
    },
    {
      "verse": 21,
      "text": "As a man was being buried, a marauding band was seen and the man was thrown into the grave of Elisha; as soon as the man touched the bones of Elisha, he came to life and stood on his feet."
    },
    {
      "verse": 22,
      "text": "Now King Hazael of Aram oppressed Israel all the days of Jehoahaz."
    },
    {
      "verse": 23,
      "text": "But the Lord was gracious to them and had compassion on them; he turned toward them because of his covenant with Abraham, Isaac, and Jacob and would not destroy them, nor has he banished them from his presence until now."
    },
    {
      "verse": 24,
      "text": "When King Hazael of Aram died, his son Ben-hadad succeeded him."
    },
    {
      "verse": 25,
      "text": "Then Jehoash son of Jehoahaz took again from Ben-hadad son of Hazael the towns that he had taken from his father Jehoahaz in war. Three times Joash defeated him and recovered the towns of Israel."
    }
  ],
  "timestamp": "2025-08-08T15:49:11.997803"
}