{
  "book": "2KI",
  "book_name": "2 Kings",
  "chapter": 21,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2KI.21",
  "verses": [
    {
      "verse": 1,
      "text": "Manasseh was twelve years old when he began to reign; he reigned fifty-five years in Jerusalem. His mother’s name was Hephzibah."
    },
    {
      "verse": 2,
      "text": "He did what was evil in the sight of the Lord, following the abominable practices of the nations that the Lord drove out before the people of Israel."
    },
    {
      "verse": 3,
      "text": "For he rebuilt the high places that his father Hezekiah had destroyed; he erected altars for Baal, made a sacred pole, as King Ahab of Israel had done, worshiped all the host of heaven and served them."
    },
    {
      "verse": 4,
      "text": "He built altars in the house of the Lord, of which the Lord had said, “In Jerusalem I will put my name.”"
    },
    {
      "verse": 5,
      "text": "He built altars for all the host of heaven in the two courts of the house of the Lord."
    },
    {
      "verse": 6,
      "text": "He made his son pass through fire; he practiced soothsaying and augury and dealt with mediums and with wizards. He did much evil in the sight of the Lord, provoking him to anger."
    },
    {
      "verse": 7,
      "text": "The carved image of Asherah that he had made he set in the house of which the Lord said to David and to his son Solomon, “In this house and in Jerusalem, which I have chosen out of all the tribes of Israel, I will put my name forever;"
    },
    {
      "verse": 8,
      "text": "I will not cause the feet of Israel to wander any more out of the land that I gave to their ancestors, if only they will be careful to do according to all that I have commanded them and according to all the law that my servant Moses commanded them.”"
    },
    {
      "verse": 9,
      "text": "But they did not listen; Manasseh misled them to do more evil than the nations had done that the Lord destroyed before the people of Israel."
    },
    {
      "verse": 10,
      "text": "The Lord said by his servants the prophets,"
    },
    {
      "verse": 11,
      "text": "“Because King Manasseh of Judah has committed these abominations, has done things more wicked than all that the Amorites who were before him did, and has caused Judah also to sin with his idols,"
    },
    {
      "verse": 12,
      "text": "therefore thus says the Lord, the God of Israel: I am bringing upon Jerusalem and Judah such evil that the ears of everyone who hears of it will tingle."
    },
    {
      "verse": 13,
      "text": "I will stretch over Jerusalem the measuring line for Samaria and the plummet for the house of Ahab; I will wipe Jerusalem as one wipes a dish, wiping it and turning it upside down."
    },
    {
      "verse": 14,
      "text": "I will cast off the remnant of my heritage and give them into the hand of their enemies; they shall become a prey and a spoil to all their enemies"
    },
    {
      "verse": 15,
      "text": "because they have done what is evil in my sight and have provoked me to anger, since the day their ancestors came out of Egypt even to this day.”"
    },
    {
      "verse": 16,
      "text": "Moreover, Manasseh shed very much innocent blood, until he had filled Jerusalem from one end to another, besides the sin that he caused Judah to sin so that they did what was evil in the sight of the Lord."
    },
    {
      "verse": 17,
      "text": "Now the rest of the acts of Manasseh, all that he did and the sin that he committed, are they not written in the Book of the Annals of the Kings of Judah?"
    },
    {
      "verse": 18,
      "text": "Manasseh slept with his ancestors and was buried in the garden of his house, in the garden of Uzza. His son Amon succeeded him."
    },
    {
      "verse": 19,
      "text": "Amon was twenty-two years old when he began to reign; he reigned two years in Jerusalem. His mother’s name was Meshullemeth daughter of Haruz of Jotbah."
    },
    {
      "verse": 20,
      "text": "He did what was evil in the sight of the Lord, as his father Manasseh had done."
    },
    {
      "verse": 21,
      "text": "He walked in all the way in which his father walked, served the idols that his father served, and worshiped them;"
    },
    {
      "verse": 22,
      "text": "he abandoned the Lord, the God of his ancestors, and did not walk in the way of the Lord."
    },
    {
      "verse": 23,
      "text": "The servants of Amon conspired against him and killed the king in his house."
    },
    {
      "verse": 24,
      "text": "But the people of the land killed all those who had conspired against King Amon, and the people of the land made his son Josiah king in place of him."
    },
    {
      "verse": 25,
      "text": "Now the rest of the acts of Amon that he did, are they not written in the Book of the Annals of the Kings of Judah?"
    },
    {
      "verse": 26,
      "text": "He was buried in his tomb in the garden of Uzza; then his son Josiah succeeded him."
    }
  ],
  "timestamp": "2025-08-08T15:49:13.239180"
}