{
  "book": "2SA",
  "book_name": "2 Samuel",
  "chapter": 10,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2SA.10",
  "verses": [
    {
      "verse": 1,
      "text": "Some time afterward, the king of the Ammonites died, and his son Hanun succeeded him."
    },
    {
      "verse": 2,
      "text": "David said, “I will deal loyally with Hanun son of Nahash, just as his father dealt loyally with me.” So David sent envoys to console him concerning his father. When David’s envoys came into the land of the Ammonites,"
    },
    {
      "verse": 3,
      "text": "the princes of the Ammonites said to their lord Hanun, “Do you really think that David is honoring your father just because he has sent messengers with condolences to you? Has not David sent his envoys to you to search the city, to spy it out, and to overthrow it?”"
    },
    {
      "verse": 4,
      "text": "So Hanun seized David’s envoys, shaved off half the beard of each, cut off their garments in the middle at their waists, and sent them away."
    },
    {
      "verse": 5,
      "text": "When David was told, he sent to meet them, for the men were greatly ashamed. The king said, “Remain at Jericho until your beards have grown and then return.”"
    },
    {
      "verse": 6,
      "text": "When the Ammonites saw that they had become odious to David, the Ammonites sent and hired the Arameans of Beth-rehob and the Arameans of Zobah, twenty thousand foot soldiers, as well as the king of Maacah, one thousand men, and the men of Tob, twelve thousand men."
    },
    {
      "verse": 7,
      "text": "When David heard of it, he sent Joab and all the army of the warriors."
    },
    {
      "verse": 8,
      "text": "The Ammonites came out and drew up in battle array at the entrance of the gate, but the Arameans of Zobah and of Rehob and the men of Tob and Maacah were by themselves in the open country."
    },
    {
      "verse": 9,
      "text": "When Joab saw that the battle was set against him both in front and in the rear, he chose some of the picked men of Israel and arrayed them against the Arameans;"
    },
    {
      "verse": 10,
      "text": "the rest of the troops he put in the charge of his brother Abishai, and he arrayed them against the Ammonites."
    },
    {
      "verse": 11,
      "text": "He said, “If the Arameans are too strong for me, then you shall help me, but if the Ammonites are too strong for you, then I will come and help you."
    },
    {
      "verse": 12,
      "text": "Be strong, and let us be courageous for the sake of our people and for the cities of our God, and may the Lord do what seems good to him.”"
    },
    {
      "verse": 13,
      "text": "So Joab and the people who were with him moved forward into battle against the Arameans, and they fled before him."
    },
    {
      "verse": 14,
      "text": "When the Ammonites saw that the Arameans fled, they likewise fled before Abishai and entered the city. Then Joab returned from fighting against the Ammonites and came to Jerusalem."
    },
    {
      "verse": 15,
      "text": "But when the Arameans saw that they had been defeated by Israel, they gathered themselves together."
    },
    {
      "verse": 16,
      "text": "Hadadezer sent and brought out the Arameans who were beyond the River, and they came to Helam, with Shobach the commander of the army of Hadadezer at their head."
    },
    {
      "verse": 17,
      "text": "When it was told David, he gathered all Israel together and crossed the Jordan and came to Helam. The Arameans arrayed themselves against David and fought with him."
    },
    {
      "verse": 18,
      "text": "The Arameans fled before Israel, and David killed of the Arameans seven hundred chariot teams and forty thousand horsemen and wounded Shobach the commander of their army, so that he died there."
    },
    {
      "verse": 19,
      "text": "When all the kings who were servants of Hadadezer saw that they had been defeated by Israel, they made peace with Israel and became subject to them. So the Arameans were afraid to help the Ammonites any more."
    }
  ],
  "timestamp": "2025-08-08T15:49:01.578187"
}