{
  "book": "2TH",
  "book_name": "2 Thessalonians",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/2TH.3",
  "verses": [
    {
      "verse": 1,
      "text": "Finally, brothers and sisters, pray for us, so that the word of the Lord may spread rapidly and be glorified everywhere, just as it is among you,"
    },
    {
      "verse": 2,
      "text": "and that we may be rescued from wicked and evil people, for not all have faith."
    },
    {
      "verse": 3,
      "text": "But the Lord is faithful; he will strengthen you and guard you from the evil one."
    },
    {
      "verse": 4,
      "text": "And we have confidence in the Lord concerning you, that you are doing and will go on doing the things that we command."
    },
    {
      "verse": 5,
      "text": "May the Lord direct your hearts to the love of God and to the steadfastness of Christ."
    },
    {
      "verse": 6,
      "text": "Now we command you, brothers and sisters, in the name of our Lord Jesus Christ, to keep away from every brother or sister living irresponsibly and not according to the tradition that they received from us."
    },
    {
      "verse": 7,
      "text": "For you yourselves know how you ought to imitate us; we were not irresponsible when we were with you,"
    },
    {
      "verse": 8,
      "text": "and we did not eat anyone’s bread without paying for it, but with toil and labor we worked night and day so that we might not burden any of you."
    },
    {
      "verse": 9,
      "text": "This was not because we do not have that right but in order to give you an example to imitate."
    },
    {
      "verse": 10,
      "text": "For even when we were with you, we gave you this command: anyone unwilling to work should not eat."
    },
    {
      "verse": 11,
      "text": "For we hear that some of you are living irresponsibly, mere busybodies, not doing any work."
    },
    {
      "verse": 12,
      "text": "Now such persons we command and exhort in the Lord Jesus Christ to do their work quietly and to earn their own living."
    },
    {
      "verse": 13,
      "text": "Brothers and sisters, do not be weary in doing what is right."
    },
    {
      "verse": 14,
      "text": "Take note of those who do not obey what we say in this letter; have nothing to do with them, so that they may be ashamed."
    },
    {
      "verse": 15,
      "text": "Do not regard them as enemies, but admonish them as brothers and sisters."
    },
    {
      "verse": 16,
      "text": "Now may the Lord of peace himself give you peace at all times in all ways. The Lord be with all of you."
    },
    {
      "verse": 17,
      "text": "I, Paul, write this greeting with my own hand. This is the mark in every letter of mine; it is the way I write."
    },
    {
      "verse": 18,
      "text": "The grace of our Lord Jesus Christ be with all of you."
    }
  ],
  "timestamp": "2025-08-08T15:52:12.301603"
}