{
  "book": "ACT",
  "book_name": "Acts",
  "chapter": 11,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ACT.11",
  "verses": [
    {
      "verse": 1,
      "text": "Now the apostles and the brothers and sisters who were in Judea heard that the gentiles had also accepted the word of God."
    },
    {
      "verse": 2,
      "text": "So when Peter went up to Jerusalem, the circumcised believers criticized him,"
    },
    {
      "verse": 3,
      "text": "saying, “Why did you go to uncircumcised men and eat with them?”"
    },
    {
      "verse": 4,
      "text": "Then Peter began to explain it to them, step by step, saying,"
    },
    {
      "verse": 5,
      "text": "“I was in the city of Joppa praying, and in a trance I saw a vision. There was something like a large sheet coming down from heaven, being lowered by its four corners, and it came close to me."
    },
    {
      "verse": 6,
      "text": "As I looked at it closely I saw four-footed animals, beasts of prey, reptiles, and birds of the air."
    },
    {
      "verse": 7,
      "text": "I also heard a voice saying to me, ‘Get up, Peter; kill and eat.’"
    },
    {
      "verse": 8,
      "text": "But I replied, ‘By no means, Lord, for nothing profane or unclean has ever entered my mouth.’"
    },
    {
      "verse": 9,
      "text": "But a second time the voice answered from heaven, ‘What God has made clean, you must not call profane.’"
    },
    {
      "verse": 10,
      "text": "This happened three times; then everything was pulled up again to heaven."
    },
    {
      "verse": 11,
      "text": "At that very moment three men, sent to me from Caesarea, arrived at the house where we were."
    },
    {
      "verse": 12,
      "text": "The Spirit told me to go with them and not to make a distinction between them and us. These six brothers also accompanied me, and we entered the man’s house."
    },
    {
      "verse": 13,
      "text": "He told us how he had seen the angel standing in his house and saying, ‘Send to Joppa and bring Simon, who is called Peter;"
    },
    {
      "verse": 14,
      "text": "he will give you a message by which you and your entire household will be saved.’"
    },
    {
      "verse": 15,
      "text": "And as I began to speak, the Holy Spirit fell upon them just as it had upon us at the beginning."
    },
    {
      "verse": 16,
      "text": "And I remembered the word of the Lord, how he had said, ‘John baptized with water, but you will be baptized with the Holy Spirit.’"
    },
    {
      "verse": 17,
      "text": "If then God gave them the same gift that he gave us when we believed in the Lord Jesus Christ, who was I that I could hinder God?”"
    },
    {
      "verse": 18,
      "text": "When they heard this, they were silenced. And they praised God, saying, “Then God has given even to the gentiles the repentance that leads to life.”"
    },
    {
      "verse": 19,
      "text": "Now those who were scattered because of the persecution that took place over Stephen traveled as far as Phoenicia, Cyprus, and Antioch, and they spoke the word to no one except Jews."
    },
    {
      "verse": 20,
      "text": "But among them were some men of Cyprus and Cyrene who, on coming to Antioch, spoke to the Hellenists also, proclaiming the Lord Jesus."
    },
    {
      "verse": 21,
      "text": "The hand of the Lord was with them, and a great number became believers and turned to the Lord."
    },
    {
      "verse": 22,
      "text": "News of this came to the ears of the church in Jerusalem, and they sent Barnabas to Antioch."
    },
    {
      "verse": 23,
      "text": "When he came and saw the grace of God, he rejoiced, and he exhorted them all to remain faithful to the Lord with steadfast devotion,"
    },
    {
      "verse": 24,
      "text": "for he was a good man, full of the Holy Spirit and of faith. And a great many people were brought to the Lord."
    },
    {
      "verse": 25,
      "text": "Then Barnabas went to Tarsus to look for Saul,"
    },
    {
      "verse": 26,
      "text": "and when he had found him he brought him to Antioch. So it was that for an entire year they met with the church and taught a great many people, and it was in Antioch that the disciples were first called “Christians.”"
    },
    {
      "verse": 27,
      "text": "At that time prophets came down from Jerusalem to Antioch."
    },
    {
      "verse": 28,
      "text": "One of them named Agabus stood up and predicted by the Spirit that there would be a severe famine over all the world, and this took place during the reign of Claudius."
    },
    {
      "verse": 29,
      "text": "The disciples determined that, according to their ability, each would send relief to the brothers and sisters living in Judea;"
    },
    {
      "verse": 30,
      "text": "this they did, sending it to the elders by Barnabas and Saul."
    }
  ],
  "timestamp": "2025-08-08T15:51:46.051517"
}