{
  "book": "ACT",
  "book_name": "Acts",
  "chapter": 16,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ACT.16",
  "verses": [
    {
      "verse": 1,
      "text": "Paul went on also to Derbe and to Lystra, where there was a disciple named Timothy, the son of a Jewish woman who was a believer, but his father was a Greek."
    },
    {
      "verse": 2,
      "text": "He was well spoken of by the brothers and sisters in Lystra and Iconium."
    },
    {
      "verse": 3,
      "text": "Paul wanted Timothy to accompany him, and he took him and had him circumcised because of the Jews who were in those places, for they all knew that his father was a Greek."
    },
    {
      "verse": 4,
      "text": "As they went from town to town, they delivered to them for observance the decisions that had been reached by the apostles and elders who were in Jerusalem."
    },
    {
      "verse": 5,
      "text": "So the churches were strengthened in the faith and increased in numbers daily."
    },
    {
      "verse": 6,
      "text": "They went through the region of Phrygia and Galatia, having been forbidden by the Holy Spirit to speak the word in Asia."
    },
    {
      "verse": 7,
      "text": "When they had come opposite Mysia, they attempted to go into Bithynia, but the Spirit of Jesus did not allow them;"
    },
    {
      "verse": 8,
      "text": "so, passing by Mysia, they went down to Troas."
    },
    {
      "verse": 9,
      "text": "During the night Paul had a vision: there stood a man of Macedonia pleading with him and saying, “Come over to Macedonia and help us.”"
    },
    {
      "verse": 10,
      "text": "When he had seen the vision, we immediately tried to cross over to Macedonia, being convinced that God had called us to proclaim the good news to them."
    },
    {
      "verse": 11,
      "text": "We therefore set sail from Troas and took a straight course to Samothrace, the following day to Neapolis,"
    },
    {
      "verse": 12,
      "text": "and from there to Philippi, which is a leading city of the district of Macedonia and a Roman colony. We remained in this city for some days."
    },
    {
      "verse": 13,
      "text": "On the Sabbath day we went outside the gate by the river, where we supposed there was a place of prayer, and we sat down and spoke to the women who had gathered there."
    },
    {
      "verse": 14,
      "text": "A certain woman named Lydia, a worshiper of God, was listening to us; she was from the city of Thyatira and a dealer in purple cloth. The Lord opened her heart to listen eagerly to what was said by Paul."
    },
    {
      "verse": 15,
      "text": "When she and her household were baptized, she urged us, saying, “If you have judged me to be faithful to the Lord, come and stay at my home.” And she prevailed upon us."
    },
    {
      "verse": 16,
      "text": "One day as we were going to the place of prayer, we met a female slave who had a spirit of divination and brought her owners a great deal of money by fortune-telling."
    },
    {
      "verse": 17,
      "text": "While she followed Paul and us, she would cry out, “These men are slaves of the Most High God, who proclaim to you the way of salvation.”"
    },
    {
      "verse": 18,
      "text": "She kept doing this for many days. But Paul, very much annoyed, turned and said to the spirit, “I order you in the name of Jesus Christ to come out of her.” And it came out that very hour."
    },
    {
      "verse": 19,
      "text": "But when her owners saw that their hope of making money was gone, they seized Paul and Silas and dragged them into the marketplace before the authorities."
    },
    {
      "verse": 20,
      "text": "When they had brought them before the magistrates, they said, “These men, these Jews, are disturbing our city"
    },
    {
      "verse": 21,
      "text": "and are advocating customs that are not lawful for us, being Romans, to adopt or observe.”"
    },
    {
      "verse": 22,
      "text": "The crowd joined in attacking them, and the magistrates had them stripped of their clothing and ordered them to be beaten with rods."
    },
    {
      "verse": 23,
      "text": "After they had given them a severe flogging, they threw them into prison and ordered the jailer to keep them securely."
    },
    {
      "verse": 24,
      "text": "Following these instructions, he put them in the innermost cell and fastened their feet in the stocks."
    },
    {
      "verse": 25,
      "text": "About midnight Paul and Silas were praying and singing hymns to God, and the prisoners were listening to them."
    },
    {
      "verse": 26,
      "text": "Suddenly there was an earthquake so violent that the foundations of the prison were shaken, and immediately all the doors were opened and everyone’s chains were unfastened."
    },
    {
      "verse": 27,
      "text": "When the jailer woke up and saw the prison doors wide open, he drew his sword and was about to kill himself, since he supposed that the prisoners had escaped."
    },
    {
      "verse": 28,
      "text": "But Paul shouted in a loud voice, “Do not harm yourself, for we are all here.”"
    },
    {
      "verse": 29,
      "text": "The jailer called for lights, and rushing in, he fell down trembling before Paul and Silas."
    },
    {
      "verse": 30,
      "text": "Then he brought them outside and said, “Sirs, what must I do to be saved?”"
    },
    {
      "verse": 31,
      "text": "They answered, “Believe in the Lord Jesus, and you will be saved, you and your household.”"
    },
    {
      "verse": 32,
      "text": "They spoke the word of the Lord to him and to all who were in his house."
    },
    {
      "verse": 33,
      "text": "At the same hour of the night he took them and washed their wounds; then he and his entire family were baptized without delay."
    },
    {
      "verse": 34,
      "text": "He brought them up into the house and set food before them, and he and his entire household rejoiced that he had become a believer in God."
    },
    {
      "verse": 35,
      "text": "When morning came, the magistrates sent the police, saying, “Let those men go.”"
    },
    {
      "verse": 36,
      "text": "And the jailer reported the message to Paul, saying, “The magistrates sent word to let you go; therefore come out now and go in peace.”"
    },
    {
      "verse": 37,
      "text": "But Paul replied, “They have beaten us in public, uncondemned, men who are Romans, and have thrown us into prison, and now are they going to discharge us in secret? Certainly not! Let them come and take us out themselves.”"
    },
    {
      "verse": 38,
      "text": "The police reported these words to the magistrates, and they were afraid when they heard that they were Romans,"
    },
    {
      "verse": 39,
      "text": "so they came and apologized to them. And they took them out and asked them to leave the city."
    },
    {
      "verse": 40,
      "text": "After leaving the prison they went to Lydia’s home, and when they had seen and encouraged the brothers and sisters there, they departed."
    }
  ],
  "timestamp": "2025-08-08T15:51:46.783147"
}