{
  "book": "ACT",
  "book_name": "Acts",
  "chapter": 19,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ACT.19",
  "verses": [
    {
      "verse": 1,
      "text": "While Apollos was in Corinth, Paul passed through the interior regions and came to Ephesus, where he found some disciples."
    },
    {
      "verse": 2,
      "text": "He said to them, “Did you receive the Holy Spirit when you became believers?” They replied, “No, we have not even heard that there is a Holy Spirit.”"
    },
    {
      "verse": 3,
      "text": "Then he said, “Into what, then, were you baptized?” They answered, “Into John’s baptism.”"
    },
    {
      "verse": 4,
      "text": "Paul said, “John baptized with the baptism of repentance, telling the people to believe in the one who was to come after him, that is, in Jesus.”"
    },
    {
      "verse": 5,
      "text": "On hearing this, they were baptized in the name of the Lord Jesus."
    },
    {
      "verse": 6,
      "text": "When Paul had laid his hands on them, the Holy Spirit came upon them, and they spoke in tongues and prophesied;"
    },
    {
      "verse": 7,
      "text": "altogether there were about twelve of them."
    },
    {
      "verse": 8,
      "text": "He entered the synagogue and for three months spoke out boldly and argued persuasively about the kingdom of God."
    },
    {
      "verse": 9,
      "text": "When some stubbornly refused to believe and spoke evil of the Way before the congregation, he left them, taking the disciples with him, and argued daily in the lecture hall of Tyrannus."
    },
    {
      "verse": 10,
      "text": "This continued for two years, so that all the residents of Asia, both Jews and Greeks, heard the word of the Lord."
    },
    {
      "verse": 11,
      "text": "God did extraordinary miracles through Paul,"
    },
    {
      "verse": 12,
      "text": "so that when the handkerchiefs or aprons that had touched his skin were brought to the sick, their diseases left them, and the evil spirits came out of them."
    },
    {
      "verse": 13,
      "text": "Then some itinerant Jewish exorcists tried to use the name of the Lord Jesus over those who had evil spirits, saying, “I adjure you by the Jesus whom Paul proclaims.”"
    },
    {
      "verse": 14,
      "text": "Seven sons of a Jewish high priest named Sceva were doing this."
    },
    {
      "verse": 15,
      "text": "But the evil spirit said to them in reply, “Jesus I know, and Paul I know, but who are you?”"
    },
    {
      "verse": 16,
      "text": "Then the man with the evil spirit leaped on them, mastered them all, and so overpowered them that they fled out of the house naked and wounded."
    },
    {
      "verse": 17,
      "text": "When this became known to all residents of Ephesus, both Jews and Greeks, everyone was awestruck, and the name of the Lord Jesus was praised."
    },
    {
      "verse": 18,
      "text": "Also many of those who became believers confessed and disclosed their practices."
    },
    {
      "verse": 19,
      "text": "A number of those who practiced magic collected their books and burned them publicly; when the value of these books was calculated, it was found to come to fifty thousand silver coins."
    },
    {
      "verse": 20,
      "text": "So the word of the Lord grew mightily and prevailed."
    },
    {
      "verse": 21,
      "text": "Now after these things had been accomplished, Paul resolved in the Spirit to go through Macedonia and Achaia and then to go on to Jerusalem. He said, “After I have gone there, I must also see Rome.”"
    },
    {
      "verse": 22,
      "text": "So he sent two of his helpers, Timothy and Erastus, to Macedonia, while he himself stayed for some time longer in Asia."
    },
    {
      "verse": 23,
      "text": "About that time no little disturbance broke out concerning the Way."
    },
    {
      "verse": 24,
      "text": "A man named Demetrius, a silversmith who made silver shrines of Artemis, brought no little business to the artisans."
    },
    {
      "verse": 25,
      "text": "These he gathered together, with the workers of the same trade, and said, “Men, you know that we get our wealth from this business."
    },
    {
      "verse": 26,
      "text": "You also see and hear that not only in Ephesus but in almost the whole of Asia this Paul has persuaded and drawn away a considerable number of people by saying that gods made with hands are not gods."
    },
    {
      "verse": 27,
      "text": "And there is danger not only that this trade of ours may come into disrepute but also that the temple of the great goddess Artemis will be scorned, and she will be deprived of her majesty that brought all Asia and the world to worship her.”"
    },
    {
      "verse": 28,
      "text": "When they heard this, they were enraged and shouted, “Great is Artemis of the Ephesians!”"
    },
    {
      "verse": 29,
      "text": "The city was filled with the confusion, and people rushed together to the theater, dragging with them Gaius and Aristarchus, Macedonians who were Paul’s travel companions."
    },
    {
      "verse": 30,
      "text": "Paul wished to go into the crowd, but the disciples would not let him;"
    },
    {
      "verse": 31,
      "text": "even some officials of the province of Asia who were friendly to him sent him a message urging him not to venture into the theater."
    },
    {
      "verse": 32,
      "text": "Meanwhile, some were shouting one thing, some another, for the assembly was in confusion, and most of them did not know why they had come together."
    },
    {
      "verse": 33,
      "text": "Some of the crowd gave instructions to Alexander, whom the Jews had pushed forward. And Alexander motioned for silence and tried to make a defense before the people."
    },
    {
      "verse": 34,
      "text": "But when they recognized that he was a Jew, for about two hours all of them shouted in unison, “Great is Artemis of the Ephesians!”"
    },
    {
      "verse": 35,
      "text": "But when the town clerk had quieted the crowd, he said, “Citizens of Ephesus, who is there who does not know that the city of the Ephesians is the temple keeper of the great Artemis and of the statue that fell from heaven?"
    },
    {
      "verse": 36,
      "text": "Since these things cannot be denied, you ought to be quiet and do nothing rash."
    },
    {
      "verse": 37,
      "text": "You have brought these men here who are neither temple robbers nor blasphemers of our goddess."
    },
    {
      "verse": 38,
      "text": "If therefore Demetrius and the artisans with him have a complaint against anyone, the courts are open, and there are proconsuls; let them bring charges there against one another."
    },
    {
      "verse": 39,
      "text": "If there is anything further you want to know, it must be settled in the regular assembly."
    },
    {
      "verse": 40,
      "text": "For we are in danger of being charged with rioting today, since there is no cause that we can give to justify this commotion.”"
    },
    {
      "verse": 41,
      "text": "When he had said this, he dismissed the assembly."
    }
  ],
  "timestamp": "2025-08-08T15:51:47.300436"
}