{
  "book": "ACT",
  "book_name": "Acts",
  "chapter": 14,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ACT.14",
  "verses": [
    {
      "verse": 1,
      "text": "The same thing occurred in Iconium, where Paul and Barnabas went into the Jewish synagogue and spoke in such a way that a great number of both Jews and Greeks became believers."
    },
    {
      "verse": 2,
      "text": "But the unbelieving Jews stirred up the gentiles and poisoned their minds against the brothers."
    },
    {
      "verse": 3,
      "text": "So they remained for a long time speaking boldly for the Lord, who testified to the word of his grace by granting signs and wonders to be done through them."
    },
    {
      "verse": 4,
      "text": "But the residents of the city were divided: some sided with the Jews, and some with the apostles."
    },
    {
      "verse": 5,
      "text": "And when an attempt was made by both gentiles and Jews, with their rulers, to mistreat them and to stone them,"
    },
    {
      "verse": 6,
      "text": "the apostles learned of it and fled to Lystra and Derbe, cities of Lycaonia, and to the surrounding region,"
    },
    {
      "verse": 7,
      "text": "and there they continued proclaiming the good news."
    },
    {
      "verse": 8,
      "text": "In Lystra there was a man sitting who could not use his feet and had never walked, for he had been lame from birth."
    },
    {
      "verse": 9,
      "text": "He listened to Paul as he was speaking. And Paul, looking at him intently and seeing that he had faith to be healed,"
    },
    {
      "verse": 10,
      "text": "said in a loud voice, “Stand upright on your feet.” And the man sprang up and began to walk."
    },
    {
      "verse": 11,
      "text": "When the crowds saw what Paul had done, they shouted in the Lycaonian language, “The gods have come down to us in human form!”"
    },
    {
      "verse": 12,
      "text": "Barnabas they called Zeus, and Paul they called Hermes, because he was the chief speaker."
    },
    {
      "verse": 13,
      "text": "The priest of Zeus, whose temple was just outside the city, brought oxen and garlands to the gates; he and the crowds wanted to offer sacrifice."
    },
    {
      "verse": 14,
      "text": "When the apostles Barnabas and Paul heard of it, they tore their clothes and rushed out into the crowd, shouting,"
    },
    {
      "verse": 15,
      "text": "“People, why are you doing this? We are mortals just like you, and we bring you good news, that you should turn from these worthless things to the living God, who made the heaven and the earth and the sea and all that is in them."
    },
    {
      "verse": 16,
      "text": "In past generations he allowed all peoples to follow their own ways,"
    },
    {
      "verse": 17,
      "text": "yet he has not left himself without a witness in doing good, giving you rains from heaven and fruitful seasons and filling you with food and your hearts with joy.”"
    },
    {
      "verse": 18,
      "text": "Even with these words, they scarcely restrained the crowds from offering sacrifice to them."
    },
    {
      "verse": 19,
      "text": "But Jews came there from Antioch and Iconium and won over the crowds. Then they stoned Paul and dragged him out of the city, supposing that he was dead."
    },
    {
      "verse": 20,
      "text": "But when the disciples surrounded him, he got up and went into the city. The next day he went on with Barnabas to Derbe."
    },
    {
      "verse": 21,
      "text": "After they had proclaimed the good news to that city and had made many disciples, they returned to Lystra, then on to Iconium and Antioch."
    },
    {
      "verse": 22,
      "text": "There they strengthened the souls of the disciples and encouraged them to continue in the faith, saying, “It is through many persecutions that we must enter the kingdom of God.”"
    },
    {
      "verse": 23,
      "text": "And after they had appointed elders for them in each church, with prayer and fasting they entrusted them to the Lord in whom they had come to believe."
    },
    {
      "verse": 24,
      "text": "Then they passed through Pisidia and came to Pamphylia."
    },
    {
      "verse": 25,
      "text": "When they had spoken the word in Perga, they went down to Attalia."
    },
    {
      "verse": 26,
      "text": "From there they sailed back to Antioch, where they had been commended to the grace of God for the work that they had completed."
    },
    {
      "verse": 27,
      "text": "When they arrived, they called the church together and related all that God had done with them and how he had opened a door of faith for the gentiles."
    },
    {
      "verse": 28,
      "text": "And they stayed there with the disciples for some time."
    }
  ],
  "timestamp": "2025-08-08T15:51:46.556488"
}