{
  "book": "DEU",
  "book_name": "Deuteronomy",
  "chapter": 31,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/DEU.31",
  "verses": [
    {
      "verse": 1,
      "text": "When Moses had finished speaking all these words to all Israel,"
    },
    {
      "verse": 2,
      "text": "he said to them, “I am now one hundred twenty years old. I am no longer able to get about, and the Lord has told me, ‘You shall not cross over this Jordan.’"
    },
    {
      "verse": 3,
      "text": "The Lord your God himself will cross over before you. He will destroy these nations before you, and you shall dispossess them. Joshua also will cross over before you, as the Lord promised."
    },
    {
      "verse": 4,
      "text": "The Lord will do to them as he did to Sihon and Og, the kings of the Amorites, and to their land, when he destroyed them."
    },
    {
      "verse": 5,
      "text": "The Lord will give them over to you, and you shall deal with them in full accord with the command that I have given to you."
    },
    {
      "verse": 6,
      "text": "Be strong and bold; have no fear or dread of them, because it is the Lord your God who goes with you; he will not fail you or forsake you.”"
    },
    {
      "verse": 7,
      "text": "Then Moses summoned Joshua and said to him in the sight of all Israel, “Be strong and bold, for you are the one who will go with this people into the land that the Lord has sworn to their ancestors to give them, and you will put them in possession of it."
    },
    {
      "verse": 8,
      "text": "It is the Lord who goes before you. He will be with you; he will not fail you or forsake you. Do not fear or be dismayed.”"
    },
    {
      "verse": 9,
      "text": "Then Moses wrote down this law and gave it to the priests, the sons of Levi, who carried the ark of the covenant of the Lord, and to all the elders of Israel."
    },
    {
      "verse": 10,
      "text": "Moses commanded them, “Every seventh year, in the scheduled year of remission, during the Festival of Booths,"
    },
    {
      "verse": 11,
      "text": "when all Israel comes to appear before the Lord your God at the place that he will choose, you shall read this law before all Israel in their hearing."
    },
    {
      "verse": 12,
      "text": "Assemble the people—men, women, and children, as well as the aliens residing in your towns—so that they may hear and learn to fear the Lord your God and to observe diligently all the words of this law"
    },
    {
      "verse": 13,
      "text": "and so that their children, who have not known it, may hear and learn to fear the Lord your God, as long as you live in the land that you are crossing over the Jordan to possess.”"
    },
    {
      "verse": 14,
      "text": "The Lord said to Moses, “Your time to die is near; call Joshua and present yourselves in the tent of meeting, so that I may commission him.” So Moses and Joshua went and presented themselves in the tent of meeting,"
    },
    {
      "verse": 15,
      "text": "and the Lord appeared at the tent in a pillar of cloud; the pillar of cloud stood at the entrance to the tent."
    },
    {
      "verse": 16,
      "text": "The Lord said to Moses, “Soon you will lie down with your ancestors. Then this people will begin to prostitute themselves to the foreign gods in their midst, the gods of the land into which they are going; they will forsake me, breaking my covenant that I have made with them."
    },
    {
      "verse": 17,
      "text": "My anger will be kindled against them on that day. I will forsake them and hide my face from them; they will become easy prey, and many terrible troubles will come upon them. On that day they will say, ‘Have not these troubles come upon us because our God is not in our midst?’"
    },
    {
      "verse": 18,
      "text": "On that day I will surely hide my face on account of all the evil they have done by turning to other gods."
    },
    {
      "verse": 19,
      "text": "Now, therefore, write this song, and teach it to the Israelites; put it in their mouths, in order that this song may be a witness for me against the Israelites."
    },
    {
      "verse": 20,
      "text": "For when I have brought them into the land flowing with milk and honey, which I promised on oath to their ancestors, and they have eaten their fill and grown fat, they will turn to other gods and serve them, despising me and breaking my covenant."
    },
    {
      "verse": 21,
      "text": "And when many terrible troubles come upon them, this song will confront them as a witness because it will not be lost from the mouths of their descendants. For I know what they are inclined to do even now, before I have brought them into the land that I promised them on oath.”"
    },
    {
      "verse": 22,
      "text": "That very day Moses wrote this song and taught it to the Israelites."
    },
    {
      "verse": 23,
      "text": "Then the Lord commissioned Joshua son of Nun and said, “Be strong and bold, for you shall bring the Israelites into the land that I promised them; I will be with you.”"
    },
    {
      "verse": 24,
      "text": "When Moses had finished writing down in a book the words of this law to the very end,"
    },
    {
      "verse": 25,
      "text": "Moses commanded the Levites who carried the ark of the covenant of the Lord, saying,"
    },
    {
      "verse": 26,
      "text": "“Take this book of the law and put it beside the ark of the covenant of the Lord your God; let it remain there as a witness against you."
    },
    {
      "verse": 27,
      "text": "For I know well how rebellious and stubborn you are. If you already have been so rebellious toward the Lord while I am still alive among you, how much more after my death!"
    },
    {
      "verse": 28,
      "text": "Assemble to me all the elders of your tribes and your officials, so that I may recite these words in their hearing and call heaven and earth to witness against them."
    },
    {
      "verse": 29,
      "text": "For I know that after my death you will surely act corruptly, turning aside from the way that I have commanded you. In time to come trouble will befall you, because you will do what is evil in the sight of the Lord, provoking him to anger through the work of your hands.”"
    },
    {
      "verse": 30,
      "text": "Then Moses recited the words of this song, to the very end, in the hearing of the whole assembly of Israel:"
    }
  ],
  "timestamp": "2025-08-08T15:48:40.343093"
}