{
  "book": "DEU",
  "book_name": "Deuteronomy",
  "chapter": 21,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/DEU.21",
  "verses": [
    {
      "verse": 1,
      "text": "“If, in the land that the Lord your God is giving you to possess, a body is found lying in open country, and it is not known who struck the person down,"
    },
    {
      "verse": 2,
      "text": "then your elders and your judges shall come out to measure the distances to the towns that are near the body."
    },
    {
      "verse": 3,
      "text": "The elders of the town nearest the body shall take a heifer that has never been worked, one that has not pulled in the yoke;"
    },
    {
      "verse": 4,
      "text": "the elders of that town shall bring the heifer down to a wadi with running water, which is neither plowed nor sown, and shall break the heifer’s neck there in the wadi."
    },
    {
      "verse": 5,
      "text": "Then the priests, the sons of Levi, shall come forward, for the Lord your God has chosen them to minister to him and to pronounce blessings in the name of the Lord, and by their decision all cases of dispute and assault shall be settled."
    },
    {
      "verse": 6,
      "text": "All the elders of that town nearest the body shall wash their hands over the heifer whose neck was broken in the wadi,"
    },
    {
      "verse": 7,
      "text": "and they shall declare, ‘Our hands did not shed this blood, nor were we witnesses to it."
    },
    {
      "verse": 8,
      "text": "Absolve, O Lord, your people Israel, whom you redeemed; do not let the guilt of innocent blood remain in the midst of your people Israel.’ Then they will be absolved of bloodguilt."
    },
    {
      "verse": 9,
      "text": "So you shall purge the guilt of innocent blood from your midst, because you must do what is right in the sight of the Lord."
    },
    {
      "verse": 10,
      "text": "“When you go out to war against your enemies and the Lord your God hands them over to you and you take them captive,"
    },
    {
      "verse": 11,
      "text": "suppose you see among the captives a beautiful woman whom you desire and want to marry,"
    },
    {
      "verse": 12,
      "text": "and so you bring her home to your house: she shall shave her head, pare her nails,"
    },
    {
      "verse": 13,
      "text": "discard her captive’s garb, and remain in your house a full month mourning for her father and mother; after that you may go in to her and be her husband, and she shall be your wife."
    },
    {
      "verse": 14,
      "text": "But if you are not satisfied with her, you shall let her go free and certainly not sell her for money. You must not treat her as a slave, since you have dishonored her."
    },
    {
      "verse": 15,
      "text": "“If a man has two wives, one of them loved and the other disliked, and if both the loved and the disliked have borne him sons, the firstborn being the son of the one who is disliked,"
    },
    {
      "verse": 16,
      "text": "then on the day when he wills his possessions to his sons, he is not permitted to treat the son of the loved as the firstborn in preference to the son of the disliked, who is the firstborn."
    },
    {
      "verse": 17,
      "text": "He must acknowledge as firstborn the son of the one who is disliked, giving him a double portion of all that he has; since he is the first issue of his virility, the right of the firstborn is his."
    },
    {
      "verse": 18,
      "text": "“If someone has a stubborn and rebellious son who will not obey his father and mother, who does not heed them when they discipline him,"
    },
    {
      "verse": 19,
      "text": "then his father and his mother shall take hold of him and bring him out to the elders of his town at the gate of that place."
    },
    {
      "verse": 20,
      "text": "They shall say to the elders of his town, ‘This son of ours is stubborn and rebellious. He will not obey us. He is a glutton and a drunkard.’"
    },
    {
      "verse": 21,
      "text": "Then all the men of the town shall stone him to death. So you shall purge the evil from your midst, and all Israel will hear and be afraid."
    },
    {
      "verse": 22,
      "text": "“When someone is convicted of a crime punishable by death and is executed and you hang him on a tree,"
    },
    {
      "verse": 23,
      "text": "his corpse must not remain all night upon the tree; you must bury him that same day, for anyone hung on a tree is under God’s curse. You must not defile the land that the Lord your God is giving you for possession."
    }
  ],
  "timestamp": "2025-08-08T15:48:38.878948"
}