{
  "book": "EPH",
  "book_name": "Ephesians",
  "chapter": 4,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/EPH.4",
  "verses": [
    {
      "verse": 1,
      "text": "I, therefore, the prisoner in the Lord, beg you to walk in a manner worthy of the calling to which you have been called,"
    },
    {
      "verse": 2,
      "text": "with all humility and gentleness, with patience, bearing with one another in love,"
    },
    {
      "verse": 3,
      "text": "making every effort to maintain the unity of the Spirit in the bond of peace:"
    },
    {
      "verse": 4,
      "text": "there is one body and one Spirit, just as you were called to the one hope of your calling,"
    },
    {
      "verse": 5,
      "text": "one Lord, one faith, one baptism,"
    },
    {
      "verse": 6,
      "text": "one God and Father of all, who is above all and through all and in all."
    },
    {
      "verse": 7,
      "text": "But each of us was given grace according to the measure of Christ’s gift."
    },
    {
      "verse": 8,
      "text": "Therefore it is said, “When he ascended on high, he made captivity itself a captive; he gave gifts to his people.”"
    },
    {
      "verse": 9,
      "text": "(When it says, “He ascended,” what does it mean but that he had also descended into the lower parts of the earth?"
    },
    {
      "verse": 10,
      "text": "He who descended is the same one who ascended far above all the heavens, so that he might fill all things.)"
    },
    {
      "verse": 11,
      "text": "He himself granted that some are apostles, prophets, evangelists, pastors and teachers"
    },
    {
      "verse": 12,
      "text": "to equip the saints for the work of ministry, for building up the body of Christ,"
    },
    {
      "verse": 13,
      "text": "until all of us come to the unity of the faith and of the knowledge of the Son of God, to maturity, to the measure of the full stature of Christ."
    },
    {
      "verse": 14,
      "text": "We must no longer be children, tossed to and fro and blown about by every wind of doctrine by people’s trickery, by their craftiness in deceitful scheming;"
    },
    {
      "verse": 15,
      "text": "but speaking the truth in love, we must grow up in every way into him who is the head, into Christ,"
    },
    {
      "verse": 16,
      "text": "from whom the whole body, joined and knit together by every ligament with which it is equipped, as each part is working properly, promotes the body’s growth in building itself up in love."
    },
    {
      "verse": 17,
      "text": "Now this I affirm and insist on in the Lord: you must no longer walk as the gentiles walk, in the futility of their minds;"
    },
    {
      "verse": 18,
      "text": "they are darkened in their understanding, alienated from the life of God because of their ignorance and hardness of heart."
    },
    {
      "verse": 19,
      "text": "They have lost all sensitivity and have abandoned themselves to licentiousness, greedy to practice every kind of impurity."
    },
    {
      "verse": 20,
      "text": "That is not the way you learned Christ!"
    },
    {
      "verse": 21,
      "text": "For surely you have heard about him and were taught in him, as truth is in Jesus,"
    },
    {
      "verse": 22,
      "text": "to put away your former way of life, your old self, corrupt and deluded by its lusts,"
    },
    {
      "verse": 23,
      "text": "and to be renewed in the spirit of your minds,"
    },
    {
      "verse": 24,
      "text": "and to clothe yourselves with the new self, created according to the likeness of God in true righteousness and holiness."
    },
    {
      "verse": 25,
      "text": "So then, putting away falsehood, let each of you speak the truth with your neighbor, for we are members of one another."
    },
    {
      "verse": 26,
      "text": "Be angry but do not sin; do not let the sun go down on your anger,"
    },
    {
      "verse": 27,
      "text": "and do not make room for the devil."
    },
    {
      "verse": 29,
      "text": "Let no evil talk come out of your mouths but only what is good for building up, as there is need, so that your words may give grace to those who hear."
    },
    {
      "verse": 30,
      "text": "And do not grieve the Holy Spirit of God, with which you were marked with a seal for the day of redemption."
    },
    {
      "verse": 31,
      "text": "Put away from you all bitterness and wrath and anger and wrangling and slander, together with all malice."
    },
    {
      "verse": 32,
      "text": "Be kind to one another, tenderhearted, forgiving one another, as God in Christ has forgiven you."
    }
  ],
  "timestamp": "2025-08-08T15:52:03.957791"
}