{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 18,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/EXO.18",
  "verses": [
    {
      "verse": 1,
      "text": "Jethro, the priest of Midian, Moses’s father-in-law, heard of all that God had done for Moses and for his people Israel, how the Lord had brought Israel out of Egypt."
    },
    {
      "verse": 2,
      "text": "After Moses had sent away his wife Zipporah, his father-in-law Jethro took her back,"
    },
    {
      "verse": 3,
      "text": "along with her two sons. The name of the one was Gershom (for he had said, “I have been an alien in a foreign land”),"
    },
    {
      "verse": 4,
      "text": "and the name of the other was Eliezer (for he had said, “The God of my father was my help and delivered me from the sword of Pharaoh”)."
    },
    {
      "verse": 5,
      "text": "Jethro, Moses’s father-in-law, along with Moses’s sons and wife, came into the wilderness where Moses was encamped at the mountain of God."
    },
    {
      "verse": 6,
      "text": "He sent word to Moses, “I, your father-in-law Jethro, am coming to you, with your wife and her two sons.”"
    },
    {
      "verse": 7,
      "text": "So Moses went out to meet his father-in-law; he bowed down and kissed him; each asked after the other’s welfare, and they went into the tent."
    },
    {
      "verse": 8,
      "text": "Then Moses told his father-in-law all that the Lord had done to Pharaoh and to the Egyptians for Israel’s sake, all the hardship that had found them on the way, and how the Lord had delivered them."
    },
    {
      "verse": 9,
      "text": "Jethro rejoiced for all the good that the Lord had done to Israel, in delivering them from the Egyptians."
    },
    {
      "verse": 10,
      "text": "Jethro said, “Blessed be the Lord, who has delivered you from the Egyptians and from Pharaoh."
    },
    {
      "verse": 11,
      "text": "Now I know that the Lord is greater than all gods, because he delivered the people from the Egyptians, when they dealt arrogantly with them.”"
    },
    {
      "verse": 12,
      "text": "And Jethro, Moses’s father-in-law, brought a burnt offering and sacrifices to God, and Aaron came with all the elders of Israel to eat bread with Moses’s father-in-law in the presence of God."
    },
    {
      "verse": 13,
      "text": "The next day Moses sat as judge for the people, while the people stood around him from morning until evening."
    },
    {
      "verse": 14,
      "text": "When Moses’s father-in-law saw all that he was doing for the people, he said, “What is this that you are doing for the people? Why do you sit alone, while all the people stand around you from morning until evening?”"
    },
    {
      "verse": 15,
      "text": "Moses said to his father-in-law, “Because the people come to me to inquire of God."
    },
    {
      "verse": 16,
      "text": "When they have a dispute, they come to me, and I decide between one person and another, and I make known to them the statutes and instructions of God.”"
    },
    {
      "verse": 17,
      "text": "Moses’s father-in-law said to him, “What you are doing is not good."
    },
    {
      "verse": 18,
      "text": "You will surely wear yourself out, both you and these people with you, for the task is too heavy for you; you cannot do it alone."
    },
    {
      "verse": 19,
      "text": "Now listen to me. I will give you counsel, and God be with you! You should represent the people before God and bring their cases to God."
    },
    {
      "verse": 20,
      "text": "Teach them the statutes and instructions and make known to them the way they are to go and the things they are to do."
    },
    {
      "verse": 21,
      "text": "You should also look for able men among all the people, men who fear God, are trustworthy, and hate dishonest gain; set them as officers over thousands, hundreds, fifties, and tens."
    },
    {
      "verse": 22,
      "text": "Let them sit as judges for the people at all times; let them bring every important case to you but decide every minor case themselves. So it will be easier for you, and they will bear the burden with you."
    },
    {
      "verse": 23,
      "text": "If you do this and God so commands you, then you will be able to endure, and all these people will go to their homes in peace.”"
    },
    {
      "verse": 24,
      "text": "So Moses listened to his father-in-law and did all that he had said."
    },
    {
      "verse": 25,
      "text": "Moses chose able men from all Israel and appointed them as heads over the people, as officers over thousands, hundreds, fifties, and tens."
    },
    {
      "verse": 26,
      "text": "And they judged the people at all times; hard cases they brought to Moses, but any minor case they decided themselves."
    },
    {
      "verse": 27,
      "text": "Then Moses let his father-in-law depart, and he went off to his own country."
    }
  ],
  "timestamp": "2025-08-08T15:48:18.532559"
}