{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 22,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/EXO.22",
  "verses": [
    {
      "verse": 1,
      "text": "“When someone steals an ox or a sheep and slaughters it or sells it, the thief shall pay five oxen for an ox and four sheep for a sheep."
    },
    {
      "verse": 2,
      "text": "(If the thief is found breaking in and is struck dead, no bloodguilt is incurred;"
    },
    {
      "verse": 3,
      "text": "but if it happens after sunrise, bloodguilt is incurred.) The thief shall make full restitution or, if unable to do so, shall be sold for the theft."
    },
    {
      "verse": 4,
      "text": "When the animal, whether ox or donkey or sheep, is found alive in the thief’s possession, the thief shall pay double."
    },
    {
      "verse": 5,
      "text": "“When someone causes a field or vineyard to be grazed over or lets livestock loose to graze in someone else’s field, restitution shall be made from the best in the owner’s field or vineyard."
    },
    {
      "verse": 6,
      "text": "“When fire breaks out and catches in thorns so that the stacked grain or the standing grain or the field is consumed, the one who started the fire shall make full restitution."
    },
    {
      "verse": 7,
      "text": "“When someone delivers to a neighbor money or goods for safekeeping and they are stolen from the neighbor’s house, then the thief, if caught, shall pay double."
    },
    {
      "verse": 8,
      "text": "If the thief is not caught, the owner of the house shall be brought before God, to determine whether or not the owner had laid hands on the neighbor’s goods."
    },
    {
      "verse": 9,
      "text": "“In any case of disputed ownership involving ox, donkey, sheep, clothing, or any other loss, of which one party says, ‘This is mine,’ the case of both parties shall come before God; the one whom God condemns shall pay double to the other."
    },
    {
      "verse": 10,
      "text": "“When someone delivers to another a donkey, ox, sheep, or any other animal for safekeeping and it dies or is injured or is carried off without anyone seeing it,"
    },
    {
      "verse": 11,
      "text": "an oath before the Lord shall decide between the two of them that the one has not laid hands on the property of the other; the owner shall accept the oath, and no restitution shall be made."
    },
    {
      "verse": 12,
      "text": "But if it was stolen, restitution shall be made to its owner."
    },
    {
      "verse": 13,
      "text": "If it was mangled by beasts, let it be brought as evidence; restitution shall not be made for the mangled remains."
    },
    {
      "verse": 14,
      "text": "“When someone borrows an animal from another and it is injured or dies, the owner not being present, full restitution shall be made."
    },
    {
      "verse": 15,
      "text": "If the owner was present, there shall be no restitution; if it was hired, only the hiring fee is due."
    },
    {
      "verse": 16,
      "text": "“When a man seduces a virgin who is not engaged to be married and lies with her, he shall give the bride-price for her and make her his wife."
    },
    {
      "verse": 17,
      "text": "But if her father refuses to give her to him, he shall pay an amount equal to the bride-price for virgins."
    },
    {
      "verse": 18,
      "text": "“You shall not permit a female sorcerer to live."
    },
    {
      "verse": 19,
      "text": "“Whoever has intercourse with an animal shall be put to death."
    },
    {
      "verse": 20,
      "text": "“Whoever sacrifices to any god other than the Lord alone shall be devoted to destruction."
    },
    {
      "verse": 21,
      "text": "“You shall not wrong or oppress a resident alien, for you were aliens in the land of Egypt."
    },
    {
      "verse": 22,
      "text": "You shall not abuse any widow or orphan."
    },
    {
      "verse": 23,
      "text": "If you do abuse them, when they cry out to me, I will surely heed their cry;"
    },
    {
      "verse": 24,
      "text": "my wrath will burn, and I will kill you with the sword, and your wives shall become widows and your children orphans."
    },
    {
      "verse": 25,
      "text": "“If you lend money to my people, to the poor among you, you shall not deal with them as a creditor; you shall not exact interest from them."
    },
    {
      "verse": 26,
      "text": "If you take your neighbor’s cloak as guarantee, you shall restore it before the sun goes down,"
    },
    {
      "verse": 27,
      "text": "for it may be your neighbor’s only clothing to use as a cover. In what else shall that person sleep? And when your neighbor cries out to me, I will listen, for I am compassionate."
    },
    {
      "verse": 28,
      "text": "“You shall not revile God or curse a leader of your people."
    },
    {
      "verse": 29,
      "text": "“You shall not delay to make offerings from the fullness of your harvest and from the outflow of your presses. “The firstborn of your sons you shall give to me."
    },
    {
      "verse": 30,
      "text": "You shall do the same with your oxen and with your sheep: seven days it shall remain with its mother; on the eighth day you shall give it to me."
    },
    {
      "verse": 31,
      "text": "“You shall be people consecrated to me, so you shall not eat any meat that is mangled by beasts in the field; you shall throw it to the dogs."
    }
  ],
  "timestamp": "2025-08-08T15:48:19.135043"
}