{
  "book": "EXO",
  "book_name": "Exodus",
  "chapter": 13,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/EXO.13",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord said to Moses,"
    },
    {
      "verse": 2,
      "text": "“Consecrate to me all the firstborn; whatever is the first to open the womb among the Israelites, of human beings and animals, is mine.”"
    },
    {
      "verse": 3,
      "text": "Moses said to the people, “Remember this day on which you came out of Egypt, out of the house of slavery, because the Lord brought you out from there by strength of hand; no leavened bread shall be eaten."
    },
    {
      "verse": 4,
      "text": "Today, in the month of Abib, you are going out."
    },
    {
      "verse": 5,
      "text": "When the Lord brings you into the land of the Canaanites, the Hittites, the Amorites, the Hivites, and the Jebusites, which he swore to your ancestors to give you, a land flowing with milk and honey, you shall keep this observance in this month."
    },
    {
      "verse": 6,
      "text": "Seven days you shall eat unleavened bread, and on the seventh day there shall be a festival to the Lord."
    },
    {
      "verse": 7,
      "text": "Unleavened bread shall be eaten for seven days; no leavened bread shall be seen in your possession, and no leaven shall be seen among you in all your territory."
    },
    {
      "verse": 8,
      "text": "You shall tell your child on that day, ‘It is because of what the Lord did for me when I came out of Egypt.’"
    },
    {
      "verse": 9,
      "text": "It shall serve for you as a sign on your hand and as a reminder on your forehead, so that the teaching of the Lord may be on your lips, for with a strong hand the Lord brought you out of Egypt."
    },
    {
      "verse": 10,
      "text": "You shall keep this ordinance at its proper time from year to year."
    },
    {
      "verse": 11,
      "text": "“When the Lord has brought you into the land of the Canaanites, as he swore to you and your ancestors, and has given it to you,"
    },
    {
      "verse": 12,
      "text": "you shall set apart to the Lord all that first opens the womb. All the firstborn offspring of your livestock that are males shall be the Lord ’s."
    },
    {
      "verse": 13,
      "text": "But every firstborn donkey you shall redeem with a sheep; if you do not redeem it, you must break its neck. Every firstborn male among your children you shall redeem."
    },
    {
      "verse": 14,
      "text": "When in the future your child asks you, ‘What does this mean?’ you shall answer, ‘By strength of hand the Lord brought us out of Egypt, from the house of slavery."
    },
    {
      "verse": 15,
      "text": "When Pharaoh stubbornly refused to let us go, the Lord killed all the firstborn in the land of Egypt, from human firstborn to the firstborn of animals. Therefore I sacrifice to the Lord every male that first opens the womb, but every firstborn of my sons I redeem.’"
    },
    {
      "verse": 16,
      "text": "It shall serve as a sign on your hand and as an emblem on your forehead that by strength of hand the Lord brought us out of Egypt.”"
    },
    {
      "verse": 17,
      "text": "When Pharaoh let the people go, God did not lead them by way of the land of the Philistines, although that was nearer, for God thought, “If the people face war, they may change their minds and return to Egypt.”"
    },
    {
      "verse": 18,
      "text": "So God led the people by the roundabout way of the wilderness bordering the Red Sea. The Israelites went up out of the land of Egypt prepared for battle."
    },
    {
      "verse": 19,
      "text": "And Moses took with him the bones of Joseph, who had required a solemn oath of the Israelites, saying, “God will surely come to you, and then you must carry my bones with you from here.”"
    },
    {
      "verse": 20,
      "text": "They set out from Succoth and camped at Etham, on the edge of the wilderness."
    },
    {
      "verse": 21,
      "text": "The Lord went in front of them in a pillar of cloud by day, to lead them along the way, and in a pillar of fire by night, to give them light, so that they might travel by day and by night."
    },
    {
      "verse": 22,
      "text": "Neither the pillar of cloud by day nor the pillar of fire by night left its place in front of the people."
    }
  ],
  "timestamp": "2025-08-08T15:48:17.834763"
}