{
  "book": "EZK",
  "book_name": "Ezekiel",
  "chapter": 17,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/EZK.17",
  "verses": [
    {
      "verse": 1,
      "text": "The word of the Lord came to me:"
    },
    {
      "verse": 2,
      "text": "O mortal, propound a riddle and speak an allegory to the house of Israel."
    },
    {
      "verse": 3,
      "text": "Say: Thus says the Lord God: A great eagle with great wings and long pinions, rich in plumage of many colors, came to the Lebanon. He took the top of the cedar,"
    },
    {
      "verse": 4,
      "text": "broke off its topmost shoot; he carried it to a land of trade, set it in a city of merchants."
    },
    {
      "verse": 5,
      "text": "Then he took a seedling from the land, placed it in fertile soil; a plant by abundant waters, he set it like a willow twig."
    },
    {
      "verse": 6,
      "text": "It sprouted and became a vine spreading out but low; its branches turned toward him; its roots remained where it stood. So it became a vine; it brought forth branches, put forth foliage."
    },
    {
      "verse": 7,
      "text": "There was another great eagle with great wings and much plumage. And see! This vine stretched out its roots toward him; it shot out its branches toward him from the bed where it was planted so that he might water it."
    },
    {
      "verse": 8,
      "text": "It had been transplanted to good soil by abundant waters, so that it might produce branches and bear fruit and become a noble vine."
    },
    {
      "verse": 9,
      "text": "Say: Thus says the Lord God: Will it prosper? Will he not pull up its roots, cause its fruit to rot and wither, its fresh sprouting leaves to fade? No strong arm or mighty army will be needed to pull it from its roots."
    },
    {
      "verse": 10,
      "text": "Look, it has been transplanted. Will it thrive? When the east wind strikes it, will it not utterly wither, wither on the bed where it grew?"
    },
    {
      "verse": 11,
      "text": "Then the word of the Lord came to me:"
    },
    {
      "verse": 12,
      "text": "Say now to the rebellious house: Do you not know what these things mean? Tell them: The king of Babylon came to Jerusalem, took its king and its officials, and brought them back with him to Babylon."
    },
    {
      "verse": 13,
      "text": "He took one of the royal offspring and made a covenant with him, putting him under oath (he had taken away the chief men of the land),"
    },
    {
      "verse": 14,
      "text": "so that the kingdom might be humble and not lift itself up and that by keeping his covenant it might stand."
    },
    {
      "verse": 15,
      "text": "But he rebelled against him by sending ambassadors to Egypt, that they might give him horses and a large army. Will he succeed? Can one escape who does such things? Can he break the covenant and yet escape?"
    },
    {
      "verse": 16,
      "text": "As I live, says the Lord God, surely in the place where the king resides who made him king, whose oath he despised and whose covenant with him he broke—in Babylon he shall die."
    },
    {
      "verse": 17,
      "text": "Pharaoh with his mighty army and great company will not help him in war, when ramps are cast up and siege walls built to cut off many lives."
    },
    {
      "verse": 18,
      "text": "Because he despised the oath and broke the covenant, because he gave his hand and yet did all these things, he shall not escape."
    },
    {
      "verse": 19,
      "text": "Therefore thus says the Lord God: As I live, I will surely return upon his head my oath that he despised and my covenant that he broke."
    },
    {
      "verse": 20,
      "text": "I will spread my net over him, and he shall be caught in my snare; I will bring him to Babylon and enter into judgment with him there for the treason he has committed against me."
    },
    {
      "verse": 21,
      "text": "All the pick of his troops shall fall by the sword, and the survivors shall be scattered to every wind, and you shall know that I, the Lord, have spoken."
    },
    {
      "verse": 22,
      "text": "Thus says the Lord God: I myself will take a sprig from the lofty top of the cedar; I will set it out. I will break off a tender shoot from the topmost of its young twigs; I myself will transplant it on a high and lofty mountain."
    },
    {
      "verse": 23,
      "text": "On the mountain height of Israel I will transplant it, and it will produce boughs and bear fruit and become a noble cedar. Under it every kind of bird will live; in the shade of its branches will nest winged creatures of every kind."
    },
    {
      "verse": 24,
      "text": "All the trees of the field shall know that I am the Lord. I bring low the high tree; I make high the low tree; I dry up the green tree and make the dry tree flourish. I the Lord have spoken; I will accomplish it."
    }
  ],
  "timestamp": "2025-08-08T15:50:48.467052"
}