{
  "book": "EZK",
  "book_name": "Ezekiel",
  "chapter": 22,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/EZK.22",
  "verses": [
    {
      "verse": 1,
      "text": "The word of the Lord came to me:"
    },
    {
      "verse": 2,
      "text": "You, mortal, will you judge, will you judge the bloody city? Then declare to it all its abominable deeds."
    },
    {
      "verse": 3,
      "text": "You shall say: Thus says the Lord God: A city! Shedding blood within itself; its time has come; making its idols, defiling itself."
    },
    {
      "verse": 4,
      "text": "You have become guilty by the blood that you have shed and defiled by the idols that you have made; you have brought your days near; the appointed time of your years has come. Therefore I have made you a disgrace before the nations and a mockery to all the countries."
    },
    {
      "verse": 5,
      "text": "Those who are near and those who are far from you will mock you, you infamous one, full of tumult."
    },
    {
      "verse": 6,
      "text": "The princes of Israel in you, everyone according to his power, have been bent on shedding blood."
    },
    {
      "verse": 7,
      "text": "Father and mother are treated with contempt in you; the alien residing within you suffers extortion; the orphan and the widow are wronged in you."
    },
    {
      "verse": 8,
      "text": "You have despised my holy things and profaned my Sabbaths."
    },
    {
      "verse": 9,
      "text": "In you are those who slander to shed blood, those in you who eat upon the mountains, who commit lewdness in your midst."
    },
    {
      "verse": 10,
      "text": "In you they uncover their fathers’ nakedness; in you they violate women during their menstrual periods."
    },
    {
      "verse": 11,
      "text": "One commits abomination with his neighbor’s wife; another lewdly defiles his daughter-in-law; another in you defiles his sister, his father’s daughter."
    },
    {
      "verse": 12,
      "text": "In you, they take bribes to shed blood; you take both advance interest and accrued interest and make gain of your neighbors by extortion, and you have forgotten me, says the Lord God."
    },
    {
      "verse": 13,
      "text": "See, I strike my hands together at the dishonest gain you have made and at the blood that has been shed within you."
    },
    {
      "verse": 14,
      "text": "Can your courage endure, or can your hands remain strong in the days when I shall deal with you? I the Lord have spoken, and I will do it."
    },
    {
      "verse": 15,
      "text": "I will scatter you among the nations and disperse you through the countries, and I will purge your filthiness out of you."
    },
    {
      "verse": 16,
      "text": "And you shall be profaned within yourself in the sight of the nations, and you shall know that I am the Lord."
    },
    {
      "verse": 17,
      "text": "The word of the Lord came to me:"
    },
    {
      "verse": 18,
      "text": "Mortal, the house of Israel has become dross to me; all of them, silver, bronze, tin, iron, and lead. In the smelter they have become dross."
    },
    {
      "verse": 19,
      "text": "Therefore thus says the Lord God: Because you have all become dross, I will gather you into the midst of Jerusalem."
    },
    {
      "verse": 20,
      "text": "As one gathers silver, bronze, iron, lead, and tin into a smelter, to blow the fire upon them in order to melt them, so I will gather you in my anger and in my wrath, and I will put you in and melt you."
    },
    {
      "verse": 21,
      "text": "I will gather you and blow upon you with the fire of my wrath, and you shall be melted within it."
    },
    {
      "verse": 22,
      "text": "As silver is melted in a smelter, so you shall be melted in it, and you shall know that I the Lord have poured out my wrath upon you."
    },
    {
      "verse": 23,
      "text": "The word of the Lord came to me:"
    },
    {
      "verse": 24,
      "text": "Mortal, say to it: You are a land that is not cleansed, not rained upon in the day of indignation."
    },
    {
      "verse": 25,
      "text": "Its princes within it are like a roaring lion tearing the prey; they have devoured human lives; they have taken treasure and precious things; they have made many widows within it."
    },
    {
      "verse": 26,
      "text": "Its priests have done violence to my teaching and have profaned my holy things; they have made no distinction between the holy and the common, neither have they taught the difference between the unclean and the clean, and they have disregarded my Sabbaths, so that I am profaned among them."
    },
    {
      "verse": 27,
      "text": "Its officials within it are like wolves tearing the prey, shedding blood, destroying lives to get dishonest gain."
    },
    {
      "verse": 28,
      "text": "Its prophets have smeared whitewash on their behalf, seeing false visions and divining lies for them, saying, “Thus says the Lord God,” when the Lord has not spoken."
    },
    {
      "verse": 29,
      "text": "The people of the land have practiced extortion and committed robbery; they have oppressed the poor and needy and have extorted from the alien without justice."
    },
    {
      "verse": 30,
      "text": "And I sought for anyone among them who would repair the wall and stand in the breach before me on behalf of the land, so that I would not destroy it, but I found no one."
    },
    {
      "verse": 31,
      "text": "Therefore I have poured out my indignation upon them; I have consumed them with the fire of my wrath; I have returned their conduct upon their heads, says the Lord God."
    }
  ],
  "timestamp": "2025-08-08T15:50:49.197760"
}