{
  "book": "HOS",
  "book_name": "Hosea",
  "chapter": 4,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/HOS.4",
  "verses": [
    {
      "verse": 1,
      "text": "Hear the word of the Lord, O people of Israel, for the Lord has an indictment against the inhabitants of the land. There is no faithfulness or loyalty and no knowledge of God in the land."
    },
    {
      "verse": 2,
      "text": "Swearing, lying, and murder, and stealing and adultery break out; bloodshed follows bloodshed."
    },
    {
      "verse": 3,
      "text": "Therefore the land mourns, and all who live in it languish; together with the wild animals and the birds of the air, even the fish of the sea are perishing."
    },
    {
      "verse": 4,
      "text": "Yet let no one contend, and let none accuse, for with you is my contention, O priest."
    },
    {
      "verse": 5,
      "text": "You shall stumble by day; the prophet also shall stumble with you by night, and I will destroy your mother."
    },
    {
      "verse": 6,
      "text": "My people are destroyed for lack of knowledge! Because you have rejected knowledge, I reject you from being a priest to me; and since you have forgotten the law of your God, I also will forget your children."
    },
    {
      "verse": 7,
      "text": "The more they increased, the more they sinned against me; they changed their glory into shame."
    },
    {
      "verse": 8,
      "text": "They feed on the sin of my people; they are greedy for their iniquity."
    },
    {
      "verse": 9,
      "text": "And it shall be like people, like priest; I will punish them for their ways and repay them for their deeds."
    },
    {
      "verse": 10,
      "text": "They shall eat but not be satisfied; they shall prostitute themselves but not multiply, because they have forsaken the Lord to devote themselves to"
    },
    {
      "verse": 11,
      "text": "prostitution. Wine and new wine take away the understanding."
    },
    {
      "verse": 12,
      "text": "My people consult a piece of wood, and their divining rod gives them oracles. For a spirit of prostitution has led them astray, and they have prostituted themselves, forsaking their God."
    },
    {
      "verse": 13,
      "text": "They sacrifice on the tops of the mountains and make offerings upon the hills, under oak, poplar, and terebinth because their shade is good. Therefore your daughters prostitute themselves, and your daughters-in-law commit adultery."
    },
    {
      "verse": 14,
      "text": "I will not punish your daughters when they prostitute themselves nor your daughters-in-law when they commit adultery, for the men themselves go aside with prostitutes and sacrifice with female attendants; thus a people without understanding comes to ruin."
    },
    {
      "verse": 15,
      "text": "Though you prostitute yourself, O Israel, do not let Judah become guilty. Do not enter into Gilgal or go up to Beth-aven, and do not swear, “As the Lord lives.”"
    },
    {
      "verse": 16,
      "text": "Like a stubborn heifer, Israel is stubborn; can the Lord now feed them like a lamb in a broad pasture?"
    },
    {
      "verse": 17,
      "text": "Ephraim is joined to idols— let him alone."
    },
    {
      "verse": 18,
      "text": "When their drinking is ended, they indulge in sexual orgies; they love lewdness more than their glory."
    },
    {
      "verse": 19,
      "text": "A wind has wrapped them in its wings, and they shall be ashamed because of their altars."
    }
  ],
  "timestamp": "2025-08-08T15:50:58.373494"
}