{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 66,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ISA.66",
  "verses": [
    {
      "verse": 1,
      "text": "Thus says the Lord: Heaven is my throne, and the earth is my footstool; so what kind of house could you build for me, what sort of place for me to rest?"
    },
    {
      "verse": 2,
      "text": "All these things my hand has made, so all these things are mine, says the Lord. But this is the one to whom I will look, to the humble and contrite in spirit who trembles at my word."
    },
    {
      "verse": 3,
      "text": "Whoever slaughters an ox is like one who kills a human, whoever sacrifices a lamb like one who breaks a dog’s neck, whoever presents a grain offering like one who offers pig’s blood, whoever makes a memorial offering of frankincense like one who blesses an idol. Just as these have chosen their own ways and in their abominations they take delight,"
    },
    {
      "verse": 4,
      "text": "so I will choose their punishments and bring upon them what they fear, because, when I called, no one answered, when I spoke, they did not listen, but they did what was evil in my sight and chose what did not please me."
    },
    {
      "verse": 5,
      "text": "Hear the word of the Lord, you who tremble at his word: Your own people who hate you and reject you for my name’s sake have said, “Let the Lord be glorified, so that we may see your joy,” but it is they who shall be put to shame."
    },
    {
      "verse": 6,
      "text": "Listen, a roar from the city! A voice from the temple! The voice of the Lord, dealing retribution to his enemies!"
    },
    {
      "verse": 7,
      "text": "Before she was in labor she gave birth; before her pain came upon her she delivered a son."
    },
    {
      "verse": 8,
      "text": "Who has heard of such a thing? Who has seen such things? Shall a land be born in one day? Shall a nation be delivered in one moment? Yet as soon as Zion was in labor she delivered her children."
    },
    {
      "verse": 9,
      "text": "Shall I open the womb and not deliver? says the Lord; shall I, the one who delivers, shut the womb? says your God."
    },
    {
      "verse": 10,
      "text": "Rejoice with Jerusalem, and be glad for her, all you who love her; rejoice with her in joy, all you who mourn over her—"
    },
    {
      "verse": 11,
      "text": "that you may nurse and be satisfied from her consoling breast, that you may drink deeply with delight from her glorious bosom."
    },
    {
      "verse": 12,
      "text": "For thus says the Lord: I will extend prosperity to her like a river and the wealth of the nations like an overflowing stream, and you shall nurse and be carried on her arm and bounced on her knees."
    },
    {
      "verse": 13,
      "text": "As a mother comforts her child, so I will comfort you; you shall be comforted in Jerusalem."
    },
    {
      "verse": 14,
      "text": "You shall see, and your heart shall rejoice; your bodies shall flourish like the grass, and it shall be known that the power of the Lord is with his servants, and his indignation is against his enemies."
    },
    {
      "verse": 15,
      "text": "For the Lord will come in fire and his chariots in a whirlwind, to vent his anger in fury and his rebuke in flames of fire."
    },
    {
      "verse": 16,
      "text": "For by fire will the Lord execute judgment, and by his sword on all flesh; and those slain by the Lord shall be many."
    },
    {
      "verse": 17,
      "text": "Those who sanctify and purify themselves to go into the gardens, following the one in the center, eating the flesh of pigs, vermin, and rodents, shall come to an end together, says the Lord,"
    },
    {
      "verse": 18,
      "text": "for I know their works and their thoughts. I am coming to gather all nations and tongues, and they shall come and shall see my glory,"
    },
    {
      "verse": 19,
      "text": "and I will set a sign among them. From them I will send survivors to the nations, to Tarshish, Put, and Lud, to Meshech, Tubal, and Javan, to the coastlands far away that have not heard of my fame or seen my glory, and they shall declare my glory among the nations."
    },
    {
      "verse": 20,
      "text": "They shall bring all your kindred from all the nations as an offering to the Lord, on horses, and in chariots, and in litters, and on mules, and on dromedaries, to my holy mountain Jerusalem, says the Lord, just as the Israelites bring a grain offering in a clean vessel to the house of the Lord."
    },
    {
      "verse": 21,
      "text": "And I will also take some of them as priests and as Levites, says the Lord."
    },
    {
      "verse": 22,
      "text": "For as the new heavens and the new earth, which I will make, shall remain before me, says the Lord, so shall your descendants and your name remain."
    },
    {
      "verse": 23,
      "text": "From new moon to new moon and from Sabbath to Sabbath, all flesh shall come to worship before me, says the Lord."
    },
    {
      "verse": 24,
      "text": "And they shall go out and look at the dead bodies of the people who have rebelled against me, for their worm shall not die, their fire shall not be quenched, and they shall be an abhorrence to all flesh."
    }
  ],
  "timestamp": "2025-08-08T15:50:32.699877"
}