{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 55,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ISA.55",
  "verses": [
    {
      "verse": 1,
      "text": "Hear, everyone who thirsts; come to the waters; and you who have no money, come, buy and eat! Come, buy wine and milk without money and without price."
    },
    {
      "verse": 2,
      "text": "Why do you spend your money for that which is not bread and your earnings for that which does not satisfy? Listen carefully to me, and eat what is good, and delight yourselves in rich food."
    },
    {
      "verse": 3,
      "text": "Incline your ear, and come to me; listen, so that you may live. I will make with you an everlasting covenant, my steadfast, sure love for David."
    },
    {
      "verse": 4,
      "text": "See, I made him a witness to the peoples, a leader and commander for the peoples."
    },
    {
      "verse": 5,
      "text": "Now you shall call nations that you do not know, and nations that do not know you shall run to you, because of the Lord your God, the Holy One of Israel, for he has glorified you."
    },
    {
      "verse": 6,
      "text": "Seek the Lord while he may be found; call upon him while he is near;"
    },
    {
      "verse": 7,
      "text": "let the wicked forsake their way and the unrighteous their thoughts; let them return to the Lord, that he may have mercy on them, and to our God, for he will abundantly pardon."
    },
    {
      "verse": 8,
      "text": "For my thoughts are not your thoughts, nor are your ways my ways, says the Lord."
    },
    {
      "verse": 9,
      "text": "For as the heavens are higher than the earth, so are my ways higher than your ways and my thoughts than your thoughts."
    },
    {
      "verse": 10,
      "text": "For as the rain and the snow come down from heaven and do not return there until they have watered the earth, making it bring forth and sprout, giving seed to the sower and bread to the eater,"
    },
    {
      "verse": 11,
      "text": "so shall my word be that goes out from my mouth; it shall not return to me empty, but it shall accomplish that which I purpose and succeed in the thing for which I sent it."
    },
    {
      "verse": 12,
      "text": "For you shall go out in joy and be led back in peace; the mountains and the hills before you shall burst into song, and all the trees of the field shall clap their hands."
    },
    {
      "verse": 13,
      "text": "Instead of the thorn shall come up the cypress; instead of the brier shall come up the myrtle, and it shall be to the Lord for a memorial, for an everlasting sign that shall not be cut off."
    }
  ],
  "timestamp": "2025-08-08T15:50:30.906223"
}