{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 24,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ISA.24",
  "verses": [
    {
      "verse": 1,
      "text": "Now the Lord is about to lay waste the earth and make it desolate, and he will twist its surface and scatter its inhabitants."
    },
    {
      "verse": 2,
      "text": "And it shall be, as with the people, so with the priest; as with the male slave, so with his master; as with the female slave, so with her mistress; as with the buyer, so with the seller; as with the lender, so with the borrower; as with the creditor, so with the debtor."
    },
    {
      "verse": 3,
      "text": "The earth shall be utterly laid waste and utterly despoiled, for the Lord has spoken this word."
    },
    {
      "verse": 4,
      "text": "The earth dries up and withers; the world languishes and withers; the heavens languish together with the earth."
    },
    {
      "verse": 5,
      "text": "The earth lies polluted under its inhabitants, for they have transgressed laws, violated the statutes, broken the everlasting covenant."
    },
    {
      "verse": 6,
      "text": "Therefore a curse devours the earth, and its inhabitants suffer for their guilt; therefore the inhabitants of the earth dwindled, and few people are left."
    },
    {
      "verse": 7,
      "text": "The wine dries up; the vine languishes; all the merry-hearted sigh."
    },
    {
      "verse": 8,
      "text": "The mirth of the timbrels is stilled; the noise of the jubilant has ceased; the mirth of the lyre is stilled."
    },
    {
      "verse": 9,
      "text": "No longer do they drink wine with singing; strong drink is bitter to those who drink it."
    },
    {
      "verse": 10,
      "text": "The city of chaos is broken down; every house is shut up so that no one can enter."
    },
    {
      "verse": 11,
      "text": "There is an outcry in the streets for lack of wine; all joy has reached its eventide; the gladness of the earth is banished."
    },
    {
      "verse": 12,
      "text": "Desolation is left in the city; the gates are battered into ruins."
    },
    {
      "verse": 13,
      "text": "For thus it shall be on the earth and among the nations, as when an olive tree is beaten, as at the gleaning when the grape harvest is ended."
    },
    {
      "verse": 14,
      "text": "They lift up their voices; they sing for joy; they shout from the west over the majesty of the Lord."
    },
    {
      "verse": 15,
      "text": "Therefore in the east give glory to the Lord; in the coastlands of the sea glorify the name of the Lord, the God of Israel."
    },
    {
      "verse": 16,
      "text": "From the ends of the earth we hear songs of praise, of glory to the Righteous One. But I say, “I pine away; I pine away. Woe is me! For the treacherous deal treacherously; the treacherous deal very treacherously.”"
    },
    {
      "verse": 17,
      "text": "Terror, the pit, and the snare are upon you, O inhabitants of the earth!"
    },
    {
      "verse": 18,
      "text": "Whoever flees at the sound of the terror shall fall into the pit, and whoever climbs out of the pit shall be caught in the snare. For the windows of heaven are opened, and the foundations of the earth tremble."
    },
    {
      "verse": 19,
      "text": "The earth is utterly broken; the earth is torn apart; the earth is violently shaken."
    },
    {
      "verse": 20,
      "text": "The earth staggers like a drunkard; it sways like a hut; its transgression lies heavy upon it, and it falls and will not rise again."
    },
    {
      "verse": 21,
      "text": "On that day the Lord will punish the host of heaven in heaven and on earth the kings of the earth."
    },
    {
      "verse": 22,
      "text": "They will be gathered together like prisoners in a pit; they will be shut up in a prison, and after many days they will be punished."
    },
    {
      "verse": 23,
      "text": "Then the moon will be abashed and the sun ashamed, for the Lord of hosts will reign on Mount Zion and in Jerusalem, and before his elders he will be glorified."
    }
  ],
  "timestamp": "2025-08-08T15:50:25.996530"
}