{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 40,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ISA.40",
  "verses": [
    {
      "verse": 1,
      "text": "Comfort, O comfort my people, says your God."
    },
    {
      "verse": 2,
      "text": "Speak tenderly to Jerusalem, and cry to her that she has served her term, that her penalty is paid, that she has received from the Lord ’s hand double for all her sins."
    },
    {
      "verse": 3,
      "text": "A voice cries out: “In the wilderness prepare the way of the Lord; make straight in the desert a highway for our God."
    },
    {
      "verse": 4,
      "text": "Every valley shall be lifted up, and every mountain and hill be made low; the uneven ground shall become level, and the rough places a plain."
    },
    {
      "verse": 5,
      "text": "Then the glory of the Lord shall be revealed, and all flesh shall see it together, for the mouth of the Lord has spoken.”"
    },
    {
      "verse": 6,
      "text": "A voice says, “Cry out!” And I said, “What shall I cry?” All flesh is grass; their constancy is like the flower of the field."
    },
    {
      "verse": 7,
      "text": "The grass withers; the flower fades, [[when the breath of the Lord blows upon it; surely the people are grass."
    },
    {
      "verse": 8,
      "text": "The grass withers; the flower fades,]] but the word of our God will stand forever."
    },
    {
      "verse": 9,
      "text": "Get you up to a high mountain, O Zion, herald of good news; lift up your voice with strength, O Jerusalem, herald of good news; lift it up, do not fear; say to the cities of Judah, “Here is your God!”"
    },
    {
      "verse": 10,
      "text": "See, the Lord God comes with might, and his arm rules for him; his reward is with him and his recompense before him."
    },
    {
      "verse": 11,
      "text": "He will feed his flock like a shepherd; he will gather the lambs in his arms and carry them in his bosom and gently lead the mother sheep."
    },
    {
      "verse": 12,
      "text": "Who has measured the waters of the sea in the hollow of his hand and marked off the heavens with a span, enclosed the dust of the earth in a measure and weighed the mountains in scales and the hills in a balance?"
    },
    {
      "verse": 13,
      "text": "Who has directed the spirit of the Lord or as his counselor has instructed him?"
    },
    {
      "verse": 14,
      "text": "Whom did he consult for his enlightenment, and who taught him the path of justice? [[Who taught him knowledge and showed him the way of understanding?"
    },
    {
      "verse": 15,
      "text": "Even the nations are like a drop from a bucket and are accounted as dust on the scales; see, he takes up the isles like fine dust."
    },
    {
      "verse": 16,
      "text": "Lebanon would not provide fuel enough, nor are its animals enough for a burnt offering.]]"
    },
    {
      "verse": 17,
      "text": "All the nations are as nothing before him; they are accounted by him as less than nothing and emptiness."
    },
    {
      "verse": 18,
      "text": "To whom, then, will you liken God, or what likeness compare with him?"
    },
    {
      "verse": 19,
      "text": "An idol? A workman casts it, and a goldsmith overlays it with gold and casts for it silver chains."
    },
    {
      "verse": 20,
      "text": "As a gift one chooses mulberry wood —wood that will not rot— then seeks out a skilled artisan to set up an image that will not topple."
    },
    {
      "verse": 21,
      "text": "Have you not known? Have you not heard? Has it not been told you from the beginning? Have you not understood from the foundations of the earth?"
    },
    {
      "verse": 22,
      "text": "It is he who sits above the circle of the earth, and its inhabitants are like grasshoppers, who stretches out the heavens like a curtain and spreads them like a tent to live in,"
    },
    {
      "verse": 23,
      "text": "who brings princes to naught and makes the rulers of the earth as nothing."
    },
    {
      "verse": 24,
      "text": "Scarcely are they planted, scarcely sown, scarcely has their stem taken root in the earth, when he blows upon them, and they wither, and the tempest carries them off like stubble."
    },
    {
      "verse": 25,
      "text": "To whom, then, will you compare me, or who is my equal? says the Holy One."
    },
    {
      "verse": 26,
      "text": "Lift up your eyes on high and see: Who created these? He who brings out their host and numbers them, calling them all by name; because he is great in strength, mighty in power, not one is missing."
    },
    {
      "verse": 27,
      "text": "Why do you say, O Jacob, and assert, O Israel, “My way is hidden from the Lord, and my right is disregarded by my God”?"
    },
    {
      "verse": 28,
      "text": "Have you not known? Have you not heard? The Lord is the everlasting God, the Creator of the ends of the earth. He does not faint or grow weary; his understanding is unsearchable."
    },
    {
      "verse": 29,
      "text": "He gives power to the faint and strengthens the powerless."
    },
    {
      "verse": 30,
      "text": "Even youths will faint and be weary, and the young will fall exhausted,"
    },
    {
      "verse": 31,
      "text": "but those who wait for the Lord shall renew their strength; they shall mount up with wings like eagles; they shall run and not be weary; they shall walk and not faint."
    }
  ],
  "timestamp": "2025-08-08T15:50:28.475971"
}