{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 26,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ISA.26",
  "verses": [
    {
      "verse": 1,
      "text": "On that day this song will be sung in the land of Judah: We have a strong city; he sets up walls and bulwarks as a safeguard."
    },
    {
      "verse": 2,
      "text": "Open the gates, so that the righteous nation that maintains faithfulness may enter in."
    },
    {
      "verse": 3,
      "text": "Those of steadfast mind you keep in peace, in peace because they trust in you."
    },
    {
      "verse": 4,
      "text": "Trust in the Lord forever, for in the Lord God you have an everlasting rock."
    },
    {
      "verse": 5,
      "text": "For he has brought low the inhabitants of the height; the lofty city he lays low. He lays it low to the ground, casts it to the dust."
    },
    {
      "verse": 6,
      "text": "The foot tramples it, the feet of the poor, the steps of the needy."
    },
    {
      "verse": 7,
      "text": "The way of the righteous is level; straight is the path of the righteous that you clear."
    },
    {
      "verse": 8,
      "text": "In the path of your judgments, O Lord, we have placed hope; your name and your renown are the soul’s desire."
    },
    {
      "verse": 9,
      "text": "My soul yearns for you in the night; my spirit within me earnestly seeks you. For when your judgments are in the earth, the inhabitants of the world learn righteousness."
    },
    {
      "verse": 10,
      "text": "If favor is shown to the wicked, they do not learn righteousness; they corrupt what is upright on the earth and do not see the majesty of the Lord."
    },
    {
      "verse": 11,
      "text": "O Lord, your hand is lifted up, but they do not see it. Let them see your zeal for your people and be ashamed. Let the fire for your adversaries consume them."
    },
    {
      "verse": 12,
      "text": "O Lord, may you ordain peace for us, for indeed, all that we have done, you have done for us."
    },
    {
      "verse": 13,
      "text": "O Lord our God, other lords besides you have ruled over us, but we acknowledge your name alone."
    },
    {
      "verse": 14,
      "text": "The dead do not live; shades do not rise because you have punished and destroyed them and wiped out all memory of them."
    },
    {
      "verse": 15,
      "text": "But you have increased the nation, O Lord; you have increased the nation; you are glorified; you have enlarged all the borders of the land."
    },
    {
      "verse": 16,
      "text": "O Lord, in distress they sought you; they poured out a prayer when your chastening was on them."
    },
    {
      "verse": 17,
      "text": "Like a woman with child about to give birth writhes and cries out in her pain, so were we because of you, O Lord;"
    },
    {
      "verse": 18,
      "text": "we were with child; we writhed, but we gave birth only to wind. We have won no victories on earth, and no one is born to inhabit the world."
    },
    {
      "verse": 19,
      "text": "Your dead shall live; their corpses shall rise. Those who dwell in the dust will awake and shout for joy! For your dew is a radiant dew, and the earth will give birth to those long dead."
    },
    {
      "verse": 20,
      "text": "Come, my people, enter your chambers, and shut your doors behind you; hide yourselves for a little while until the wrath is past."
    },
    {
      "verse": 21,
      "text": "For the Lord comes out from his place to punish the inhabitants of the earth for their iniquity; the earth will disclose the blood shed on it and will no longer cover its slain."
    }
  ],
  "timestamp": "2025-08-08T15:50:26.386522"
}