{
  "book": "ISA",
  "book_name": "Isaiah",
  "chapter": 61,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ISA.61",
  "verses": [
    {
      "verse": 1,
      "text": "The spirit of the Lord God is upon me because the Lord has anointed me; he has sent me to bring good news to the oppressed, to bind up the brokenhearted, to proclaim liberty to the captives and release to the prisoners,"
    },
    {
      "verse": 2,
      "text": "to proclaim the year of the Lord ’s favor and the day of vengeance of our God, to comfort all who mourn,"
    },
    {
      "verse": 3,
      "text": "to provide for those who mourn in Zion— to give them a garland instead of ashes, the oil of gladness instead of mourning, the mantle of praise instead of a faint spirit. They will be called oaks of righteousness, the planting of the Lord, to display his glory."
    },
    {
      "verse": 4,
      "text": "They shall build up the ancient ruins; they shall raise up the former devastations; they shall repair the ruined cities, the devastations of many generations."
    },
    {
      "verse": 5,
      "text": "Strangers shall stand and feed your flocks; foreigners shall till your land and dress your vines,"
    },
    {
      "verse": 6,
      "text": "but you shall be called priests of the Lord; you shall be named ministers of our God; you shall enjoy the wealth of the nations, and in their riches you shall glory."
    },
    {
      "verse": 7,
      "text": "Because their shame was double and dishonor was proclaimed as their lot, therefore in their land they shall possess a double portion; everlasting joy shall be theirs."
    },
    {
      "verse": 8,
      "text": "For I, the Lord, love justice, I hate robbery and wrongdoing; I will faithfully give them their recompense, and I will make an everlasting covenant with them."
    },
    {
      "verse": 9,
      "text": "Their descendants shall be known among the nations and their offspring among the peoples; all who see them shall acknowledge that they are a people whom the Lord has blessed."
    },
    {
      "verse": 10,
      "text": "I will greatly rejoice in the Lord; my whole being shall exult in my God, for he has clothed me with the garments of salvation; he has covered me with the robe of righteousness, as a bridegroom decks himself with a garland and as a bride adorns herself with her jewels."
    },
    {
      "verse": 11,
      "text": "For as the earth brings forth its shoots and as a garden causes what is sown in it to spring up, so the Lord God will cause righteousness and praise to spring up before all the nations."
    }
  ],
  "timestamp": "2025-08-08T15:50:31.919662"
}