{
  "book": "JAS",
  "book_name": "James",
  "chapter": 2,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/JAS.2",
  "verses": [
    {
      "verse": 1,
      "text": "My brothers and sisters, do not claim the faith of our Lord Jesus Christ of glory while showing partiality."
    },
    {
      "verse": 2,
      "text": "For if a person with gold rings and in fine clothes comes into your assembly, and if a poor person in dirty clothes also comes in,"
    },
    {
      "verse": 3,
      "text": "and if you take notice of the one wearing the fine clothes and say, “Have a seat here in a good place, please,” while to the one who is poor you say, “Stand there,” or, “Sit by my footstool,”"
    },
    {
      "verse": 4,
      "text": "have you not made distinctions among yourselves and become judges with evil thoughts?"
    },
    {
      "verse": 5,
      "text": "Listen, my beloved brothers and sisters. Has not God chosen the poor in the world to be rich in faith and to be heirs of the kingdom that he has promised to those who love him?"
    },
    {
      "verse": 6,
      "text": "But you have dishonored the poor person. Is it not the rich who oppress you? Is it not they who drag you into the courts?"
    },
    {
      "verse": 7,
      "text": "Is it not they who blaspheme the excellent name that was invoked over you?"
    },
    {
      "verse": 8,
      "text": "If you really fulfill the royal law according to the scripture, “You shall love your neighbor as yourself,” you do well."
    },
    {
      "verse": 9,
      "text": "But if you show partiality, you commit sin and are convicted by the law as transgressors."
    },
    {
      "verse": 10,
      "text": "For whoever keeps the whole law but fails in one point has become accountable for all of it."
    },
    {
      "verse": 11,
      "text": "For the one who said, “You shall not commit adultery,” also said, “You shall not murder.” Now if you do not commit adultery but you murder, you have become a transgressor of the law."
    },
    {
      "verse": 12,
      "text": "So speak and so act as those who are to be judged by the law of liberty."
    },
    {
      "verse": 13,
      "text": "For judgment will be without mercy to anyone who has shown no mercy; mercy triumphs over judgment."
    },
    {
      "verse": 14,
      "text": "What good is it, my brothers and sisters, if someone claims to have faith but does not have works? Surely that faith cannot save, can it?"
    },
    {
      "verse": 15,
      "text": "If a brother or sister is naked and lacks daily food"
    },
    {
      "verse": 16,
      "text": "and one of you says to them, “Go in peace; keep warm and eat your fill,” and yet you do not supply their bodily needs, what is the good of that?"
    },
    {
      "verse": 17,
      "text": "So faith by itself, if it has no works, is dead."
    },
    {
      "verse": 18,
      "text": "But someone will say, “You have faith, and I have works.” Show me your faith apart from works, and I by my works will show you faith."
    },
    {
      "verse": 19,
      "text": "You believe that God is one; you do well. Even the demons believe—and shudder."
    },
    {
      "verse": 20,
      "text": "Do you want to be shown, you senseless person, that faith apart from works is worthless?"
    },
    {
      "verse": 21,
      "text": "Was not our ancestor Abraham justified by works when he offered his son Isaac on the altar?"
    },
    {
      "verse": 22,
      "text": "You see that faith was active along with his works, and by works faith was brought to completion."
    },
    {
      "verse": 23,
      "text": "Thus the scripture was fulfilled that says, “Abraham believed God, and it was reckoned to him as righteousness,” and he was called the friend of God."
    },
    {
      "verse": 24,
      "text": "You see that a person is justified by works and not by faith alone."
    },
    {
      "verse": 25,
      "text": "Likewise, was not Rahab the prostitute also justified by works when she welcomed the messengers and sent them out by another road?"
    },
    {
      "verse": 26,
      "text": "For just as the body without the spirit is dead, so faith without works is also dead."
    }
  ],
  "timestamp": "2025-08-08T15:52:25.232548"
}