{
  "book": "JER",
  "book_name": "Jeremiah",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/JER.3",
  "verses": [
    {
      "verse": 1,
      "text": "If a man divorces his wife and she goes from him and becomes another man’s wife, will he return to her? Would not such a land be greatly polluted? You have prostituted yourself with many lovers, and would you return to me? says the Lord."
    },
    {
      "verse": 2,
      "text": "Look up to the bare heights and see! Where have you not been lain with? By the waysides you sat waiting for lovers, like a nomad in the wilderness. You have polluted the land with your prostitutions and wickedness."
    },
    {
      "verse": 3,
      "text": "Therefore the showers have been withheld, and the spring rain has not come, yet you have the forehead of a prostitute; you refuse to be ashamed."
    },
    {
      "verse": 4,
      "text": "Have you not just now called to me, “My Father, you are the friend of my youth—"
    },
    {
      "verse": 5,
      "text": "will he be angry forever, will he be indignant to the end?” This is how you have spoken, but you have done all the evil that you could."
    },
    {
      "verse": 6,
      "text": "The Lord said to me in the days of King Josiah: Have you seen what she did, that faithless one, Israel, how she went up on every high hill and under every green tree and prostituted herself there?"
    },
    {
      "verse": 7,
      "text": "And I thought, “After she has done all this she will return to me,” but she did not return, and her false sister Judah saw it."
    },
    {
      "verse": 8,
      "text": "She saw that for all the adulteries of that faithless one, Israel, I had sent her away with a decree of divorce, yet her false sister Judah did not fear, but she also went and prostituted herself."
    },
    {
      "verse": 9,
      "text": "Because she took her prostitution so lightly, she polluted the land, committing adultery with stone and tree."
    },
    {
      "verse": 10,
      "text": "Yet for all this her false sister Judah did not return to me with her whole heart but only in pretense, says the Lord."
    },
    {
      "verse": 11,
      "text": "Then the Lord said to me: Faithless Israel has shown herself less guilty than false Judah."
    },
    {
      "verse": 12,
      "text": "Go and proclaim these words toward the north, and say: Return, faithless Israel, says the Lord. I will not look on you in anger, for I am merciful, says the Lord; I will not be angry forever."
    },
    {
      "verse": 13,
      "text": "Only acknowledge your guilt, that you have rebelled against the Lord your God and scattered your favors among strangers under every green tree and have not obeyed my voice, says the Lord."
    },
    {
      "verse": 14,
      "text": "Return, O faithless children, says the Lord, for I am your husband; I will take you, one from a city and two from a family, and I will bring you to Zion."
    },
    {
      "verse": 15,
      "text": "I will give you shepherds after my own heart who will feed you with knowledge and understanding."
    },
    {
      "verse": 16,
      "text": "And when you have multiplied and increased in the land, in those days, says the Lord, they shall no longer say, “The ark of the covenant of the Lord.” It shall not come to mind or be remembered or missed, nor shall another one be made."
    },
    {
      "verse": 17,
      "text": "At that time Jerusalem shall be called the throne of the Lord, and all nations shall gather to it, to the presence of the Lord in Jerusalem, and they shall no longer stubbornly follow their own evil will."
    },
    {
      "verse": 18,
      "text": "In those days the house of Judah shall join the house of Israel, and together they shall come from the land of the north to the land that I gave your ancestors for a heritage."
    },
    {
      "verse": 19,
      "text": "I thought how I would set you among my children and give you a pleasant land, the most beautiful heritage of all the nations. And I thought you would call to me, “My Father,” and would not turn from following me."
    },
    {
      "verse": 20,
      "text": "Instead, as a faithless wife leaves her husband, so you have been faithless to me, O house of Israel, says the Lord."
    },
    {
      "verse": 21,
      "text": "A voice on the bare heights is heard, the plaintive weeping of Israel’s children, because they have perverted their way; they have forgotten the Lord their God:"
    },
    {
      "verse": 22,
      "text": "Return, O faithless children, I will heal your faithlessness. “Here we come to you, for you are the Lord our God."
    },
    {
      "verse": 23,
      "text": "Truly the hills are a delusion, a tumult on the mountains. Truly in the Lord our God is the salvation of Israel."
    },
    {
      "verse": 24,
      "text": "“But from our youth the shameful thing has devoured all for which our ancestors had labored, their flocks and their herds, their sons and their daughters."
    },
    {
      "verse": 25,
      "text": "Let us lie down in our shame, and let our dishonor cover us, for we have sinned against the Lord our God, we and our ancestors, from our youth even to this day, and we have not obeyed the voice of the Lord our God.”"
    }
  ],
  "timestamp": "2025-08-08T15:50:34.647301"
}