{
  "book": "JHN",
  "book_name": "John",
  "chapter": 21,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/JHN.21",
  "verses": [
    {
      "verse": 1,
      "text": "After these things Jesus showed himself again to the disciples by the Sea of Tiberias, and he showed himself in this way."
    },
    {
      "verse": 2,
      "text": "Gathered there together were Simon Peter, Thomas called the Twin, Nathanael of Cana in Galilee, the sons of Zebedee, and two others of his disciples."
    },
    {
      "verse": 3,
      "text": "Simon Peter said to them, “I am going fishing.” They said to him, “We will go with you.” They went out and got into the boat, but that night they caught nothing."
    },
    {
      "verse": 4,
      "text": "Just after daybreak, Jesus stood on the beach, but the disciples did not know that it was Jesus."
    },
    {
      "verse": 5,
      "text": "Jesus said to them, “Children, you have no fish, have you?” They answered him, “No.”"
    },
    {
      "verse": 6,
      "text": "He said to them, “Cast the net to the right side of the boat, and you will find some.” So they cast it, and now they were not able to haul it in because there were so many fish."
    },
    {
      "verse": 7,
      "text": "That disciple whom Jesus loved said to Peter, “It is the Lord!” When Simon Peter heard that it was the Lord, he put on his outer garment, for he had taken it off, and jumped into the sea."
    },
    {
      "verse": 8,
      "text": "But the other disciples came in the boat, dragging the net full of fish, for they were not far from the land, only about a hundred yards off."
    },
    {
      "verse": 9,
      "text": "When they had gone ashore, they saw a charcoal fire there, with fish on it, and bread."
    },
    {
      "verse": 10,
      "text": "Jesus said to them, “Bring some of the fish that you have just caught.”"
    },
    {
      "verse": 11,
      "text": "So Simon Peter went aboard and hauled the net ashore, full of large fish, a hundred fifty-three of them, and though there were so many, the net was not torn."
    },
    {
      "verse": 12,
      "text": "Jesus said to them, “Come and have breakfast.” Now none of the disciples dared to ask him, “Who are you?” because they knew it was the Lord."
    },
    {
      "verse": 13,
      "text": "Jesus came and took the bread and gave it to them and did the same with the fish."
    },
    {
      "verse": 14,
      "text": "This was now the third time that Jesus appeared to the disciples after he was raised from the dead."
    },
    {
      "verse": 15,
      "text": "When they had finished breakfast, Jesus said to Simon Peter, “Simon son of John, do you love me more than these?” He said to him, “Yes, Lord; you know that I love you.” Jesus said to him, “Feed my lambs.”"
    },
    {
      "verse": 16,
      "text": "A second time he said to him, “Simon son of John, do you love me?” He said to him, “Yes, Lord; you know that I love you.” Jesus said to him, “Tend my sheep.”"
    },
    {
      "verse": 17,
      "text": "He said to him the third time, “Simon son of John, do you love me?” Peter felt hurt because he said to him the third time, “Do you love me?” And he said to him, “Lord, you know everything; you know that I love you.” Jesus said to him, “Feed my sheep."
    },
    {
      "verse": 18,
      "text": "Very truly, I tell you, when you were younger, you used to fasten your own belt and to go wherever you wished. But when you grow old, you will stretch out your hands, and someone else will fasten a belt around you and take you where you do not wish to go.”"
    },
    {
      "verse": 19,
      "text": "(He said this to indicate the kind of death by which he would glorify God.) After this he said to him, “Follow me.”"
    },
    {
      "verse": 20,
      "text": "Peter turned and saw the disciple whom Jesus loved following them; he was the one who had reclined next to Jesus at the supper and had said, “Lord, who is it that is going to betray you?”"
    },
    {
      "verse": 21,
      "text": "When Peter saw him, he said to Jesus, “Lord, what about him?”"
    },
    {
      "verse": 22,
      "text": "Jesus said to him, “If it is my will that he remain until I come, what is that to you? Follow me!”"
    },
    {
      "verse": 23,
      "text": "So the rumor spread among the brothers and sisters that this disciple would not die. Yet Jesus did not say to him that he would not die, but, “If it is my will that he remain until I come, what is that to you?”"
    },
    {
      "verse": 24,
      "text": "This is the disciple who is testifying to these things and has written them, and we know that his testimony is true."
    },
    {
      "verse": 25,
      "text": "But there are also many other things that Jesus did; if every one of them were written down, I suppose that the world itself could not contain the books that would be written."
    }
  ],
  "timestamp": "2025-08-08T15:51:42.939746"
}