{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 23,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/JOB.23",
  "verses": [
    {
      "verse": 1,
      "text": "Then Job answered:"
    },
    {
      "verse": 2,
      "text": "“Today also my complaint is bitter; his hand is heavy despite my groaning."
    },
    {
      "verse": 3,
      "text": "Oh, that I knew where I might find him, that I might come even to his dwelling!"
    },
    {
      "verse": 4,
      "text": "I would lay my case before him and fill my mouth with arguments."
    },
    {
      "verse": 5,
      "text": "I would learn what he would answer me and understand what he would say to me."
    },
    {
      "verse": 6,
      "text": "Would he contend with me in the greatness of his power? No, but he would give heed to me."
    },
    {
      "verse": 7,
      "text": "There the upright could reason with him, and I should be acquitted forever by my judge."
    },
    {
      "verse": 8,
      "text": "“If I go forward, he is not there; or backward, I cannot perceive him;"
    },
    {
      "verse": 9,
      "text": "on the left he hides, and I cannot behold him; I turn to the right, but I cannot see him."
    },
    {
      "verse": 10,
      "text": "But he knows the way that I take; when he has tested me, I shall come out like gold."
    },
    {
      "verse": 11,
      "text": "My foot has held fast to his steps; I have kept his way and have not turned aside."
    },
    {
      "verse": 12,
      "text": "I have not departed from the commandment of his lips; I have treasured his words in my bosom."
    },
    {
      "verse": 13,
      "text": "But he stands alone, and who can dissuade him? What he desires, that he does."
    },
    {
      "verse": 14,
      "text": "For he will complete what he appoints for me, and many such things are in his mind."
    },
    {
      "verse": 15,
      "text": "Therefore I am terrified at his presence; when I consider, I am in dread of him."
    },
    {
      "verse": 16,
      "text": "God has made my heart faint; the Almighty has terrified me."
    },
    {
      "verse": 17,
      "text": "If only I could vanish in darkness, and thick darkness would cover my face!"
    }
  ],
  "timestamp": "2025-08-08T15:49:41.148786"
}