{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 40,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/JOB.40",
  "verses": [
    {
      "verse": 1,
      "text": "And the Lord said to Job:"
    },
    {
      "verse": 2,
      "text": "“Shall a faultfinder contend with the Almighty? Anyone who argues with God must respond.”"
    },
    {
      "verse": 3,
      "text": "Then Job answered the Lord:"
    },
    {
      "verse": 4,
      "text": "“See, I am of small account; what shall I answer you? I lay my hand on my mouth."
    },
    {
      "verse": 5,
      "text": "I have spoken once, and I will not answer, twice but will proceed no further.”"
    },
    {
      "verse": 6,
      "text": "Then the Lord answered Job out of the whirlwind:"
    },
    {
      "verse": 7,
      "text": "“Gird up your loins like a man; I will question you, and you declare to me."
    },
    {
      "verse": 8,
      "text": "Will you even put me in the wrong? Will you condemn me that you may be justified?"
    },
    {
      "verse": 9,
      "text": "Have you an arm like God, and can you thunder with a voice like his?"
    },
    {
      "verse": 10,
      "text": "“Deck yourself with majesty and dignity; clothe yourself with glory and splendor."
    },
    {
      "verse": 11,
      "text": "Pour out the overflowings of your anger, and look on all who are proud and humble them."
    },
    {
      "verse": 12,
      "text": "Look on all who are proud and bring them low; tread down the wicked where they stand."
    },
    {
      "verse": 13,
      "text": "Hide them all in the dust together; bind their faces in the world below."
    },
    {
      "verse": 14,
      "text": "Then I will also acknowledge to you that your own right hand can give you victory."
    },
    {
      "verse": 15,
      "text": "“Look at Behemoth, which I made just as I made you; it eats grass like an ox."
    },
    {
      "verse": 16,
      "text": "Its strength is in its loins and its power in the muscles of its belly."
    },
    {
      "verse": 17,
      "text": "It makes its tail stiff like a cedar; the sinews of its thighs are knit together."
    },
    {
      "verse": 18,
      "text": "Its bones are tubes of bronze, its limbs like bars of iron."
    },
    {
      "verse": 19,
      "text": "“It is the first of the great acts of God; only its Maker can approach it with the sword."
    },
    {
      "verse": 20,
      "text": "For the mountains yield food for it where all the wild animals play."
    },
    {
      "verse": 21,
      "text": "Under the lotus plants it lies, in the covert of the reeds and in the marsh."
    },
    {
      "verse": 22,
      "text": "The lotus trees cover it for shade; the willows of the wadi surround it."
    },
    {
      "verse": 23,
      "text": "Even if the river is turbulent, it is not frightened; it is confident though Jordan rushes against its mouth."
    },
    {
      "verse": 24,
      "text": "Can one take it with hooks or pierce its nose with a snare?"
    }
  ],
  "timestamp": "2025-08-08T15:49:43.760032"
}