{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 11,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/JOB.11",
  "verses": [
    {
      "verse": 1,
      "text": "Then Zophar the Naamathite answered:"
    },
    {
      "verse": 2,
      "text": "“Should a multitude of words go unanswered, and should one full of talk be vindicated?"
    },
    {
      "verse": 3,
      "text": "Should your babble put others to silence, and when you mock, shall no one shame you?"
    },
    {
      "verse": 4,
      "text": "For you say, ‘My conduct is pure, and I am clean in God’s sight.’"
    },
    {
      "verse": 5,
      "text": "But O that God would speak and open his lips to you"
    },
    {
      "verse": 6,
      "text": "and that he would tell you the secrets of wisdom! For wisdom is many-sided. Know then that God exacts of you less than your guilt deserves."
    },
    {
      "verse": 7,
      "text": "“Can you find out the deep things of God? Can you find out the limit of the Almighty?"
    },
    {
      "verse": 8,
      "text": "It is higher than heaven —what can you do? Deeper than Sheol—what can you know?"
    },
    {
      "verse": 9,
      "text": "Its measure is longer than the earth and broader than the sea."
    },
    {
      "verse": 10,
      "text": "If he passes through and imprisons and assembles for judgment, who can hinder him?"
    },
    {
      "verse": 11,
      "text": "For he knows those who are worthless; when he sees iniquity, will he not consider it?"
    },
    {
      "verse": 12,
      "text": "But the stupid will get understanding when a wild ass is born human."
    },
    {
      "verse": 13,
      "text": "“If you direct your heart rightly, you will stretch out your hands toward him."
    },
    {
      "verse": 14,
      "text": "If iniquity is in your hand, put it far away, and do not let wickedness reside in your tents."
    },
    {
      "verse": 15,
      "text": "Surely then you will lift up your face without blemish; you will be secure and will not fear."
    },
    {
      "verse": 16,
      "text": "You will forget your misery; you will remember it as waters that have passed away."
    },
    {
      "verse": 17,
      "text": "And your life will be brighter than the noonday; its darkness will be like the morning."
    },
    {
      "verse": 18,
      "text": "And you will have confidence because there is hope; you will be protected and take your rest in safety."
    },
    {
      "verse": 19,
      "text": "You will lie down, and no one will make you afraid; many will entreat your favor."
    },
    {
      "verse": 20,
      "text": "But the eyes of the wicked will fail; all way of escape will be lost to them, and their hope is to breathe their last.”"
    }
  ],
  "timestamp": "2025-08-08T15:49:39.271128"
}