{
  "book": "JOB",
  "book_name": "Job",
  "chapter": 18,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/JOB.18",
  "verses": [
    {
      "verse": 1,
      "text": "Then Bildad the Shuhite answered:"
    },
    {
      "verse": 2,
      "text": "“How long will you hunt for words? Consider, and then we shall speak."
    },
    {
      "verse": 3,
      "text": "Why are we counted as cattle? Why are we stupid in your sight?"
    },
    {
      "verse": 4,
      "text": "You who tear yourself in your anger— shall the earth be forsaken because of you or the rock be removed out of its place?"
    },
    {
      "verse": 5,
      "text": "“Surely the light of the wicked is put out, and the flame of their fire does not shine."
    },
    {
      "verse": 6,
      "text": "The light is dark in their tent, and the lamp above them is put out."
    },
    {
      "verse": 7,
      "text": "Their strong steps are shortened, and their own schemes throw them down."
    },
    {
      "verse": 8,
      "text": "For they are thrust into a net by their own feet, and they walk into a pitfall."
    },
    {
      "verse": 9,
      "text": "A trap seizes them by the heel; a snare lays hold of them."
    },
    {
      "verse": 10,
      "text": "A rope is hid for them in the ground, a trap for them in the path."
    },
    {
      "verse": 11,
      "text": "Terrors frighten them on every side and chase them at their heels."
    },
    {
      "verse": 12,
      "text": "Their strength is consumed by hunger, and calamity is ready for their stumbling."
    },
    {
      "verse": 13,
      "text": "By disease their skin is consumed; the firstborn of Death consumes their limbs."
    },
    {
      "verse": 14,
      "text": "They are torn from the tent in which they trusted and are brought to the king of terrors."
    },
    {
      "verse": 15,
      "text": "In their tents nothing remains; sulfur is scattered upon their habitations."
    },
    {
      "verse": 16,
      "text": "Their roots dry up beneath, and their branches wither above."
    },
    {
      "verse": 17,
      "text": "Their memory perishes from the earth, and they have no name in the street."
    },
    {
      "verse": 18,
      "text": "They are thrust from light into darkness and driven out of the world."
    },
    {
      "verse": 19,
      "text": "They have no offspring or descendant among their people and no survivor where they used to live."
    },
    {
      "verse": 20,
      "text": "They of the west are appalled at their fate, and horror seizes those of the east."
    },
    {
      "verse": 21,
      "text": "Surely such are the dwellings of the ungodly; such is the place of those who do not know God.”"
    }
  ],
  "timestamp": "2025-08-08T15:49:40.417930"
}