{
  "book": "JOS",
  "book_name": "Joshua",
  "chapter": 1,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/JOS.1",
  "verses": [
    {
      "verse": 1,
      "text": "After the death of Moses the servant of the Lord, the Lord spoke to Joshua son of Nun, Moses’s assistant, saying,"
    },
    {
      "verse": 2,
      "text": "“My servant Moses is dead. Now proceed to cross the Jordan, you and all this people, into the land that I am giving to them, to the Israelites."
    },
    {
      "verse": 3,
      "text": "Every place that the sole of your foot will tread upon I have given to you, as I promised to Moses."
    },
    {
      "verse": 4,
      "text": "From the wilderness and the Lebanon as far as the great river, the River Euphrates, all the land of the Hittites, to the Great Sea in the west shall be your territory."
    },
    {
      "verse": 5,
      "text": "No one shall be able to stand against you all the days of your life. As I was with Moses, so I will be with you; I will not fail you or forsake you."
    },
    {
      "verse": 6,
      "text": "Be strong and courageous, for you shall lead this people to possess the land that I swore to their ancestors to give them."
    },
    {
      "verse": 7,
      "text": "Only be strong and very courageous, being careful to act in accordance with all the law that my servant Moses commanded you; do not turn from it to the right hand or to the left, so that you may be successful wherever you go."
    },
    {
      "verse": 8,
      "text": "This book of the law shall not depart out of your mouth; you shall meditate on it day and night, so that you may be careful to act in accordance with all that is written in it. For then you shall make your way prosperous, and then you shall be successful."
    },
    {
      "verse": 9,
      "text": "I hereby command you: Be strong and courageous; do not be frightened or dismayed, for the Lord your God is with you wherever you go.”"
    },
    {
      "verse": 10,
      "text": "Then Joshua commanded the officers of the people,"
    },
    {
      "verse": 11,
      "text": "“Pass through the camp and command the people, ‘Prepare your provisions, for in three days you are to cross over this Jordan, to go in to take possession of the land that the Lord your God gives you to possess.’ ”"
    },
    {
      "verse": 12,
      "text": "But to the Reubenites, the Gadites, and the half-tribe of Manasseh Joshua said,"
    },
    {
      "verse": 13,
      "text": "“Remember the word that Moses the servant of the Lord commanded you, saying, ‘The Lord your God is providing you a place of rest and will give you this land.’"
    },
    {
      "verse": 14,
      "text": "Your wives, your little ones, and your livestock shall remain in the land that Moses gave you beyond the Jordan. But all the warriors among you shall cross over armed before your kindred and shall help them,"
    },
    {
      "verse": 15,
      "text": "until the Lord gives rest to your kindred as well as to you, and they also take possession of the land that the Lord your God is giving them. Then you shall return to your own land and take possession of it, the land that Moses the servant of the Lord gave you beyond the Jordan to the east.”"
    },
    {
      "verse": 16,
      "text": "They answered Joshua, “All that you have commanded us we will do, and wherever you send us we will go."
    },
    {
      "verse": 17,
      "text": "Just as we obeyed Moses in all things, so we will obey you. Only may the Lord your God be with you, as he was with Moses!"
    },
    {
      "verse": 18,
      "text": "Whoever rebels against your orders and disobeys your words, whatever you command, shall be put to death. Only be strong and courageous.”"
    }
  ],
  "timestamp": "2025-08-08T15:48:42.466485"
}