{
  "book": "LAM",
  "book_name": "Lamentations",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LAM.3",
  "verses": [
    {
      "verse": 1,
      "text": "I am one who has seen affliction under the rod of God’s wrath;"
    },
    {
      "verse": 2,
      "text": "he has driven and brought me into darkness without any light;"
    },
    {
      "verse": 3,
      "text": "against me alone he turns his hand, again and again, all day long."
    },
    {
      "verse": 4,
      "text": "He has made my flesh and my skin waste away; he has broken my bones;"
    },
    {
      "verse": 5,
      "text": "he has besieged and enveloped me with bitterness and tribulation;"
    },
    {
      "verse": 6,
      "text": "he has made me sit in darkness like the dead of long ago."
    },
    {
      "verse": 7,
      "text": "He has walled me about so that I cannot escape; he has put heavy chains on me;"
    },
    {
      "verse": 8,
      "text": "though I call and cry for help, he shuts out my prayer;"
    },
    {
      "verse": 9,
      "text": "he has blocked my ways with hewn stones; he has made my paths crooked."
    },
    {
      "verse": 10,
      "text": "He is a bear lying in wait for me, a lion in hiding;"
    },
    {
      "verse": 11,
      "text": "he led me off my way and tore me to pieces; he has made me desolate;"
    },
    {
      "verse": 12,
      "text": "he bent his bow and set me as a mark for his arrow."
    },
    {
      "verse": 13,
      "text": "He shot into my vitals the arrows of his quiver;"
    },
    {
      "verse": 14,
      "text": "I have become the laughingstock of all my people, the object of their taunt songs all day long."
    },
    {
      "verse": 15,
      "text": "He has filled me with bitterness; he has sated me with wormwood."
    },
    {
      "verse": 16,
      "text": "He has made my teeth grind on gravel; he has made me cower in ashes;"
    },
    {
      "verse": 17,
      "text": "my soul is bereft of peace; I have forgotten what happiness is;"
    },
    {
      "verse": 18,
      "text": "so I say, “Gone is my glory and all that I had hoped for from the Lord.”"
    },
    {
      "verse": 19,
      "text": "The thought of my affliction and my homelessness is wormwood and gall!"
    },
    {
      "verse": 20,
      "text": "My soul continually thinks of it and is bowed down within me."
    },
    {
      "verse": 21,
      "text": "But this I call to mind, and therefore I have hope:"
    },
    {
      "verse": 22,
      "text": "The steadfast love of the Lord never ceases, his mercies never come to an end;"
    },
    {
      "verse": 23,
      "text": "they are new every morning; great is your faithfulness."
    },
    {
      "verse": 24,
      "text": "“The Lord is my portion,” says my soul, “therefore I will hope in him.”"
    },
    {
      "verse": 25,
      "text": "The Lord is good to those who wait for him, to the soul that seeks him."
    },
    {
      "verse": 26,
      "text": "It is good that one should wait quietly for the salvation of the Lord."
    },
    {
      "verse": 27,
      "text": "It is good for one to bear the yoke in youth,"
    },
    {
      "verse": 28,
      "text": "to sit alone in silence when the Lord has imposed it,"
    },
    {
      "verse": 29,
      "text": "to put one’s mouth to the dust (there may yet be hope),"
    },
    {
      "verse": 30,
      "text": "to give one’s cheek to the smiter and be filled with insults."
    },
    {
      "verse": 31,
      "text": "For the Lord will not reject forever."
    },
    {
      "verse": 32,
      "text": "Although he causes grief, he will have compassion according to the abundance of his steadfast love;"
    },
    {
      "verse": 33,
      "text": "for he does not willingly afflict or grieve anyone."
    },
    {
      "verse": 34,
      "text": "When all the prisoners of the land are crushed under foot,"
    },
    {
      "verse": 35,
      "text": "when justice is perverted in the presence of the Most High,"
    },
    {
      "verse": 36,
      "text": "when one’s case is subverted— does the Lord not see it?"
    },
    {
      "verse": 37,
      "text": "Who can command and have it done, if the Lord has not ordained it?"
    },
    {
      "verse": 38,
      "text": "Is it not from the mouth of the Most High that evil and good come?"
    },
    {
      "verse": 39,
      "text": "Why should any who draw breath complain about the punishment of their sins?"
    },
    {
      "verse": 40,
      "text": "Let us test and examine our ways and return to the Lord."
    },
    {
      "verse": 41,
      "text": "Let us lift up our hearts as well as our hands to God in heaven."
    },
    {
      "verse": 42,
      "text": "We have transgressed and rebelled, and you have not forgiven."
    },
    {
      "verse": 43,
      "text": "You have wrapped yourself with anger and pursued us, killing without pity;"
    },
    {
      "verse": 44,
      "text": "you have wrapped yourself with a cloud so that no prayer can pass through."
    },
    {
      "verse": 45,
      "text": "You have made us filth and rubbish among the peoples."
    },
    {
      "verse": 46,
      "text": "All our enemies have opened their mouths against us;"
    },
    {
      "verse": 47,
      "text": "panic and pitfall have come upon us, devastation and destruction."
    },
    {
      "verse": 48,
      "text": "My eyes flow with rivers of tears because of the destruction of my people."
    },
    {
      "verse": 49,
      "text": "My eyes will flow without ceasing, without respite,"
    },
    {
      "verse": 50,
      "text": "until the Lord from heaven looks down and sees."
    },
    {
      "verse": 51,
      "text": "My eyes cause me grief at the fate of all the young women in my city."
    },
    {
      "verse": 52,
      "text": "Those who were my enemies without cause have hunted me like a bird;"
    },
    {
      "verse": 53,
      "text": "they flung me alive into a pit and hurled stones on me;"
    },
    {
      "verse": 54,
      "text": "water closed over my head; I said, “I am lost.”"
    },
    {
      "verse": 55,
      "text": "I called on your name, O Lord, from the depths of the pit;"
    },
    {
      "verse": 56,
      "text": "you heard my plea, “Do not close your ear to my cry for help, but give me relief!”"
    },
    {
      "verse": 57,
      "text": "You came near when I called on you; you said, “Do not fear!”"
    },
    {
      "verse": 58,
      "text": "You have taken up my cause, O Lord; you have redeemed my life."
    },
    {
      "verse": 59,
      "text": "You have seen the wrong done to me, O Lord; judge my cause."
    },
    {
      "verse": 60,
      "text": "You have seen all their malice, all their plots against me."
    },
    {
      "verse": 61,
      "text": "You have heard their taunts, O Lord, all their plots against me."
    },
    {
      "verse": 62,
      "text": "The whispers and murmurs of my assailants are against me all day long."
    },
    {
      "verse": 63,
      "text": "Whether they sit or rise—see, I am the object of their taunt songs."
    },
    {
      "verse": 64,
      "text": "Pay them back for their deeds, O Lord, according to the work of their hands!"
    },
    {
      "verse": 65,
      "text": "Give them anguish of heart; your curse be on them!"
    },
    {
      "verse": 66,
      "text": "Pursue them in anger and destroy them from under the Lord ’s heavens."
    }
  ],
  "timestamp": "2025-08-08T15:50:43.974322"
}