{
  "book": "LEV",
  "book_name": "Leviticus",
  "chapter": 18,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LEV.18",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord spoke to Moses, saying:"
    },
    {
      "verse": 2,
      "text": "“Speak to the Israelites and say to them: I am the Lord your God."
    },
    {
      "verse": 3,
      "text": "You shall not do as they do in the land of Egypt, where you lived, and you shall not do as they do in the land of Canaan, to which I am bringing you. You shall not follow their statutes."
    },
    {
      "verse": 4,
      "text": "My ordinances you shall observe, and my statutes you shall keep, following them: I am the Lord your God."
    },
    {
      "verse": 5,
      "text": "You shall keep my statutes and my ordinances; by doing so one shall live: I am the Lord."
    },
    {
      "verse": 6,
      "text": "“None of you shall approach anyone near of kin to uncover nakedness: I am the Lord."
    },
    {
      "verse": 7,
      "text": "You shall not uncover the nakedness of your father, which is the nakedness of your mother; she is your mother; you shall not uncover her nakedness."
    },
    {
      "verse": 8,
      "text": "You shall not uncover the nakedness of your father’s wife; it is the nakedness of your father."
    },
    {
      "verse": 9,
      "text": "You shall not uncover the nakedness of your sister, your father’s daughter or your mother’s daughter, whether born at home or born abroad."
    },
    {
      "verse": 10,
      "text": "You shall not uncover the nakedness of your son’s daughter or of your daughter’s daughter, for their nakedness is your own nakedness."
    },
    {
      "verse": 11,
      "text": "You shall not uncover the nakedness of your father’s wife’s daughter, born in your father’s house, since she is your sister."
    },
    {
      "verse": 12,
      "text": "You shall not uncover the nakedness of your father’s sister; she is your father’s flesh."
    },
    {
      "verse": 13,
      "text": "You shall not uncover the nakedness of your mother’s sister, for she is your mother’s flesh."
    },
    {
      "verse": 14,
      "text": "You shall not uncover the nakedness of your father’s brother; that is, you shall not approach his wife; she is your aunt."
    },
    {
      "verse": 15,
      "text": "You shall not uncover the nakedness of your daughter-in-law: she is your son’s wife; you shall not uncover her nakedness."
    },
    {
      "verse": 16,
      "text": "You shall not uncover the nakedness of your brother’s wife; it is your brother’s nakedness."
    },
    {
      "verse": 17,
      "text": "You shall not uncover the nakedness of a woman and her daughter, and you shall not take her son’s daughter or her daughter’s daughter to uncover her nakedness; they are your flesh; it is depravity."
    },
    {
      "verse": 18,
      "text": "And you shall not take a woman as a rival to her sister, uncovering her nakedness while her sister is still alive."
    },
    {
      "verse": 19,
      "text": "“You shall not approach a woman to uncover her nakedness while she is in her menstrual uncleanness."
    },
    {
      "verse": 20,
      "text": "You shall not have sexual relations with your neighbor’s wife and defile yourself with her."
    },
    {
      "verse": 21,
      "text": "You shall not give any of your offspring to sacrifice them to Molech and so profane the name of your God: I am the Lord."
    },
    {
      "verse": 22,
      "text": "You shall not lie with a male as with a woman; it is an abomination."
    },
    {
      "verse": 23,
      "text": "You shall not have sexual relations with any animal and defile yourself with it, nor shall any woman give herself to an animal to have sexual relations with it; it is perversion."
    },
    {
      "verse": 24,
      "text": "“Do not defile yourselves in any of these ways, for by all these practices the nations I am casting out before you have defiled themselves."
    },
    {
      "verse": 25,
      "text": "Thus the land became defiled, and I punished it for its iniquity, and the land vomited out its inhabitants."
    },
    {
      "verse": 26,
      "text": "But you shall keep my statutes and my ordinances and commit none of these abominations, either the native-born or the alien who resides among you"
    },
    {
      "verse": 27,
      "text": "(for the inhabitants of the land, who were before you, committed all of these abominations, and the land became defiled);"
    },
    {
      "verse": 28,
      "text": "otherwise the land will vomit you out for defiling it, as it vomited out the nation that was before you."
    },
    {
      "verse": 29,
      "text": "For whoever commits any of these abominations shall be cut off from their people."
    },
    {
      "verse": 30,
      "text": "So keep my charge not to commit any of these abominations that were done before you and not to defile yourselves by them: I am the Lord your God.”"
    }
  ],
  "timestamp": "2025-08-08T15:48:25.958078"
}