{
  "book": "LEV",
  "book_name": "Leviticus",
  "chapter": 16,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LEV.16",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord spoke to Moses after the death of the two sons of Aaron, when they drew near before the Lord and died."
    },
    {
      "verse": 2,
      "text": "The Lord said to Moses: “Tell your brother Aaron not to come just at any time into the sanctuary inside the curtain before the cover that is upon the ark, or he will die, for I appear in the cloud upon the cover."
    },
    {
      "verse": 3,
      "text": "Thus shall Aaron come into the holy place: with a young bull for a purification offering and a ram for a burnt offering."
    },
    {
      "verse": 4,
      "text": "He shall put on the holy linen tunic and shall have the linen undergarments next to his body, fasten the linen sash, and wear the linen turban; these are the holy vestments. He shall bathe his body in water and then put them on."
    },
    {
      "verse": 5,
      "text": "He shall take from the congregation of the Israelites two male goats for a purification offering and one ram for a burnt offering."
    },
    {
      "verse": 6,
      "text": "“Aaron shall offer the bull as a purification offering for himself and shall make atonement for himself and for his house."
    },
    {
      "verse": 7,
      "text": "He shall take the two goats and set them before the Lord at the entrance of the tent of meeting,"
    },
    {
      "verse": 8,
      "text": "and Aaron shall cast lots on the two goats, one lot for the Lord and the other lot for Azazel."
    },
    {
      "verse": 9,
      "text": "Aaron shall present the goat on which the lot fell for the Lord and offer it as a purification offering,"
    },
    {
      "verse": 10,
      "text": "but the goat on which the lot fell for Azazel shall be presented alive before the Lord to make atonement over it, that it may be sent away into the wilderness to Azazel."
    },
    {
      "verse": 11,
      "text": "“Aaron shall present the bull as a purification offering for himself and shall make atonement for himself and for his house; he shall slaughter the bull as a purification offering for himself."
    },
    {
      "verse": 12,
      "text": "He shall take a censer full of coals of fire from the altar before the Lord and two handfuls of crushed sweet incense, and he shall bring it inside the curtain"
    },
    {
      "verse": 13,
      "text": "and put the incense on the fire before the Lord, that the cloud of the incense may shroud the cover that is upon the covenant, or he will die."
    },
    {
      "verse": 14,
      "text": "He shall take some of the blood of the bull and sprinkle it with his finger on the front of the cover, and before the cover he shall sprinkle the blood with his finger seven times."
    },
    {
      "verse": 15,
      "text": "“He shall slaughter the goat of the purification offering that is for the people and bring its blood inside the curtain and do with its blood as he did with the blood of the bull, sprinkling it upon the cover and before the cover."
    },
    {
      "verse": 16,
      "text": "Thus he shall make atonement for the sanctuary, because of the uncleannesses of the Israelites and because of their transgressions, all their sins, and so he shall do for the tent of meeting, which remains with them in the midst of their uncleanness."
    },
    {
      "verse": 17,
      "text": "No one shall be in the tent of meeting from the time he enters to make atonement in the sanctuary until he comes out and has made atonement for himself and for his house and for all the assembly of Israel."
    },
    {
      "verse": 18,
      "text": "Then he shall go out to the altar that is before the Lord and make atonement on its behalf and shall take some of the blood of the bull and of the blood of the goat and put it on each of the horns of the altar."
    },
    {
      "verse": 19,
      "text": "He shall sprinkle some of the blood on it with his finger seven times and cleanse it and sanctify it from the uncleannesses of the Israelites."
    },
    {
      "verse": 20,
      "text": "“When he has finished atoning for the holy place and the tent of meeting and the altar, he shall present the live goat."
    },
    {
      "verse": 21,
      "text": "Then Aaron shall lay both his hands on the head of the live goat and confess over it all the iniquities of the Israelites, and all their transgressions, all their sins, putting them on the head of the goat and sending it away into the wilderness by means of someone designated for the task."
    },
    {
      "verse": 22,
      "text": "The goat shall bear on itself all their iniquities to a barren region, and the goat shall be set free in the wilderness."
    },
    {
      "verse": 23,
      "text": "“Then Aaron shall enter the tent of meeting and shall take off the linen vestments that he put on when he went into the holy place and shall leave them there."
    },
    {
      "verse": 24,
      "text": "He shall bathe his body in water in a holy place and put on his vestments; then he shall come out and offer his burnt offering and the burnt offering of the people, making atonement for himself and for the people."
    },
    {
      "verse": 25,
      "text": "The fat of the purification offering he shall turn into smoke on the altar."
    },
    {
      "verse": 26,
      "text": "The one who sets the goat free for Azazel shall wash his clothes and bathe his body in water and afterward may come into the camp."
    },
    {
      "verse": 27,
      "text": "The bull of the purification offering and the goat of the purification offering, whose blood was brought in to make atonement in the holy place, shall be taken outside the camp; their skin and their flesh and their dung shall be consumed in fire."
    },
    {
      "verse": 28,
      "text": "The one who burns them shall wash his clothes and bathe his body in water and afterward may come into the camp."
    },
    {
      "verse": 29,
      "text": "“This shall be a statute to you forever: In the seventh month, on the tenth day of the month, you shall humble yourselves and shall do no work, neither the native-born nor the alien who resides among you."
    },
    {
      "verse": 30,
      "text": "For on this day atonement shall be made for you, to cleanse you; from all your sins you shall be clean before the Lord."
    },
    {
      "verse": 31,
      "text": "It is a Sabbath of complete rest to you, and you shall humble yourselves; it is a statute forever."
    },
    {
      "verse": 32,
      "text": "The priest who is anointed and consecrated as priest in his father’s place shall make atonement, wearing the linen vestments, the holy vestments."
    },
    {
      "verse": 33,
      "text": "He shall make atonement for the sanctuary, and he shall make atonement for the tent of meeting and for the altar, and he shall make atonement for the priests and for all the people of the assembly."
    },
    {
      "verse": 34,
      "text": "This shall be an everlasting statute for you, to make atonement for the Israelites once in the year for all their sins.” And Moses did as the Lord had commanded him."
    }
  ],
  "timestamp": "2025-08-08T15:48:25.567516"
}