{
  "book": "LEV",
  "book_name": "Leviticus",
  "chapter": 25,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LEV.25",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord spoke to Moses on Mount Sinai, saying,"
    },
    {
      "verse": 2,
      "text": "“Speak to the Israelites and say to them: When you enter the land that I am giving you, the land shall observe a Sabbath for the Lord."
    },
    {
      "verse": 3,
      "text": "Six years you shall sow your field, and six years you shall prune your vineyard and gather in their yield,"
    },
    {
      "verse": 4,
      "text": "but in the seventh year there shall be a Sabbath of complete rest for the land, a Sabbath for the Lord: you shall not sow your field or prune your vineyard."
    },
    {
      "verse": 5,
      "text": "You shall not reap the aftergrowth of your harvest or gather the grapes of your unpruned vine: it shall be a year of complete rest for the land."
    },
    {
      "verse": 6,
      "text": "You may eat what the land yields during its Sabbath—you, your male and female slaves, your hired and your bound laborers who live with you,"
    },
    {
      "verse": 7,
      "text": "for your livestock also, and for the wild animals in your land all its yield shall be for food."
    },
    {
      "verse": 8,
      "text": "“You shall count off seven weeks of years, seven times seven years, so that the period of seven weeks of years gives forty-nine years."
    },
    {
      "verse": 9,
      "text": "Then you shall have the trumpet sounded loud; on the tenth day of the seventh month—on the Day of Atonement—you shall have the trumpet sounded throughout all your land."
    },
    {
      "verse": 10,
      "text": "And you shall hallow the fiftieth year, and you shall proclaim liberty throughout the land to all its inhabitants. It shall be a Jubilee for you: you shall return, every one of you, to your property and every one of you to your family."
    },
    {
      "verse": 11,
      "text": "That fiftieth year shall be a Jubilee for you: you shall not sow or reap the aftergrowth or harvest the unpruned vines."
    },
    {
      "verse": 12,
      "text": "For it is a Jubilee; it shall be holy to you: you shall eat only what the field itself produces."
    },
    {
      "verse": 13,
      "text": "“In this year of Jubilee you shall return, every one of you, to your property."
    },
    {
      "verse": 14,
      "text": "When you make a sale to your neighbor or buy from your neighbor, you shall not cheat one another."
    },
    {
      "verse": 15,
      "text": "When you buy from your neighbor, you shall pay only for the number of years until the Jubilee; the seller shall charge you only for the remaining crop years."
    },
    {
      "verse": 16,
      "text": "If the years are more, you shall increase the price, and if the years are fewer, you shall diminish the price, for it is a certain number of harvests that are being sold to you."
    },
    {
      "verse": 17,
      "text": "You shall not cheat one another, but you shall fear your God, for I am the Lord your God."
    },
    {
      "verse": 18,
      "text": "“You shall observe my statutes and faithfully keep my ordinances, so that you may live on the land securely."
    },
    {
      "verse": 19,
      "text": "The land will yield its fruit, and you will eat your fill and live on it securely."
    },
    {
      "verse": 20,
      "text": "Should you ask, ‘What shall we eat in the seventh year, if we may not sow or gather in our crop?’"
    },
    {
      "verse": 21,
      "text": "I will order my blessing for you in the sixth year, so that it will yield a crop for three years."
    },
    {
      "verse": 22,
      "text": "When you sow in the eighth year, you will be eating from the old crop; until the ninth year, when its produce comes in, you shall eat the old."
    },
    {
      "verse": 23,
      "text": "The land shall not be sold in perpetuity, for the land is mine; with me you are but aliens and tenants."
    },
    {
      "verse": 24,
      "text": "Throughout the land that you hold, you shall provide for the redemption of the land."
    },
    {
      "verse": 25,
      "text": "“If anyone of your kin falls into difficulty and sells a piece of property, then the next of kin shall come and redeem what the relative has sold."
    },
    {
      "verse": 26,
      "text": "If the person has no one to redeem it but then prospers and finds sufficient means to do so,"
    },
    {
      "verse": 27,
      "text": "the years since its sale shall be computed and the difference refunded to the person to whom it was sold, and the property shall be returned."
    },
    {
      "verse": 28,
      "text": "But if there are not sufficient means to recover it, what was sold shall remain with the purchaser until the year of Jubilee; in the Jubilee it shall be released, and the property shall be returned."
    },
    {
      "verse": 29,
      "text": "“If anyone sells a dwelling house in a walled city, it may be redeemed until a year has elapsed since its sale; the right of redemption shall be one year."
    },
    {
      "verse": 30,
      "text": "If it is not redeemed before a full year has elapsed, a house that is in a walled city shall pass in perpetuity to the purchaser, throughout the generations; it shall not be released in the Jubilee."
    },
    {
      "verse": 31,
      "text": "But houses in villages that have no walls around them shall be classed as open country; they may be redeemed, and they shall be released in the Jubilee."
    },
    {
      "verse": 32,
      "text": "As for the cities of the Levites, the Levites shall forever have the right of redemption of the houses in the cities belonging to them."
    },
    {
      "verse": 33,
      "text": "Whatever property of the Levites that may be redeemed, that is, houses sold in a city belonging to them, shall be released in the Jubilee, for the houses in the cities of the Levites are their possession among the Israelites."
    },
    {
      "verse": 34,
      "text": "But the pasturelands around their cities may not be sold, for that is their possession for all time."
    },
    {
      "verse": 35,
      "text": "“If any of your kin fall into difficulty and become dependent on you, you shall support them; they shall live with you as though resident aliens."
    },
    {
      "verse": 36,
      "text": "Do not take interest in advance or otherwise make a profit from them, but fear your God; let them live with you."
    },
    {
      "verse": 37,
      "text": "You shall not lend them your money at interest taken in advance or provide them food at a profit."
    },
    {
      "verse": 38,
      "text": "I am the Lord your God who brought you out of the land of Egypt, to give you the land of Canaan, to be your God."
    },
    {
      "verse": 39,
      "text": "“If any who are dependent on you become so impoverished that they sell themselves to you, you shall not make them serve as slaves."
    },
    {
      "verse": 40,
      "text": "They shall remain with you as hired or bound laborers. They shall serve with you until the year of the Jubilee."
    },
    {
      "verse": 41,
      "text": "Then they and their children with them shall go out from your authority; they shall go back to their own family and return to their ancestral property."
    },
    {
      "verse": 42,
      "text": "For they are my servants whom I brought out of the land of Egypt; they shall not be sold as slaves are sold."
    },
    {
      "verse": 43,
      "text": "You shall not rule over them with harshness but shall fear your God."
    },
    {
      "verse": 44,
      "text": "As for the male and female slaves whom you may have, it is from the nations around you that you may acquire male and female slaves."
    },
    {
      "verse": 45,
      "text": "You may also acquire them from among the aliens residing with you and from their families who are with you who have been born in your land; they may be your property."
    },
    {
      "verse": 46,
      "text": "You may keep them as a possession for your children after you, for them to inherit as property. These you may treat as slaves, but as for your fellow Israelites, no one shall rule over the other with harshness."
    },
    {
      "verse": 47,
      "text": "“If resident aliens among you prosper, and if any of your kin fall into difficulty with one of them and sell themselves to an alien or to a branch of the alien’s family,"
    },
    {
      "verse": 48,
      "text": "even after they have sold themselves they shall have the right of redemption; one of their brothers may redeem them,"
    },
    {
      "verse": 49,
      "text": "or their uncle or their uncle’s son may redeem them, or anyone of their family who is of their own flesh may redeem them, or if they prosper they may redeem themselves."
    },
    {
      "verse": 50,
      "text": "They shall compute with the purchaser the total from the year when they sold themselves to the alien until the Jubilee year; the price of the sale shall be applied to the number of years: the time they were with the owner shall be rated as the time of a hired laborer."
    },
    {
      "verse": 51,
      "text": "If many years remain, they shall pay for their redemption in proportion to the purchase price,"
    },
    {
      "verse": 52,
      "text": "and if few years remain until the Jubilee year, they shall compute thus: according to the years involved they shall make payment for their redemption."
    },
    {
      "verse": 53,
      "text": "As a laborer hired by the year they shall be under the alien’s authority, who shall not, however, rule with harshness over them in your sight."
    },
    {
      "verse": 54,
      "text": "And if they have not been redeemed in any of these ways, they and their children with them shall go out in the Jubilee year."
    },
    {
      "verse": 55,
      "text": "For to me the Israelites are servants; they are my servants whom I brought out from the land of Egypt: I am the Lord your God."
    }
  ],
  "timestamp": "2025-08-08T15:48:27.036093"
}