{
  "book": "LEV",
  "book_name": "Leviticus",
  "chapter": 21,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LEV.21",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord said to Moses, “Speak to the priests, the sons of Aaron, and say to them: “No one shall defile himself for a dead person among his relatives,"
    },
    {
      "verse": 2,
      "text": "except for his nearest kin: his mother, his father, his son, his daughter, his brother;"
    },
    {
      "verse": 3,
      "text": "likewise, for a virgin sister close to him because she has had no husband, he may defile himself for her."
    },
    {
      "verse": 4,
      "text": "But he shall not defile himself for those related to him by marriage and so profane himself."
    },
    {
      "verse": 5,
      "text": "They shall not make bald spots upon their heads or shave off the edges of their beards or make any gashes in their flesh."
    },
    {
      "verse": 6,
      "text": "They shall be holy to their God and not profane the name of their God, for they offer the Lord ’s offerings by fire, the food of their God; therefore they shall be holy."
    },
    {
      "verse": 7,
      "text": "They shall not marry a prostitute or a woman who has been defiled; neither shall they marry a woman divorced from her husband. For they are holy to their God,"
    },
    {
      "verse": 8,
      "text": "and you shall treat them as holy, since they offer the food of your God; they shall be holy to you, for I the Lord, I who sanctify you, am holy."
    },
    {
      "verse": 9,
      "text": "When the daughter of a priest profanes herself through prostitution, she profanes her father; she shall be burned to death."
    },
    {
      "verse": 10,
      "text": "“The priest who is exalted above his brothers, on whose head the anointing oil has been poured and who has been consecrated to wear the vestments, shall not dishevel his hair nor tear his vestments."
    },
    {
      "verse": 11,
      "text": "He shall not go where there is a dead body; he shall not defile himself even for his father or mother."
    },
    {
      "verse": 12,
      "text": "He shall not go outside the sanctuary and thus profane the sanctuary of his God, for the consecration of the anointing oil of his God is upon him: I am the Lord."
    },
    {
      "verse": 13,
      "text": "He shall marry only a woman who is a virgin."
    },
    {
      "verse": 14,
      "text": "A widow or a divorced woman or a woman who has been defiled, a prostitute—these he shall not marry. He shall marry a virgin of his own people,"
    },
    {
      "verse": 15,
      "text": "that he may not profane his offspring among his people, for I am the Lord; I sanctify him.”"
    },
    {
      "verse": 16,
      "text": "The Lord spoke to Moses, saying,"
    },
    {
      "verse": 17,
      "text": "“Speak to Aaron and say: No one of your offspring throughout their generations who has a blemish may approach to offer the food of his God."
    },
    {
      "verse": 18,
      "text": "Indeed, no one who has a blemish shall draw near, one who is blind or lame, or one who is mutilated or deformed,"
    },
    {
      "verse": 19,
      "text": "or one who has a broken foot or a broken hand,"
    },
    {
      "verse": 20,
      "text": "or a hunchback, or a dwarf, or a man with a defect in his eyes or an itching disease or scabs or crushed testicles."
    },
    {
      "verse": 21,
      "text": "No descendant of Aaron the priest who has a blemish shall come near to offer the Lord ’s offerings by fire; since he has a blemish, he shall not come near to offer the food of his God."
    },
    {
      "verse": 22,
      "text": "He may eat the food of his God, of the most holy as well as of the holy."
    },
    {
      "verse": 23,
      "text": "But he shall not come near the curtain or approach the altar because he has a blemish, that he may not profane my sanctuaries, for I am the Lord; I sanctify them.”"
    },
    {
      "verse": 24,
      "text": "Thus Moses spoke to Aaron and to his sons and to all the Israelites."
    }
  ],
  "timestamp": "2025-08-08T15:48:26.430637"
}