{
  "book": "LUK",
  "book_name": "Luke",
  "chapter": 6,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LUK.6",
  "verses": [
    {
      "verse": 1,
      "text": "One Sabbath while Jesus was going through some grain fields, his disciples plucked some heads of grain, rubbed them in their hands, and ate them."
    },
    {
      "verse": 2,
      "text": "But some of the Pharisees said, “Why are you doing what is not lawful on the Sabbath?”"
    },
    {
      "verse": 3,
      "text": "Jesus answered, “Have you not read what David did when he and his companions were hungry?"
    },
    {
      "verse": 4,
      "text": "How he entered the house of God and took and ate the bread of the Presence, which it is not lawful for any but the priests to eat, and gave some to his companions?”"
    },
    {
      "verse": 5,
      "text": "Then he said to them, “The Son of Man is lord of the Sabbath.”"
    },
    {
      "verse": 6,
      "text": "On another Sabbath he entered the synagogue and taught, and there was a man there whose right hand was withered."
    },
    {
      "verse": 7,
      "text": "The scribes and the Pharisees were watching him to see whether he would cure on the Sabbath, so that they might find grounds to bring an accusation against him."
    },
    {
      "verse": 8,
      "text": "But he knew what they were thinking, and he said to the man who had the withered hand, “Come and stand in the middle.” He got up and stood there."
    },
    {
      "verse": 9,
      "text": "Then Jesus said to them, “I ask you, is it lawful to do good or to do harm on the Sabbath, to save life or to destroy it?”"
    },
    {
      "verse": 10,
      "text": "After looking around at all of them, he said to him, “Stretch out your hand.” He did so, and his hand was restored."
    },
    {
      "verse": 11,
      "text": "But they were filled with fury and began discussing with one another what they might do to Jesus."
    },
    {
      "verse": 12,
      "text": "Now during those days he went out to the mountain to pray, and he spent the night in prayer to God."
    },
    {
      "verse": 13,
      "text": "And when day came, he called his disciples and chose twelve of them, whom he also named apostles:"
    },
    {
      "verse": 14,
      "text": "Simon, whom he named Peter, and his brother Andrew, and James, and John, and Philip, and Bartholomew,"
    },
    {
      "verse": 15,
      "text": "and Matthew, and Thomas, and James son of Alphaeus, and Simon, who was called the Zealot,"
    },
    {
      "verse": 16,
      "text": "and Judas son of James, and Judas Iscariot, who became a traitor."
    },
    {
      "verse": 17,
      "text": "He came down with them and stood on a level place with a great crowd of his disciples and a great multitude of people from all Judea, Jerusalem, and the coast of Tyre and Sidon."
    },
    {
      "verse": 18,
      "text": "They had come to hear him and to be healed of their diseases, and those who were troubled with unclean spirits were cured."
    },
    {
      "verse": 19,
      "text": "And everyone in the crowd was trying to touch him, for power came out from him and healed all of them."
    },
    {
      "verse": 20,
      "text": "Then he looked up at his disciples and said: “Blessed are you who are poor, for yours is the kingdom of God."
    },
    {
      "verse": 21,
      "text": "“Blessed are you who are hungry now, for you will be filled. “Blessed are you who weep now, for you will laugh."
    },
    {
      "verse": 22,
      "text": "“Blessed are you when people hate you and when they exclude you, revile you, and defame you on account of the Son of Man."
    },
    {
      "verse": 23,
      "text": "Rejoice on that day and leap for joy, for surely your reward is great in heaven, for that is how their ancestors treated the prophets."
    },
    {
      "verse": 24,
      "text": "“But woe to you who are rich, for you have received your consolation."
    },
    {
      "verse": 25,
      "text": "“Woe to you who are full now, for you will be hungry. “Woe to you who are laughing now, for you will mourn and weep."
    },
    {
      "verse": 26,
      "text": "“Woe to you when all speak well of you, for that is how their ancestors treated the false prophets."
    },
    {
      "verse": 27,
      "text": "“But I say to you who are listening: Love your enemies; do good to those who hate you;"
    },
    {
      "verse": 28,
      "text": "bless those who curse you; pray for those who mistreat you."
    },
    {
      "verse": 29,
      "text": "If anyone strikes you on the cheek, offer the other also, and from anyone who takes away your coat do not withhold even your shirt."
    },
    {
      "verse": 30,
      "text": "Give to everyone who asks of you, and if anyone takes away what is yours, do not ask for it back again."
    },
    {
      "verse": 31,
      "text": "Do to others as you would have them do to you."
    },
    {
      "verse": 32,
      "text": "“If you love those who love you, what credit is that to you? For even sinners love those who love them."
    },
    {
      "verse": 33,
      "text": "If you do good to those who do good to you, what credit is that to you? For even sinners do the same."
    },
    {
      "verse": 34,
      "text": "If you lend to those from whom you expect to receive payment, what credit is that to you? Even sinners lend to sinners, to receive as much again."
    },
    {
      "verse": 35,
      "text": "Instead, love your enemies, do good, and lend, expecting nothing in return. Your reward will be great, and you will be children of the Most High, for he himself is kind to the ungrateful and the wicked."
    },
    {
      "verse": 36,
      "text": "Be merciful, just as your Father is merciful."
    },
    {
      "verse": 37,
      "text": "“Do not judge, and you will not be judged; do not condemn, and you will not be condemned. Forgive, and you will be forgiven;"
    },
    {
      "verse": 38,
      "text": "give, and it will be given to you. A good measure, pressed down, shaken together, running over, will be put into your lap, for the measure you give will be the measure you get back.”"
    },
    {
      "verse": 39,
      "text": "He also told them a parable: “Can a blind person guide a blind person? Will not both fall into a pit?"
    },
    {
      "verse": 40,
      "text": "A disciple is not above the teacher, but every disciple who is fully qualified will be like the teacher."
    },
    {
      "verse": 41,
      "text": "Why do you see the speck in your neighbor’s eye but do not notice the log in your own eye?"
    },
    {
      "verse": 42,
      "text": "Or how can you say to your neighbor, ‘Friend, let me take out the speck in your eye,’ when you yourself do not see the log in your own eye? You hypocrite, first take the log out of your own eye, and then you will see clearly to take the speck out of your neighbor’s eye."
    },
    {
      "verse": 43,
      "text": "“No good tree bears bad fruit, nor again does a bad tree bear good fruit;"
    },
    {
      "verse": 44,
      "text": "for each tree is known by its own fruit. For people do not gather figs from thorns, nor do they pick grapes from a bramble bush."
    },
    {
      "verse": 45,
      "text": "The good person out of the good treasure of the heart produces good, and the evil person out of evil treasure produces evil, for it is out of the abundance of the heart that the mouth speaks."
    },
    {
      "verse": 46,
      "text": "“Why do you call me ‘Lord, Lord,’ and do not do what I tell you?"
    },
    {
      "verse": 47,
      "text": "I will show you what someone is like who comes to me, hears my words, and acts on them."
    },
    {
      "verse": 48,
      "text": "That one is like a man building a house who dug deeply and laid the foundation on rock; when a flood arose, the river burst against that house but could not shake it because it had been well built."
    },
    {
      "verse": 49,
      "text": "But the one who hears and does not act is like a man who built a house on the ground without a foundation. When the river burst against it, it quickly collapsed, and great was the ruin of that house.”"
    }
  ],
  "timestamp": "2025-08-08T15:51:35.467725"
}