{
  "book": "LUK",
  "book_name": "Luke",
  "chapter": 1,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LUK.1",
  "verses": [
    {
      "verse": 1,
      "text": "Since many have undertaken to compile a narrative about the events that have been fulfilled among us,"
    },
    {
      "verse": 2,
      "text": "just as they were handed on to us by those who from the beginning were eyewitnesses and servants of the word,"
    },
    {
      "verse": 3,
      "text": "I, too, decided, as one having a grasp of everything from the start, to write a well-ordered account for you, most excellent Theophilus,"
    },
    {
      "verse": 4,
      "text": "so that you may have a firm grasp of the words in which you have been instructed."
    },
    {
      "verse": 5,
      "text": "In the days of King Herod of Judea, there was a priest named Zechariah, who belonged to the priestly order of Abijah. His wife was descended from the daughters of Aaron, and her name was Elizabeth."
    },
    {
      "verse": 6,
      "text": "Both of them were righteous before God, living blamelessly according to all the commandments and regulations of the Lord."
    },
    {
      "verse": 7,
      "text": "But they had no children because Elizabeth was barren, and both were getting on in years."
    },
    {
      "verse": 8,
      "text": "Once when he was serving as priest before God during his section’s turn of duty,"
    },
    {
      "verse": 9,
      "text": "he was chosen by lot, according to the custom of the priesthood, to enter the sanctuary of the Lord to offer incense."
    },
    {
      "verse": 10,
      "text": "Now at the time of the incense offering, the whole assembly of the people was praying outside."
    },
    {
      "verse": 11,
      "text": "Then there appeared to him an angel of the Lord, standing at the right side of the altar of incense."
    },
    {
      "verse": 12,
      "text": "When Zechariah saw him, he was terrified, and fear overwhelmed him."
    },
    {
      "verse": 13,
      "text": "But the angel said to him, “Do not be afraid, Zechariah, for your prayer has been heard. Your wife Elizabeth will bear you a son, and you will name him John."
    },
    {
      "verse": 14,
      "text": "You will have joy and gladness, and many will rejoice at his birth,"
    },
    {
      "verse": 15,
      "text": "for he will be great in the sight of the Lord. He must never drink wine or strong drink; even before his birth he will be filled with the Holy Spirit."
    },
    {
      "verse": 16,
      "text": "He will turn many of the people of Israel to the Lord their God."
    },
    {
      "verse": 17,
      "text": "With the spirit and power of Elijah he will go before him, to turn the hearts of parents to their children and the disobedient to the wisdom of the righteous, to make ready a people prepared for the Lord.”"
    },
    {
      "verse": 18,
      "text": "Zechariah said to the angel, “How can I know that this will happen? For I am an old man, and my wife is getting on in years.”"
    },
    {
      "verse": 19,
      "text": "The angel replied, “I am Gabriel. I stand in the presence of God, and I have been sent to speak to you and to bring you this good news."
    },
    {
      "verse": 20,
      "text": "But now, because you did not believe my words, which will be fulfilled in their time, you will become mute, unable to speak, until the day these things occur.”"
    },
    {
      "verse": 21,
      "text": "Meanwhile the people were waiting for Zechariah and wondering at his delay in the sanctuary."
    },
    {
      "verse": 22,
      "text": "When he did come out, he was unable to speak to them, and they realized that he had seen a vision in the sanctuary. He kept motioning to them and remained unable to speak."
    },
    {
      "verse": 23,
      "text": "When his time of service was ended, he returned to his home."
    },
    {
      "verse": 24,
      "text": "After those days his wife Elizabeth conceived, and for five months she remained in seclusion. She said,"
    },
    {
      "verse": 25,
      "text": "“This is what the Lord has done for me in this time, when he looked favorably on me and took away the disgrace I have endured among my people.”"
    },
    {
      "verse": 26,
      "text": "In the sixth month the angel Gabriel was sent by God to a town in Galilee called Nazareth,"
    },
    {
      "verse": 27,
      "text": "to a virgin engaged to a man whose name was Joseph, of the house of David. The virgin’s name was Mary."
    },
    {
      "verse": 28,
      "text": "And he came to her and said, “Greetings, favored one! The Lord is with you.”"
    },
    {
      "verse": 29,
      "text": "But she was much perplexed by his words and pondered what sort of greeting this might be."
    },
    {
      "verse": 30,
      "text": "The angel said to her, “Do not be afraid, Mary, for you have found favor with God."
    },
    {
      "verse": 31,
      "text": "And now, you will conceive in your womb and bear a son, and you will name him Jesus."
    },
    {
      "verse": 32,
      "text": "He will be great and will be called the Son of the Most High, and the Lord God will give to him the throne of his ancestor David."
    },
    {
      "verse": 33,
      "text": "He will reign over the house of Jacob forever, and of his kingdom there will be no end.”"
    },
    {
      "verse": 34,
      "text": "Mary said to the angel, “How can this be, since I am a virgin?”"
    },
    {
      "verse": 35,
      "text": "The angel said to her, “The Holy Spirit will come upon you, and the power of the Most High will overshadow you; therefore the child to be born will be holy; he will be called Son of God."
    },
    {
      "verse": 36,
      "text": "And now, your relative Elizabeth in her old age has also conceived a son, and this is the sixth month for her who was said to be barren."
    },
    {
      "verse": 37,
      "text": "For nothing will be impossible with God.”"
    },
    {
      "verse": 38,
      "text": "Then Mary said, “Here am I, the servant of the Lord; let it be with me according to your word.” Then the angel departed from her."
    },
    {
      "verse": 39,
      "text": "In those days Mary set out and went with haste to a Judean town in the hill country,"
    },
    {
      "verse": 40,
      "text": "where she entered the house of Zechariah and greeted Elizabeth."
    },
    {
      "verse": 41,
      "text": "When Elizabeth heard Mary’s greeting, the child leaped in her womb. And Elizabeth was filled with the Holy Spirit"
    },
    {
      "verse": 42,
      "text": "and exclaimed with a loud cry, “Blessed are you among women, and blessed is the fruit of your womb."
    },
    {
      "verse": 43,
      "text": "And why has this happened to me, that the mother of my Lord comes to me?"
    },
    {
      "verse": 44,
      "text": "For as soon as I heard the sound of your greeting, the child in my womb leaped for joy."
    },
    {
      "verse": 45,
      "text": "And blessed is she who believed that there would be a fulfillment of what was spoken to her by the Lord.”"
    },
    {
      "verse": 46,
      "text": "And Mary said, “My soul magnifies the Lord,"
    },
    {
      "verse": 47,
      "text": "and my spirit rejoices in God my Savior,"
    },
    {
      "verse": 48,
      "text": "for he has looked with favor on the lowly state of his servant. Surely from now on all generations will call me blessed,"
    },
    {
      "verse": 49,
      "text": "for the Mighty One has done great things for me, and holy is his name;"
    },
    {
      "verse": 50,
      "text": "indeed, his mercy is for those who fear him from generation to generation."
    },
    {
      "verse": 51,
      "text": "He has shown strength with his arm; he has scattered the proud in the imagination of their hearts."
    },
    {
      "verse": 52,
      "text": "He has brought down the powerful from their thrones and lifted up the lowly;"
    },
    {
      "verse": 53,
      "text": "he has filled the hungry with good things and sent the rich away empty."
    },
    {
      "verse": 54,
      "text": "He has come to the aid of his child Israel, in remembrance of his mercy,"
    },
    {
      "verse": 55,
      "text": "according to the promise he made to our ancestors, to Abraham and to his descendants forever.”"
    },
    {
      "verse": 56,
      "text": "And Mary remained with her about three months and then returned to her home."
    },
    {
      "verse": 57,
      "text": "Now the time came for Elizabeth to give birth, and she bore a son."
    },
    {
      "verse": 58,
      "text": "Her neighbors and relatives heard that the Lord had shown his great mercy to her, and they rejoiced with her."
    },
    {
      "verse": 59,
      "text": "On the eighth day they came to circumcise the child, and they were going to name him Zechariah after his father."
    },
    {
      "verse": 60,
      "text": "But his mother said, “No; he is to be called John.”"
    },
    {
      "verse": 61,
      "text": "They said to her, “None of your relatives has this name.”"
    },
    {
      "verse": 62,
      "text": "Then they began motioning to his father to find out what name he wanted to give him."
    },
    {
      "verse": 63,
      "text": "He asked for a writing tablet and wrote, “His name is John.” And all of them were amazed."
    },
    {
      "verse": 64,
      "text": "Immediately his mouth was opened and his tongue freed, and he began to speak, praising God."
    },
    {
      "verse": 65,
      "text": "Fear came over all their neighbors, and all these things were talked about throughout the entire hill country of Judea."
    },
    {
      "verse": 66,
      "text": "All who heard them pondered them and said, “What then will this child become?” For indeed the hand of the Lord was with him."
    },
    {
      "verse": 67,
      "text": "Then his father Zechariah was filled with the Holy Spirit and prophesied:"
    },
    {
      "verse": 68,
      "text": "“Blessed be the Lord God of Israel, for he has looked favorably on his people and redeemed them."
    },
    {
      "verse": 69,
      "text": "He has raised up a mighty savior for us in the house of his child David,"
    },
    {
      "verse": 70,
      "text": "as he spoke through the mouth of his holy prophets from of old,"
    },
    {
      "verse": 71,
      "text": "that we would be saved from our enemies and from the hand of all who hate us."
    },
    {
      "verse": 72,
      "text": "Thus he has shown the mercy promised to our ancestors and has remembered his holy covenant,"
    },
    {
      "verse": 73,
      "text": "the oath that he swore to our ancestor Abraham, to grant us"
    },
    {
      "verse": 74,
      "text": "that we, being rescued from the hands of our enemies, might serve him without fear,"
    },
    {
      "verse": 75,
      "text": "in holiness and righteousness in his presence all our days."
    },
    {
      "verse": 76,
      "text": "And you, child, will be called the prophet of the Most High, for you will go before the Lord to prepare his ways,"
    },
    {
      "verse": 77,
      "text": "to give his people knowledge of salvation by the forgiveness of their sins."
    },
    {
      "verse": 78,
      "text": "Because of the tender mercy of our God, the dawn from on high will break upon us,"
    },
    {
      "verse": 79,
      "text": "to shine upon those who sit in darkness and in the shadow of death, to guide our feet into the way of peace.”"
    },
    {
      "verse": 80,
      "text": "The child grew and became strong in spirit, and he was in the wilderness until the day he appeared publicly to Israel."
    }
  ],
  "timestamp": "2025-08-08T15:51:34.743816"
}