{
  "book": "LUK",
  "book_name": "Luke",
  "chapter": 20,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LUK.20",
  "verses": [
    {
      "verse": 1,
      "text": "One day as he was teaching the people in the temple and proclaiming the good news, the chief priests and the scribes came with the elders"
    },
    {
      "verse": 2,
      "text": "and said to him, “Tell us, by what authority are you doing these things? Who is it who gave you this authority?”"
    },
    {
      "verse": 3,
      "text": "He answered them, “I will also ask you a question, and you tell me:"
    },
    {
      "verse": 4,
      "text": "Did the baptism of John come from heaven, or was it of human origin?”"
    },
    {
      "verse": 5,
      "text": "They discussed it with one another, saying, “If we say, ‘From heaven,’ he will say, ‘Why did you not believe him?’"
    },
    {
      "verse": 6,
      "text": "But if we say, ‘Of human origin,’ all the people will stone us, for they are convinced that John was a prophet.”"
    },
    {
      "verse": 7,
      "text": "So they answered that they did not know where it came from."
    },
    {
      "verse": 8,
      "text": "Then Jesus said to them, “Neither will I tell you by what authority I am doing these things.”"
    },
    {
      "verse": 9,
      "text": "He began to tell the people this parable: “A man planted a vineyard and leased it to tenants and went away for a long time."
    },
    {
      "verse": 11,
      "text": "Next he sent another slave; that one also they beat and insulted and sent away empty-handed."
    },
    {
      "verse": 12,
      "text": "And he sent still a third; this one also they wounded and threw out."
    },
    {
      "verse": 13,
      "text": "Then the owner of the vineyard said, ‘What shall I do? I will send my beloved son; perhaps they will respect him.’"
    },
    {
      "verse": 14,
      "text": "But when the tenants saw him, they discussed it among themselves and said, ‘This is the heir; let us kill him so that the inheritance may be ours.’"
    },
    {
      "verse": 15,
      "text": "So they threw him out of the vineyard and killed him. What then will the owner of the vineyard do to them?"
    },
    {
      "verse": 16,
      "text": "He will come and destroy those tenants and give the vineyard to others.” When they heard this, they said, “Heaven forbid!”"
    },
    {
      "verse": 17,
      "text": "But he looked at them and said, “What then does this text mean: ‘The stone that the builders rejected has become the cornerstone’?"
    },
    {
      "verse": 18,
      "text": "“Everyone who falls on that stone will be broken to pieces, and it will crush anyone on whom it falls.”"
    },
    {
      "verse": 19,
      "text": "When the scribes and chief priests realized that he had told this parable against them, they wanted to lay hands on him at that very hour, but they feared the people."
    },
    {
      "verse": 20,
      "text": "So they watched him and sent spies who pretended to be honest, in order to trap him by what he said and then to hand him over to the jurisdiction and authority of the governor."
    },
    {
      "verse": 21,
      "text": "So they asked him, “Teacher, we know that you are right in what you say and teach, and you show deference to no one but teach the way of God in accordance with truth."
    },
    {
      "verse": 22,
      "text": "Is it lawful for us to pay tribute to Caesar or not?”"
    },
    {
      "verse": 23,
      "text": "But he perceived their craftiness and said to them,"
    },
    {
      "verse": 24,
      "text": "“Show me a denarius. Whose head and whose title does it bear?” They said, “Caesar’s.”"
    },
    {
      "verse": 25,
      "text": "He said to them, “Then give to Caesar the things that are Caesar’s and to God the things that are God’s.”"
    },
    {
      "verse": 26,
      "text": "And they were not able in the presence of the people to trap him by what he said, and being amazed by his answer they became silent."
    },
    {
      "verse": 27,
      "text": "Some Sadducees, those who say there is no resurrection, came to him"
    },
    {
      "verse": 28,
      "text": "and asked him a question: “Teacher, Moses wrote for us that if a man’s brother dies leaving a wife but no children, the man shall marry the widow and raise up children for his brother."
    },
    {
      "verse": 29,
      "text": "Now there were seven brothers; the first married a woman and died childless;"
    },
    {
      "verse": 30,
      "text": "then the second"
    },
    {
      "verse": 31,
      "text": "and the third married her, and so in the same way all seven died childless."
    },
    {
      "verse": 32,
      "text": "Finally the woman also died."
    },
    {
      "verse": 33,
      "text": "In the resurrection, therefore, whose wife will the woman be? For the seven had married her.”"
    },
    {
      "verse": 34,
      "text": "Jesus said to them, “Those who belong to this age marry and are given in marriage,"
    },
    {
      "verse": 35,
      "text": "but those who are considered worthy of a place in that age and in the resurrection from the dead neither marry nor are given in marriage."
    },
    {
      "verse": 36,
      "text": "Indeed, they cannot die anymore, because they are like angels and are children of God, being children of the resurrection."
    },
    {
      "verse": 37,
      "text": "And the fact that the dead are raised Moses himself showed, in the story about the bush, where he speaks of the Lord as the God of Abraham, the God of Isaac, and the God of Jacob."
    },
    {
      "verse": 38,
      "text": "Now he is God not of the dead but of the living, for to him all of them are alive.”"
    },
    {
      "verse": 39,
      "text": "Then some of the scribes answered, “Teacher, you have spoken well.”"
    },
    {
      "verse": 40,
      "text": "For they no longer dared to ask him another question."
    },
    {
      "verse": 41,
      "text": "Then he said to them, “How can they say that the Messiah is David’s son?"
    },
    {
      "verse": 42,
      "text": "For David himself says in the book of Psalms, ‘The Lord said to my Lord, “Sit at my right hand"
    },
    {
      "verse": 43,
      "text": "until I make your enemies a footstool for your feet.” ’"
    },
    {
      "verse": 44,
      "text": "“David thus calls him Lord, so how can he be his son?”"
    },
    {
      "verse": 45,
      "text": "In the hearing of all the people he said to the disciples,"
    },
    {
      "verse": 46,
      "text": "“Beware of the scribes who like to walk around in long robes and who love respectful greetings in the marketplaces and the best seats in the synagogues and places of honor at banquets."
    },
    {
      "verse": 47,
      "text": "They devour widows’ houses and for the sake of appearance say long prayers. They will receive the greater condemnation.”"
    }
  ],
  "timestamp": "2025-08-08T15:51:37.616309"
}