{
  "book": "LUK",
  "book_name": "Luke",
  "chapter": 5,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/LUK.5",
  "verses": [
    {
      "verse": 1,
      "text": "Once while Jesus was standing beside the Lake of Gennesaret and the crowd was pressing in on him to hear the word of God,"
    },
    {
      "verse": 2,
      "text": "he saw two boats there at the shore of the lake; the fishermen had gotten out of them and were washing their nets."
    },
    {
      "verse": 3,
      "text": "He got into one of the boats, the one belonging to Simon, and asked him to put out a little way from the shore. Then he sat down and taught the crowds from the boat."
    },
    {
      "verse": 4,
      "text": "When he had finished speaking, he said to Simon, “Put out into the deep water and let down your nets for a catch.”"
    },
    {
      "verse": 5,
      "text": "Simon answered, “Master, we have worked all night long but have caught nothing. Yet if you say so, I will let down the nets.”"
    },
    {
      "verse": 6,
      "text": "When they had done this, they caught so many fish that their nets were beginning to burst."
    },
    {
      "verse": 7,
      "text": "So they signaled their partners in the other boat to come and help them. And they came and filled both boats, so that they began to sink."
    },
    {
      "verse": 8,
      "text": "But when Simon Peter saw it, he fell down at Jesus’s knees, saying, “Go away from me, Lord, for I am a sinful man!”"
    },
    {
      "verse": 9,
      "text": "For he and all who were with him were astounded at the catch of fish that they had taken,"
    },
    {
      "verse": 10,
      "text": "and so also were James and John, sons of Zebedee, who were partners with Simon. Then Jesus said to Simon, “Do not be afraid; from now on you will be catching people.”"
    },
    {
      "verse": 11,
      "text": "When they had brought their boats to shore, they left everything and followed him."
    },
    {
      "verse": 12,
      "text": "Once when he was in one of the cities, a man covered with a skin disease was there. When he saw Jesus, he bowed with his face to the ground and begged him, “Lord, if you are willing, you can make me clean.”"
    },
    {
      "verse": 13,
      "text": "Then Jesus stretched out his hand, touched him, and said, “I am willing. Be made clean.” Immediately the skin disease left him."
    },
    {
      "verse": 14,
      "text": "And he ordered him to tell no one. “But go, show yourself to the priest, and, as Moses commanded, make an offering for your cleansing, as a testimony to them.”"
    },
    {
      "verse": 15,
      "text": "But now more than ever the word about Jesus spread abroad; many crowds were gathering to hear him and to be cured of their diseases."
    },
    {
      "verse": 16,
      "text": "Meanwhile, he would slip away to deserted places and pray."
    },
    {
      "verse": 17,
      "text": "One day while he was teaching, Pharisees and teachers of the law who had come from every village of Galilee and Judea and from Jerusalem were sitting nearby, and the power of the Lord was with him to heal."
    },
    {
      "verse": 18,
      "text": "Just then some men came carrying a paralyzed man on a stretcher. They were trying to bring him in and lay him before Jesus,"
    },
    {
      "verse": 19,
      "text": "but, finding no way to bring him in because of the crowd, they went up on the roof and let him down on the stretcher through the tiles into the middle of the crowd in front of Jesus."
    },
    {
      "verse": 20,
      "text": "When he saw their faith, he said, “Friend, your sins are forgiven you.”"
    },
    {
      "verse": 21,
      "text": "Then the scribes and the Pharisees began to question, “Who is this who is speaking blasphemies? Who can forgive sins but God alone?”"
    },
    {
      "verse": 22,
      "text": "When Jesus perceived their questionings, he answered them, “Why do you raise such questions in your hearts?"
    },
    {
      "verse": 23,
      "text": "Which is easier: to say, ‘Your sins are forgiven you,’ or to say, ‘Stand up and walk’?"
    },
    {
      "verse": 24,
      "text": "But so that you may know that the Son of Man has authority on earth to forgive sins”—he said to the one who was paralyzed—“I say to you, stand up and take your stretcher and go to your home.”"
    },
    {
      "verse": 25,
      "text": "Immediately he stood up before them, took what he had been lying on, and went to his home, glorifying God."
    },
    {
      "verse": 26,
      "text": "Amazement seized all of them, and they glorified God and were filled with fear, saying, “We have seen incredible things today.”"
    },
    {
      "verse": 27,
      "text": "After this he went out and saw a tax collector named Levi sitting at the tax-collection station, and he said to him, “Follow me.”"
    },
    {
      "verse": 28,
      "text": "And he got up, left everything, and followed him."
    },
    {
      "verse": 29,
      "text": "Then Levi gave a great banquet for him in his house, and there was a large crowd of tax collectors and others reclining at the table with them."
    },
    {
      "verse": 30,
      "text": "The Pharisees and their scribes were complaining to his disciples, saying, “Why do you eat and drink with tax collectors and sinners?”"
    },
    {
      "verse": 31,
      "text": "Jesus answered them, “Those who are well have no need of a physician but those who are sick;"
    },
    {
      "verse": 32,
      "text": "I have not come to call the righteous but sinners to repentance.”"
    },
    {
      "verse": 33,
      "text": "Then they said to him, “John’s disciples, like the disciples of the Pharisees, frequently fast and pray, but your disciples eat and drink.”"
    },
    {
      "verse": 34,
      "text": "Jesus said to them, “You cannot make wedding attendants fast while the bridegroom is with them, can you?"
    },
    {
      "verse": 35,
      "text": "The days will come when the bridegroom will be taken away from them, and then they will fast in those days.”"
    },
    {
      "verse": 36,
      "text": "He also told them a parable: “No one tears a piece from a new garment and sews it on an old garment; otherwise, not only will one tear the new garment, but the piece from the new will not match the old garment."
    },
    {
      "verse": 37,
      "text": "Similarly, no one puts new wine into old wineskins; otherwise, the new wine will burst the skins and will spill out, and the skins will be ruined."
    },
    {
      "verse": 38,
      "text": "But new wine must be put into fresh wineskins."
    },
    {
      "verse": 39,
      "text": "And no one after drinking old wine desires new wine but says, ‘The old is good.’ ”"
    }
  ],
  "timestamp": "2025-08-08T15:51:35.359943"
}