{
  "book": "MAT",
  "book_name": "Matthew",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/MAT.3",
  "verses": [
    {
      "verse": 1,
      "text": "In those days John the Baptist appeared in the wilderness of Judea, proclaiming,"
    },
    {
      "verse": 2,
      "text": "“Repent, for the kingdom of heaven has come near.”"
    },
    {
      "verse": 3,
      "text": "This is the one of whom the prophet Isaiah spoke when he said, “The voice of one crying out in the wilderness: ‘Prepare the way of the Lord; make his paths straight.’ ”"
    },
    {
      "verse": 4,
      "text": "Now John wore clothing of camel’s hair with a leather belt around his waist, and his food was locusts and wild honey."
    },
    {
      "verse": 5,
      "text": "Then Jerusalem and all Judea and all the region around the Jordan were going out to him,"
    },
    {
      "verse": 6,
      "text": "and they were baptized by him in the River Jordan, confessing their sins."
    },
    {
      "verse": 7,
      "text": "But when he saw many of the Pharisees and Sadducees coming for his baptism, he said to them, “You brood of vipers! Who warned you to flee from the coming wrath?"
    },
    {
      "verse": 8,
      "text": "Therefore, bear fruit worthy of repentance,"
    },
    {
      "verse": 9,
      "text": "and do not presume to say to yourselves, ‘We have Abraham as our ancestor,’ for I tell you, God is able from these stones to raise up children to Abraham."
    },
    {
      "verse": 10,
      "text": "Even now the ax is lying at the root of the trees; therefore every tree that does not bear good fruit will be cut down and thrown into the fire."
    },
    {
      "verse": 11,
      "text": "“I baptize you with water for repentance, but the one who is coming after me is more powerful than I, and I am not worthy to carry his sandals. He will baptize you with the Holy Spirit and fire."
    },
    {
      "verse": 12,
      "text": "His winnowing fork is in his hand, and he will clear his threshing floor and will gather his wheat into the granary, but the chaff he will burn with unquenchable fire.”"
    },
    {
      "verse": 13,
      "text": "Then Jesus came from Galilee to John at the Jordan, to be baptized by him."
    },
    {
      "verse": 14,
      "text": "John would have prevented him, saying, “I need to be baptized by you, and do you come to me?”"
    },
    {
      "verse": 15,
      "text": "But Jesus answered him, “Let it be so now, for it is proper for us in this way to fulfill all righteousness.” Then he consented."
    },
    {
      "verse": 16,
      "text": "And when Jesus had been baptized, just as he came up from the water, suddenly the heavens were opened to him and he saw God’s Spirit descending like a dove and alighting on him."
    },
    {
      "verse": 17,
      "text": "And a voice from the heavens said, “This is my Son, the Beloved, with whom I am well pleased.”"
    }
  ],
  "timestamp": "2025-08-08T15:51:25.409009"
}