{
  "book": "MIC",
  "book_name": "Micah",
  "chapter": 4,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/MIC.4",
  "verses": [
    {
      "verse": 1,
      "text": "In days to come the mountain of the Lord ’s temple shall be established as the highest of the mountains and shall be raised up above the hills. Peoples shall stream to it,"
    },
    {
      "verse": 2,
      "text": "and many nations shall come and say: “Come, let us go up to the mountain of the Lord, to the house of the God of Jacob, that he may teach us his ways and that we may walk in his paths.” For out of Zion shall go forth instruction, and the word of the Lord from Jerusalem."
    },
    {
      "verse": 3,
      "text": "He shall judge between many peoples and shall arbitrate between strong nations far away; and their spears into pruning hooks; nation shall not lift up sword against nation; neither shall they learn war any more;"
    },
    {
      "verse": 4,
      "text": "but they shall all sit under their own vines and under their own fig trees, and no one shall make them afraid, for the mouth of the Lord of hosts has spoken."
    },
    {
      "verse": 5,
      "text": "For all the peoples walk, each in the name of its god, but we will walk in the name of the Lord our God forever and ever."
    },
    {
      "verse": 6,
      "text": "On that day, says the Lord, I will assemble the lame and gather those who have been driven away and those whom I have afflicted."
    },
    {
      "verse": 7,
      "text": "The lame I will make the remnant, and those who were cast off, a strong nation, and the Lord will reign over them in Mount Zion now and forevermore."
    },
    {
      "verse": 8,
      "text": "And you, O tower of the flock, hill of daughter Zion, to you it shall come, the former dominion shall come, the sovereignty of daughter Jerusalem."
    },
    {
      "verse": 9,
      "text": "Now why do you cry aloud? Is there no king in you? Has your counselor perished, that pangs have seized you like a woman in labor?"
    },
    {
      "verse": 10,
      "text": "Writhe and groan, O daughter Zion, like a woman in labor, for now you shall go forth from the city and camp in the open country; you shall go to Babylon. There you shall be rescued; there the Lord will redeem you from the hands of your enemies."
    },
    {
      "verse": 11,
      "text": "Now many nations are assembled against you, saying, “Let her be profaned, and let our eyes gaze upon Zion.”"
    },
    {
      "verse": 12,
      "text": "But they do not know the thoughts of the Lord; they do not understand his plan, that he has gathered them as sheaves to the threshing floor."
    },
    {
      "verse": 13,
      "text": "Arise and thresh, O daughter Zion, for I will make your horn iron and your hoofs bronze; you shall beat in pieces many peoples and shall devote their gain to the Lord, their wealth to the Lord of the whole earth."
    }
  ],
  "timestamp": "2025-08-08T15:51:10.253455"
}