{
  "book": "MIC",
  "book_name": "Micah",
  "chapter": 2,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/MIC.2",
  "verses": [
    {
      "verse": 1,
      "text": "Woe to those who devise wickedness and evil deeds on their beds! When the morning dawns, they perform it, because it is in their power."
    },
    {
      "verse": 2,
      "text": "They covet fields and seize them, houses and take them away; they oppress householder and house, people and their inheritance."
    },
    {
      "verse": 3,
      "text": "Therefore thus says the Lord: Now, I am devising against this family an evil from which you cannot remove your necks, and you shall not walk arrogantly, for it will be an evil time."
    },
    {
      "verse": 4,
      "text": "On that day they shall take up a taunt song against you and wail with bitter lamentation and say, “We are utterly ruined; the Lord alters the inheritance of my people; how he removes it from me! Among our captors he parcels out our fields.”"
    },
    {
      "verse": 5,
      "text": "Therefore you will have no one in the Lord ’s assembly to allot you a piece of land."
    },
    {
      "verse": 6,
      "text": "“Do not preach”—thus they preach— “one should not preach of such things; disgrace will not overtake us.”"
    },
    {
      "verse": 7,
      "text": "Should this be said, O house of Jacob? Is the Lord ’s patience exhausted? Are these his doings? Do not my words do good to one who walks uprightly?"
    },
    {
      "verse": 8,
      "text": "But you rise up against my people as an enemy; you strip the robe from the peaceful, from those who pass by trustingly with no thought of war."
    },
    {
      "verse": 9,
      "text": "The women of my people you drive out from their pleasant houses; from their young children you take away my glory forever."
    },
    {
      "verse": 10,
      "text": "Arise and go, for this is no place to rest, because of uncleanness that destroys with a violent destruction."
    },
    {
      "verse": 11,
      "text": "If someone were to go about uttering empty falsehoods, saying, “I will preach to you of wine and strong drink,” such a one would be the preacher for this people!"
    },
    {
      "verse": 12,
      "text": "I will surely gather all of you, O Jacob; I will gather the survivors of Israel; I will set them together like sheep in a fold, like a flock in its pasture; it will resound with people."
    },
    {
      "verse": 13,
      "text": "The one who breaks out will go up before them; they will break through and pass the gate, going out by it. Their king will pass on before them, the Lord at their head."
    }
  ],
  "timestamp": "2025-08-08T15:51:09.926432"
}