{
  "book": "MRK",
  "book_name": "Mark",
  "chapter": 14,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/MRK.14",
  "verses": [
    {
      "verse": 1,
      "text": "It was two days before the Passover and the Festival of Unleavened Bread. The chief priests and the scribes were looking for a way to arrest Jesus by stealth and kill him,"
    },
    {
      "verse": 2,
      "text": "for they said, “Not during the festival, or there may be a riot among the people.”"
    },
    {
      "verse": 3,
      "text": "While he was at Bethany in the house of Simon the leper, as he sat at the table, a woman came with an alabaster jar of very costly ointment of nard, and she broke open the jar and poured the ointment on his head."
    },
    {
      "verse": 4,
      "text": "But some were there who said to one another in anger, “Why was the ointment wasted in this way?"
    },
    {
      "verse": 5,
      "text": "For this ointment could have been sold for more than three hundred denarii and the money given to the poor.” And they scolded her."
    },
    {
      "verse": 6,
      "text": "But Jesus said, “Let her alone; why do you trouble her? She has performed a good service for me."
    },
    {
      "verse": 7,
      "text": "For you always have the poor with you, and you can show kindness to them whenever you wish, but you will not always have me."
    },
    {
      "verse": 8,
      "text": "She has done what she could; she has anointed my body beforehand for its burial."
    },
    {
      "verse": 9,
      "text": "Truly I tell you, wherever the good news is proclaimed in the whole world, what she has done will be told in remembrance of her.”"
    },
    {
      "verse": 10,
      "text": "Then Judas Iscariot, who was one of the twelve, went to the chief priests in order to betray him to them."
    },
    {
      "verse": 11,
      "text": "When they heard it, they were greatly pleased and promised to give him money. So he began to look for an opportunity to betray him."
    },
    {
      "verse": 12,
      "text": "On the first day of Unleavened Bread, when the Passover lamb is sacrificed, his disciples said to him, “Where do you want us to go and make the preparations for you to eat the Passover?”"
    },
    {
      "verse": 13,
      "text": "So he sent two of his disciples, saying to them, “Go into the city, and a man carrying a jar of water will meet you; follow him,"
    },
    {
      "verse": 14,
      "text": "and wherever he enters, say to the owner of the house, ‘The Teacher asks: Where is my guest room where I may eat the Passover with my disciples?’"
    },
    {
      "verse": 15,
      "text": "He will show you a large room upstairs, furnished and ready. Make preparations for us there.”"
    },
    {
      "verse": 16,
      "text": "So the disciples set out and went to the city and found everything as he had told them, and they prepared the Passover meal."
    },
    {
      "verse": 17,
      "text": "When it was evening, he came with the twelve."
    },
    {
      "verse": 18,
      "text": "And when they had taken their places and were eating, Jesus said, “Truly I tell you, one of you will betray me, one who is eating with me.”"
    },
    {
      "verse": 19,
      "text": "They began to be distressed and to say to him one after another, “Surely, not I?”"
    },
    {
      "verse": 20,
      "text": "He said to them, “It is one of the twelve, one who is dipping bread into the bowl with me."
    },
    {
      "verse": 21,
      "text": "For the Son of Man goes as it is written of him, but woe to that one by whom the Son of Man is betrayed! It would have been better for that one not to have been born.”"
    },
    {
      "verse": 22,
      "text": "While they were eating, he took a loaf of bread, and after blessing it he broke it, gave it to them, and said, “Take; this is my body.”"
    },
    {
      "verse": 23,
      "text": "Then he took a cup, and after giving thanks he gave it to them, and all of them drank from it."
    },
    {
      "verse": 24,
      "text": "He said to them, “This is my blood of the covenant, which is poured out for many."
    },
    {
      "verse": 25,
      "text": "Truly I tell you, I will never again drink of the fruit of the vine until that day when I drink it new in the kingdom of God.”"
    },
    {
      "verse": 26,
      "text": "When they had sung the hymn, they went out to the Mount of Olives."
    },
    {
      "verse": 27,
      "text": "And Jesus said to them, “You will all fall away, for it is written, ‘I will strike the shepherd, and the sheep will be scattered.’"
    },
    {
      "verse": 28,
      "text": "“But after I am raised up, I will go before you to Galilee.”"
    },
    {
      "verse": 29,
      "text": "Peter said to him, “Even though all fall away, I will not.”"
    },
    {
      "verse": 30,
      "text": "Jesus said to him, “Truly I tell you, this day, this very night, before the cock crows twice, you will deny me three times.”"
    },
    {
      "verse": 31,
      "text": "But he said vehemently, “Even though I must die with you, I will not deny you.” And all of them said the same."
    },
    {
      "verse": 32,
      "text": "They went to a place called Gethsemane, and he said to his disciples, “Sit here while I pray.”"
    },
    {
      "verse": 33,
      "text": "He took with him Peter and James and John and began to be distressed and agitated."
    },
    {
      "verse": 34,
      "text": "And he said to them, “My soul is deeply grieved, even to death; remain here, and keep awake.”"
    },
    {
      "verse": 35,
      "text": "And going a little farther, he threw himself on the ground and prayed that, if it were possible, the hour might pass from him."
    },
    {
      "verse": 36,
      "text": "He said, “Abba, Father, for you all things are possible; remove this cup from me, yet not what I want but what you want.”"
    },
    {
      "verse": 37,
      "text": "He came and found them sleeping, and he said to Peter, “Simon, are you asleep? Could you not keep awake one hour?"
    },
    {
      "verse": 38,
      "text": "Keep awake and pray that you may not come into the time of trial; the spirit indeed is willing, but the flesh is weak.”"
    },
    {
      "verse": 39,
      "text": "And again he went away and prayed, saying the same words."
    },
    {
      "verse": 40,
      "text": "And once more he came and found them sleeping, for their eyes were very heavy, and they did not know what to say to him."
    },
    {
      "verse": 41,
      "text": "He came a third time and said to them, “Are you still sleeping and taking your rest? Enough! The hour has come; the Son of Man is betrayed into the hands of sinners."
    },
    {
      "verse": 42,
      "text": "Get up, let us be going. Look, my betrayer is at hand.”"
    },
    {
      "verse": 43,
      "text": "Immediately, while he was still speaking, Judas, one of the twelve, arrived, and with him there was a crowd with swords and clubs, from the chief priests, the scribes, and the elders."
    },
    {
      "verse": 44,
      "text": "Now the betrayer had given them a sign, saying, “The one I will kiss is the man; arrest him and lead him away under guard.”"
    },
    {
      "verse": 45,
      "text": "So when he came, he went up to him at once and said, “Rabbi!” and kissed him."
    },
    {
      "verse": 46,
      "text": "Then they laid hands on him and arrested him."
    },
    {
      "verse": 47,
      "text": "But one of those who stood near drew his sword and struck the slave of the high priest, cutting off his ear."
    },
    {
      "verse": 48,
      "text": "Then Jesus said to them, “Have you come out with swords and clubs to arrest me as though I were a rebel?"
    },
    {
      "verse": 49,
      "text": "Day after day I was with you in the temple teaching, and you did not arrest me. But let the scriptures be fulfilled.”"
    },
    {
      "verse": 50,
      "text": "All of them deserted him and fled."
    },
    {
      "verse": 51,
      "text": "A certain young man was following him, wearing nothing but a linen cloth. They caught hold of him,"
    },
    {
      "verse": 52,
      "text": "but he left the linen cloth and ran off naked."
    },
    {
      "verse": 53,
      "text": "They took Jesus to the high priest, and all the chief priests, the elders, and the scribes were assembled."
    },
    {
      "verse": 54,
      "text": "Peter had followed him at a distance, right into the courtyard of the high priest, and he was sitting with the guards, warming himself at the fire."
    },
    {
      "verse": 55,
      "text": "Now the chief priests and the whole council were looking for testimony against Jesus to put him to death, but they found none."
    },
    {
      "verse": 56,
      "text": "For many gave false testimony against him, and their testimony did not agree."
    },
    {
      "verse": 57,
      "text": "Some stood up and gave false testimony against him, saying,"
    },
    {
      "verse": 58,
      "text": "“We heard him say, ‘I will destroy this temple that is made with hands, and in three days I will build another, not made with hands.’ ”"
    },
    {
      "verse": 59,
      "text": "But even on this point their testimony did not agree."
    },
    {
      "verse": 60,
      "text": "Then the high priest stood up before them and asked Jesus, “Have you no answer? What is it that they testify against you?”"
    },
    {
      "verse": 61,
      "text": "But he was silent and did not answer. Again the high priest asked him, “Are you the Messiah, the Son of the Blessed One?”"
    },
    {
      "verse": 62,
      "text": "Jesus said, “I am, and ‘you will see the Son of Man seated at the right hand of the Power’ and ‘coming with the clouds of heaven.’ ”"
    },
    {
      "verse": 63,
      "text": "Then the high priest tore his clothes and said, “Why do we still need witnesses?"
    },
    {
      "verse": 64,
      "text": "You have heard his blasphemy! What is your decision?” All of them condemned him as deserving death."
    },
    {
      "verse": 65,
      "text": "Some began to spit on him, to blindfold him, and to strike him, saying to him, “Prophesy!” The guards also took him and beat him."
    },
    {
      "verse": 66,
      "text": "While Peter was below in the courtyard, one of the female servants of the high priest came by."
    },
    {
      "verse": 67,
      "text": "When she saw Peter warming himself, she stared at him and said, “You also were with Jesus, the man from Nazareth.”"
    },
    {
      "verse": 68,
      "text": "But he denied it, saying, “I do not know or understand what you are talking about.” And he went out into the forecourt. Then the cock crowed."
    },
    {
      "verse": 69,
      "text": "And the female servant, on seeing him, began again to say to the bystanders, “This man is one of them.”"
    },
    {
      "verse": 70,
      "text": "But again he denied it. Then after a little while the bystanders again said to Peter, “Certainly you are one of them, for you are a Galilean, and you talk like one.”"
    },
    {
      "verse": 71,
      "text": "But he began to curse, and he swore an oath, “I do not know this man you are talking about.”"
    },
    {
      "verse": 72,
      "text": "At that moment the cock crowed for the second time. Then Peter remembered that Jesus had said to him, “Before the cock crows twice, you will deny me three times.” And he broke down and wept."
    }
  ],
  "timestamp": "2025-08-08T15:51:32.888102"
}