{
  "book": "NUM",
  "book_name": "Numbers",
  "chapter": 24,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/NUM.24",
  "verses": [
    {
      "verse": 1,
      "text": "Now Balaam saw that it pleased the Lord to bless Israel, so he did not go, as at other times, to look for omens but set his face toward the wilderness."
    },
    {
      "verse": 2,
      "text": "Balaam looked up and saw Israel camping tribe by tribe. Then the spirit of God came upon him,"
    },
    {
      "verse": 3,
      "text": "and he uttered his oracle, saying, “The oracle of Balaam son of Beor, the oracle of the man whose eye is clear,"
    },
    {
      "verse": 4,
      "text": "the oracle of one who hears the words of God, who sees the vision of the Almighty, who falls down but with eyes uncovered:"
    },
    {
      "verse": 5,
      "text": "How fair are your tents, O Jacob, your encampments, O Israel!"
    },
    {
      "verse": 6,
      "text": "Like palm groves that stretch far away, like gardens beside a river, like aloes that the Lord has planted, like cedar trees beside the waters."
    },
    {
      "verse": 7,
      "text": "Water shall flow from his buckets, and his seed shall have abundant water; his king shall be higher than Agag, and his kingdom shall be exalted."
    },
    {
      "verse": 8,
      "text": "God, who brings him out of Egypt, is like the horns of a wild ox for him; he shall devour the nations that are his foes and break their bones. He shall strike with his arrows."
    },
    {
      "verse": 9,
      "text": "He crouched; he lay down like a lion and like a lioness; who will rouse him up? Blessed is everyone who blesses you, and cursed is everyone who curses you.”"
    },
    {
      "verse": 10,
      "text": "Then Balak’s anger was kindled against Balaam, and he struck his hands together. Balak said to Balaam, “I summoned you to curse my enemies, but instead you have blessed them these three times."
    },
    {
      "verse": 11,
      "text": "Now be off with you! Go home! I said, ‘I will reward you richly,’ but the Lord has denied you any reward.”"
    },
    {
      "verse": 12,
      "text": "And Balaam said to Balak, “Did I not speak to your messengers whom you sent to me, saying,"
    },
    {
      "verse": 13,
      "text": "‘If Balak should give me his house full of silver and gold, I would not be able to go beyond the word of the Lord, to do either good or bad of my own will; what the Lord says, that is what I will say’?"
    },
    {
      "verse": 14,
      "text": "So now, I am going to my people; let me advise you what this people will do to your people in days to come.”"
    },
    {
      "verse": 15,
      "text": "So he uttered his oracle, saying, “The oracle of Balaam son of Beor, the oracle of the man whose eye is clear,"
    },
    {
      "verse": 16,
      "text": "the oracle of one who hears the words of God and knows the knowledge of the Most High, who sees the vision of the Almighty, who falls down but with eyes uncovered:"
    },
    {
      "verse": 17,
      "text": "I see him but not now; I behold him but not near— a star shall come out of Jacob, and a scepter shall rise out of Israel; it shall crush the foreheads of Moab and the heads of all the Shethites."
    },
    {
      "verse": 18,
      "text": "Edom will become a possession, Seir a possession of its enemies, while Israel does valiantly."
    },
    {
      "verse": 19,
      "text": "One out of Jacob shall rule and destroy the survivors of Ir.”"
    },
    {
      "verse": 20,
      "text": "Then he looked on Amalek and uttered his oracle, saying, “First among the nations was Amalek, but its end is to perish forever.”"
    },
    {
      "verse": 21,
      "text": "Then he looked on the Kenite and uttered his oracle, saying, “Enduring is your dwelling place, and your nest is set in the rock,"
    },
    {
      "verse": 22,
      "text": "yet Kain is destined for burning. How long shall Asshur take you away captive?”"
    },
    {
      "verse": 23,
      "text": "Again he uttered his oracle, saying, “Alas, who shall live when God does this?"
    },
    {
      "verse": 24,
      "text": "But ships shall come from Kittim and shall afflict Asshur and Eber, and he also shall perish forever.”"
    },
    {
      "verse": 25,
      "text": "Then Balaam got up and went back to his place, and Balak also went his way."
    }
  ],
  "timestamp": "2025-08-08T15:48:32.358119"
}