{
  "book": "NUM",
  "book_name": "Numbers",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/NUM.3",
  "verses": [
    {
      "verse": 1,
      "text": "This is the lineage of Aaron and Moses at the time when the Lord spoke with Moses on Mount Sinai."
    },
    {
      "verse": 2,
      "text": "These are the names of the sons of Aaron: Nadab the firstborn and Abihu, Eleazar, and Ithamar;"
    },
    {
      "verse": 3,
      "text": "these are the names of the sons of Aaron, the anointed priests, whom he ordained to serve as priests."
    },
    {
      "verse": 4,
      "text": "Nadab and Abihu died before the Lord when they offered unholy fire before the Lord in the wilderness of Sinai, and they had no children. Eleazar and Ithamar served as priests in the lifetime of their father Aaron."
    },
    {
      "verse": 5,
      "text": "Then the Lord spoke to Moses, saying,"
    },
    {
      "verse": 6,
      "text": "“Bring the tribe of Levi near and set them before Aaron the priest, so that they may assist him."
    },
    {
      "verse": 7,
      "text": "They shall perform duties for him and for the whole congregation in front of the tent of meeting, doing service at the tabernacle;"
    },
    {
      "verse": 8,
      "text": "they shall be in charge of all the furnishings of the tent of meeting and attend to the duties for the Israelites as they do service at the tabernacle."
    },
    {
      "verse": 9,
      "text": "You shall give the Levites to Aaron and his descendants; they are unreservedly given to him from among the Israelites."
    },
    {
      "verse": 10,
      "text": "But you shall enroll Aaron and his descendants; it is they who shall attend to the priesthood, and any outsider who comes near shall be put to death.”"
    },
    {
      "verse": 11,
      "text": "Then the Lord spoke to Moses, saying,"
    },
    {
      "verse": 12,
      "text": "“I hereby take the Levites from among the Israelites as substitutes for all the firstborn that open the womb among the Israelites. The Levites shall be mine,"
    },
    {
      "verse": 13,
      "text": "for all the firstborn are mine; when I killed all the firstborn in the land of Egypt, I consecrated for my own all the firstborn in Israel, both human and animal; they shall be mine. I am the Lord.”"
    },
    {
      "verse": 14,
      "text": "Then the Lord spoke to Moses in the wilderness of Sinai, saying,"
    },
    {
      "verse": 15,
      "text": "“Enroll the Levites by ancestral houses and by clans. You shall enroll every male from a month old and up.”"
    },
    {
      "verse": 16,
      "text": "So Moses enrolled them according to the word of the Lord, as he was commanded."
    },
    {
      "verse": 17,
      "text": "These were the sons of Levi, by their names: Gershon, Kohath, and Merari."
    },
    {
      "verse": 18,
      "text": "These were the names of the sons of Gershon by their clans: Libni and Shimei."
    },
    {
      "verse": 19,
      "text": "The sons of Kohath by their clans: Amram, Izhar, Hebron, and Uzziel."
    },
    {
      "verse": 20,
      "text": "The sons of Merari by their clans: Mahli and Mushi. These were the clans of the Levites, by their ancestral houses."
    },
    {
      "verse": 21,
      "text": "To Gershon belonged the clan of the Libnites and the clan of the Shimeites; these were the clans of the Gershonites."
    },
    {
      "verse": 22,
      "text": "Their enrollment, counting all the males from a month old and up, was seven thousand five hundred."
    },
    {
      "verse": 23,
      "text": "The clans of the Gershonites were to camp behind the tabernacle on the west,"
    },
    {
      "verse": 24,
      "text": "with Eliasaph son of Lael as head of the ancestral house of the Gershonites."
    },
    {
      "verse": 25,
      "text": "The responsibility of the sons of Gershon in the tent of meeting was the tabernacle, the tent with its covering, the screen for the entrance of the tent of meeting,"
    },
    {
      "verse": 26,
      "text": "the hangings of the court, the screen for the entrance of the court that is around the tabernacle and the altar, and its cords—all the service pertaining to these."
    },
    {
      "verse": 27,
      "text": "To Kohath belonged the clan of the Amramites, the clan of the Izharites, the clan of the Hebronites, and the clan of the Uzzielites; these were the clans of the Kohathites."
    },
    {
      "verse": 28,
      "text": "Counting all the males, from a month old and up, there were eight thousand six hundred performing the duties of the sanctuary."
    },
    {
      "verse": 29,
      "text": "The clans of the Kohathites were to camp on the south side of the tabernacle,"
    },
    {
      "verse": 30,
      "text": "with Elizaphan son of Uzziel as head of the ancestral house of the clans of the Kohathites."
    },
    {
      "verse": 31,
      "text": "Their responsibility was the ark, the table, the lampstand, the altars, the vessels of the sanctuary with which the priests minister, and the screen—all the service pertaining to these."
    },
    {
      "verse": 32,
      "text": "Eleazar son of Aaron the priest was to be chief over the leaders of the Levites and to have oversight of those who performed the duties of the sanctuary."
    },
    {
      "verse": 33,
      "text": "To Merari belonged the clan of the Mahlites and the clan of the Mushites; these were the clans of Merari."
    },
    {
      "verse": 34,
      "text": "Their enrollment, counting all the males from a month old and up, was six thousand two hundred."
    },
    {
      "verse": 35,
      "text": "The head of the ancestral house of the clans of Merari was Zuriel son of Abihail; they were to camp on the north side of the tabernacle."
    },
    {
      "verse": 36,
      "text": "The responsibility assigned to the sons of Merari was the frames of the tabernacle, the bars, the pillars, the bases, and all their accessories—all the service pertaining to these,"
    },
    {
      "verse": 37,
      "text": "also the pillars of the court all around, with their bases and pegs and cords."
    },
    {
      "verse": 38,
      "text": "Those who were to camp in front of the tabernacle on the east—in front of the tent of meeting toward the sunrise—were Moses and Aaron and Aaron’s sons, who were to perform the duties of the sanctuary, whatever had to be done for the Israelites, and any outsider who came near was to be put to death."
    },
    {
      "verse": 39,
      "text": "The total enrollment of the Levites whom Moses and Aaron enrolled at the commandment of the Lord, by their clans, all the males from a month old and up, was twenty-two thousand."
    },
    {
      "verse": 40,
      "text": "Then the Lord said to Moses, “Enroll all the firstborn males of the Israelites, from a month old and up, and count their names."
    },
    {
      "verse": 41,
      "text": "But you shall take the Levites for me—I am the Lord —as substitutes for all the firstborn among the Israelites and the livestock of the Levites as substitutes for all the firstborn among the livestock of the Israelites.”"
    },
    {
      "verse": 42,
      "text": "So Moses enrolled all the firstborn among the Israelites, as the Lord commanded him."
    },
    {
      "verse": 43,
      "text": "The total enrollment, all the firstborn males from a month old and up, counting the number of names, was twenty-two thousand two hundred seventy-three."
    },
    {
      "verse": 44,
      "text": "Then the Lord spoke to Moses, saying,"
    },
    {
      "verse": 45,
      "text": "“Take the Levites as substitutes for all the firstborn among the Israelites and the livestock of the Levites as substitutes for their livestock, and the Levites shall be mine. I am the Lord."
    },
    {
      "verse": 46,
      "text": "As the price of redemption of the two hundred seventy-three of the firstborn of the Israelites, over and above the number of the Levites,"
    },
    {
      "verse": 47,
      "text": "you shall take five shekels apiece, reckoning by the shekel of the sanctuary, a shekel of twenty gerahs."
    },
    {
      "verse": 48,
      "text": "Give to Aaron and his sons the money by which the excess number of them is redeemed.”"
    },
    {
      "verse": 49,
      "text": "So Moses took the redemption money from those who were over and above those redeemed by the Levites;"
    },
    {
      "verse": 50,
      "text": "from the firstborn of the Israelites he took the money, one thousand three hundred sixty-five shekels, reckoned by the shekel of the sanctuary,"
    },
    {
      "verse": 51,
      "text": "and Moses gave the redemption money to Aaron and his sons, according to the word of the Lord, as the Lord had commanded Moses."
    }
  ],
  "timestamp": "2025-08-08T15:48:29.131347"
}