{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 6,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PRO.6",
  "verses": [
    {
      "verse": 1,
      "text": "My child, if you have given your pledge to your neighbor, if you have bound yourself to another,"
    },
    {
      "verse": 2,
      "text": "you are snared by the utterance of your lips, caught by the words of your mouth."
    },
    {
      "verse": 3,
      "text": "So do this, my child, and save yourself, for you have come into your neighbor’s power: go, hurry, and plead with your neighbor."
    },
    {
      "verse": 4,
      "text": "Give your eyes no sleep and your eyelids no slumber;"
    },
    {
      "verse": 5,
      "text": "save yourself like a gazelle from the hunter, like a bird from the hand of the fowler."
    },
    {
      "verse": 6,
      "text": "Go to the ant, you lazybones; consider its ways and be wise."
    },
    {
      "verse": 7,
      "text": "Without having any chief or officer or ruler,"
    },
    {
      "verse": 8,
      "text": "it prepares its food in summer and gathers its sustenance in harvest."
    },
    {
      "verse": 9,
      "text": "How long will you lie there, O lazybones? When will you rise from your sleep?"
    },
    {
      "verse": 10,
      "text": "A little sleep, a little slumber, a little folding of the hands to rest,"
    },
    {
      "verse": 11,
      "text": "and poverty will come upon you like a robber, and want, like an armed warrior."
    },
    {
      "verse": 12,
      "text": "A scoundrel and a villain goes around with crooked speech,"
    },
    {
      "verse": 13,
      "text": "winking the eyes, shuffling the feet, pointing the fingers,"
    },
    {
      "verse": 14,
      "text": "with perverted mind devising evil, continually sowing discord;"
    },
    {
      "verse": 15,
      "text": "on such a one calamity will descend suddenly, in a moment, damage beyond repair."
    },
    {
      "verse": 16,
      "text": "There are six things that the Lord hates, seven that are an abomination to him:"
    },
    {
      "verse": 17,
      "text": "haughty eyes, a lying tongue, and hands that shed innocent blood,"
    },
    {
      "verse": 18,
      "text": "a heart that devises wicked plans, feet that hurry to run to evil,"
    },
    {
      "verse": 19,
      "text": "a lying witness who testifies falsely, and one who sows discord in a family."
    },
    {
      "verse": 20,
      "text": "My child, keep your father’s commandment, and do not forsake your mother’s teaching."
    },
    {
      "verse": 21,
      "text": "Bind them upon your heart always; tie them around your neck."
    },
    {
      "verse": 22,
      "text": "When you walk, they will lead you; when you lie down, they will watch over you; and when you awake, they will talk with you."
    },
    {
      "verse": 23,
      "text": "For the commandment is a lamp and the teaching a light, and the reproofs of discipline are the way of life,"
    },
    {
      "verse": 24,
      "text": "to preserve you from the wife of another, from the smooth tongue of the adulteress."
    },
    {
      "verse": 25,
      "text": "Do not desire her beauty in your heart, and do not let her capture you with her eyelashes,"
    },
    {
      "verse": 26,
      "text": "for a prostitute’s fee is only a loaf of bread, but the wife of another stalks a man’s precious life."
    },
    {
      "verse": 27,
      "text": "Can fire be carried in the bosom without burning one’s clothes?"
    },
    {
      "verse": 28,
      "text": "Or can one walk on hot coals without scorching the feet?"
    },
    {
      "verse": 29,
      "text": "So is he who sleeps with his neighbor’s wife; no one who touches her will go unpunished."
    },
    {
      "verse": 30,
      "text": "Thieves are not despised who steal only to satisfy their appetite when they are hungry."
    },
    {
      "verse": 31,
      "text": "Yet if they are caught, they will pay sevenfold; they will forfeit all the goods of their house."
    },
    {
      "verse": 32,
      "text": "But he who commits adultery has no sense; he who does it destroys himself."
    },
    {
      "verse": 33,
      "text": "He will get wounds and dishonor, and his disgrace will not be wiped away."
    },
    {
      "verse": 34,
      "text": "For jealousy arouses a husband’s fury, and he will show no restraint when he takes revenge."
    },
    {
      "verse": 35,
      "text": "He will accept no compensation and will refuse a bribe no matter how great."
    }
  ],
  "timestamp": "2025-08-08T15:50:11.229284"
}