{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 22,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PRO.22",
  "verses": [
    {
      "verse": 1,
      "text": "A good name is to be chosen rather than great riches, and favor is better than silver or gold."
    },
    {
      "verse": 2,
      "text": "The rich and the poor have this in common: the Lord is the maker of them all."
    },
    {
      "verse": 3,
      "text": "The clever see danger and hide, but the simple go on and suffer for it."
    },
    {
      "verse": 4,
      "text": "The reward for humility and fear of the Lord is riches and honor and life."
    },
    {
      "verse": 5,
      "text": "Thorns and snares are in the way of the perverse; the cautious will keep far from them."
    },
    {
      "verse": 6,
      "text": "Train children in the right way, and when old, they will not stray."
    },
    {
      "verse": 7,
      "text": "The rich rule over the poor, and the borrower is the slave of the lender."
    },
    {
      "verse": 8,
      "text": "Whoever sows injustice will reap calamity, and the rod of anger will fail."
    },
    {
      "verse": 9,
      "text": "Those who are generous are blessed,"
    },
    {
      "verse": 10,
      "text": "Drive out a scoffer, and strife goes out; quarreling and abuse will cease."
    },
    {
      "verse": 11,
      "text": "Those who love a pure heart and are gracious in speech will have the king as a friend."
    },
    {
      "verse": 12,
      "text": "The eyes of the Lord keep watch over knowledge, but he overthrows the words of the faithless."
    },
    {
      "verse": 13,
      "text": "The lazy person says, “There is a lion outside! I shall be killed in the streets!”"
    },
    {
      "verse": 14,
      "text": "The mouth of a loose woman is a deep pit; he with whom the Lord is angry falls into it."
    },
    {
      "verse": 15,
      "text": "Folly is bound up in the heart of a child, but the rod of discipline drives it far away."
    },
    {
      "verse": 16,
      "text": "Oppressing the poor in order to enrich oneself, and giving to the rich, will lead only to loss."
    },
    {
      "verse": 17,
      "text": "The words of the wise: Incline your ear and hear my words and apply your mind to my teaching,"
    },
    {
      "verse": 18,
      "text": "for it will be pleasant if you keep them within you, if all of them are ready on your lips."
    },
    {
      "verse": 19,
      "text": "So that your trust may be in the Lord, I have made them known to you today, yes, to you."
    },
    {
      "verse": 20,
      "text": "Have I not written for you thirty sayings of admonition and knowledge,"
    },
    {
      "verse": 21,
      "text": "to show you what is right and true, so that you may give a true answer to those who sent you?"
    },
    {
      "verse": 22,
      "text": "Do not rob the poor because they are poor or crush the afflicted at the gate,"
    },
    {
      "verse": 23,
      "text": "for the Lord pleads their cause and despoils of life those who despoil them."
    },
    {
      "verse": 24,
      "text": "Make no friends with those given to anger, and do not associate with hotheads,"
    },
    {
      "verse": 25,
      "text": "lest you learn their ways and entangle yourself in a snare."
    },
    {
      "verse": 26,
      "text": "Do not be one of those who give pledges, who become surety for debts."
    },
    {
      "verse": 27,
      "text": "If you have nothing with which to pay, why should your bed be taken from under you?"
    },
    {
      "verse": 28,
      "text": "Do not remove the ancient landmark that your ancestors set up."
    },
    {
      "verse": 29,
      "text": "Do you see those who are skillful in their work? They will serve kings; they will not serve common people."
    }
  ],
  "timestamp": "2025-08-08T15:50:13.684924"
}