{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 28,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PRO.28",
  "verses": [
    {
      "verse": 1,
      "text": "The wicked flee when no one pursues, but the righteous are as bold as a lion."
    },
    {
      "verse": 2,
      "text": "When a land rebels it has many rulers; but with an intelligent person, honesty endures."
    },
    {
      "verse": 3,
      "text": "A poor person who oppresses the poor is a beating rain that leaves no food."
    },
    {
      "verse": 4,
      "text": "Those who forsake the law praise the wicked, but those who keep the law struggle against them."
    },
    {
      "verse": 5,
      "text": "The evil do not understand justice, but those who seek the Lord understand it completely."
    },
    {
      "verse": 6,
      "text": "Better to be poor and walk in integrity than to be crooked in one’s ways even though rich."
    },
    {
      "verse": 7,
      "text": "Those who keep the law are wise children, but companions of gluttons shame their parents."
    },
    {
      "verse": 8,
      "text": "One who augments wealth by exorbitant interest gathers it for another who is kind to the poor."
    },
    {
      "verse": 9,
      "text": "When one will not listen to the law, even one’s prayers are an abomination."
    },
    {
      "verse": 10,
      "text": "Those who mislead the upright into evil ways will fall into pits of their own making, but the blameless will have a goodly inheritance."
    },
    {
      "verse": 11,
      "text": "The rich is wise in self-esteem, but an intelligent poor person sees through the pose."
    },
    {
      "verse": 12,
      "text": "When the righteous rejoice, there is great glory, but when the wicked prevail, people go into hiding."
    },
    {
      "verse": 13,
      "text": "No one who conceals transgressions will prosper, but one who confesses and forsakes them will obtain mercy."
    },
    {
      "verse": 14,
      "text": "Happy is the one who is never without fear, but one who is hard-hearted will fall into calamity."
    },
    {
      "verse": 15,
      "text": "Like a roaring lion or a charging bear is a wicked ruler over a poor people."
    },
    {
      "verse": 16,
      "text": "A ruler who lacks understanding is a cruel oppressor, but one who hates unjust gain will enjoy a long life."
    },
    {
      "verse": 17,
      "text": "If someone is burdened with the blood of another, let that killer be a fugitive until death; let no one offer assistance."
    },
    {
      "verse": 18,
      "text": "One who walks in integrity will be safe, but whoever follows crooked ways will fall into the Pit."
    },
    {
      "verse": 19,
      "text": "Anyone who tills the land will have plenty of bread, but one who follows worthless pursuits will have plenty of poverty."
    },
    {
      "verse": 20,
      "text": "The faithful will abound with blessings, but one who is in a hurry to be rich will not go unpunished."
    },
    {
      "verse": 21,
      "text": "To show partiality is not good, yet for a piece of bread a person may do wrong."
    },
    {
      "verse": 22,
      "text": "The miser is in a hurry to get rich and does not know that loss is sure to come."
    },
    {
      "verse": 23,
      "text": "Whoever rebukes a person will afterward find more favor than one who flatters with the tongue."
    },
    {
      "verse": 24,
      "text": "Anyone who robs father or mother and says, “That is no crime,” is partner to a thug."
    },
    {
      "verse": 25,
      "text": "The greedy person stirs up strife, but whoever trusts in the Lord will be enriched."
    },
    {
      "verse": 26,
      "text": "Those who trust in their own wits are fools, but those who walk in wisdom come through safely."
    },
    {
      "verse": 27,
      "text": "Whoever gives to the poor will lack nothing, but one who turns a blind eye will get many a curse."
    },
    {
      "verse": 28,
      "text": "When the wicked prevail, people go into hiding, but when they perish, the righteous increase."
    }
  ],
  "timestamp": "2025-08-08T15:50:14.594233"
}