{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 29,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PRO.29",
  "verses": [
    {
      "verse": 1,
      "text": "One who is often reproved, yet remains stubborn, will suddenly be broken beyond healing."
    },
    {
      "verse": 2,
      "text": "When the righteous are in authority, the people rejoice, but when the wicked rule, the people groan."
    },
    {
      "verse": 3,
      "text": "A child who loves wisdom makes a parent glad, but a companion of prostitutes destroys wealth."
    },
    {
      "verse": 4,
      "text": "By justice a king gives stability to the land, but one who makes heavy exactions ruins it."
    },
    {
      "verse": 5,
      "text": "Whoever flatters a neighbor is spreading a net for the neighbor’s feet."
    },
    {
      "verse": 6,
      "text": "In the transgression of the evil there is a snare, but the righteous sing and rejoice."
    },
    {
      "verse": 7,
      "text": "The righteous know the rights of the poor; the wicked have no such understanding."
    },
    {
      "verse": 8,
      "text": "Scoffers set a city aflame, but the wise turn away wrath."
    },
    {
      "verse": 9,
      "text": "If the wise go to law with fools, there is ranting and ridicule without relief."
    },
    {
      "verse": 10,
      "text": "The bloodthirsty hate the blameless, and they seek the life of the upright."
    },
    {
      "verse": 11,
      "text": "A fool gives full vent to anger, but the wise quietly holds it back."
    },
    {
      "verse": 12,
      "text": "If a ruler listens to falsehood, all his officials will be wicked."
    },
    {
      "verse": 13,
      "text": "The poor and the oppressor have this in common: the Lord gives light to the eyes of both."
    },
    {
      "verse": 14,
      "text": "If a king judges the poor with equity, his throne will be established forever."
    },
    {
      "verse": 15,
      "text": "The rod and reproof give wisdom, but a mother is disgraced by a neglected child."
    },
    {
      "verse": 16,
      "text": "When the wicked are in authority, transgression increases, but the righteous will look upon their downfall."
    },
    {
      "verse": 17,
      "text": "Discipline your children, and they will give you rest; they will give delight to your heart."
    },
    {
      "verse": 18,
      "text": "Where there is no prophecy, the people cast off restraint, but happy are those who keep the law."
    },
    {
      "verse": 19,
      "text": "By mere words slaves are not disciplined, for though they understand, they will not give heed."
    },
    {
      "verse": 20,
      "text": "Do you see someone who is hasty in speech? There is more hope for a fool than for anyone like that."
    },
    {
      "verse": 21,
      "text": "A slave pampered from childhood will come to a bad end."
    },
    {
      "verse": 22,
      "text": "One given to anger stirs up strife, and the hothead causes much transgression."
    },
    {
      "verse": 23,
      "text": "A person’s pride will bring humiliation, but one who is lowly in spirit will obtain honor."
    },
    {
      "verse": 24,
      "text": "To be a partner of a thief is to hate one’s own life; one hears the victim’s curse but discloses nothing."
    },
    {
      "verse": 25,
      "text": "The fear of others lays a snare, but one who trusts in the Lord is secure."
    },
    {
      "verse": 26,
      "text": "Many seek the favor of a ruler, but it is from the Lord that one gets justice."
    },
    {
      "verse": 27,
      "text": "The unjust are an abomination to the righteous, but the upright are an abomination to the wicked."
    }
  ],
  "timestamp": "2025-08-08T15:50:14.810083"
}