{
  "book": "PRO",
  "book_name": "Proverbs",
  "chapter": 13,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PRO.13",
  "verses": [
    {
      "verse": 1,
      "text": "A wise child loves discipline, but a scoffer does not listen to rebuke."
    },
    {
      "verse": 2,
      "text": "From the fruit of their words good persons eat good things, but the desire of the treacherous is for wrongdoing."
    },
    {
      "verse": 3,
      "text": "Those who guard their mouths preserve their lives; those who open wide their lips come to ruin."
    },
    {
      "verse": 4,
      "text": "The appetite of the lazy craves and gets nothing, while the appetite of the diligent is richly supplied."
    },
    {
      "verse": 5,
      "text": "The righteous hate falsehood, but the wicked act shamefully and disgracefully."
    },
    {
      "verse": 6,
      "text": "Righteousness guards one whose way is upright, but sin overthrows the wicked."
    },
    {
      "verse": 7,
      "text": "Some pretend to be rich yet have nothing; others pretend to be poor yet have great wealth."
    },
    {
      "verse": 8,
      "text": "Wealth is a ransom for a person’s life, but a poor person pays no attention to a rebuke."
    },
    {
      "verse": 9,
      "text": "The light of the righteous rejoices, but the lamp of the wicked goes out."
    },
    {
      "verse": 10,
      "text": "By insolence the empty-headed person makes strife, but wisdom is with those who take advice."
    },
    {
      "verse": 11,
      "text": "Wealth hastily gotten will dwindle, but those who gather little by little will increase it."
    },
    {
      "verse": 12,
      "text": "Hope deferred makes the heart sick, but a desire fulfilled is a tree of life."
    },
    {
      "verse": 13,
      "text": "Those who despise a word bring destruction on themselves, but those who respect a command will be rewarded."
    },
    {
      "verse": 14,
      "text": "The teaching of the wise is a fountain of life, so that one may avoid the snares of death."
    },
    {
      "verse": 15,
      "text": "Good sense wins favor, but the way of the faithless is their ruin."
    },
    {
      "verse": 16,
      "text": "The clever do all things intelligently, but the fool displays folly."
    },
    {
      "verse": 17,
      "text": "A bad messenger brings trouble, but a faithful envoy, healing."
    },
    {
      "verse": 18,
      "text": "Poverty and disgrace are for the one who ignores instruction, but one who heeds reproof is honored."
    },
    {
      "verse": 19,
      "text": "A desire realized is sweet to the soul, but to turn away from evil is an abomination to fools."
    },
    {
      "verse": 20,
      "text": "Whoever walks with the wise becomes wise, but the companion of fools suffers harm."
    },
    {
      "verse": 21,
      "text": "Misfortune pursues sinners, but prosperity rewards the righteous."
    },
    {
      "verse": 22,
      "text": "The good leave an inheritance to their children’s children, but the sinner’s wealth is laid up for the righteous."
    },
    {
      "verse": 23,
      "text": "The field of the poor may yield much food, but it is swept away through injustice."
    },
    {
      "verse": 24,
      "text": "Those who spare the rod hate their children, but those who love them are diligent to discipline them."
    },
    {
      "verse": 25,
      "text": "The righteous have enough to satisfy their appetite, but the belly of the wicked is empty."
    }
  ],
  "timestamp": "2025-08-08T15:50:12.340863"
}