{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 91,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.91",
  "verses": [
    {
      "verse": 1,
      "text": "You who live in the shelter of the Most High, who abide in the shadow of the Almighty,"
    },
    {
      "verse": 2,
      "text": "will say to the Lord, “My refuge and my fortress; my God, in whom I trust.”"
    },
    {
      "verse": 3,
      "text": "For he will deliver you from the snare of the hunter and from the deadly pestilence;"
    },
    {
      "verse": 4,
      "text": "he will cover you with his pinions, and under his wings you will find refuge; his faithfulness is a shield and defense."
    },
    {
      "verse": 5,
      "text": "You will not fear the terror of the night or the arrow that flies by day"
    },
    {
      "verse": 6,
      "text": "or the pestilence that stalks in darkness or the destruction that wastes at noonday."
    },
    {
      "verse": 7,
      "text": "A thousand may fall at your side, ten thousand at your right hand, but it will not come near you."
    },
    {
      "verse": 8,
      "text": "You will only look with your eyes and see the punishment of the wicked."
    },
    {
      "verse": 9,
      "text": "Because you have made the Lord your refuge, the Most High your dwelling place,"
    },
    {
      "verse": 10,
      "text": "no evil shall befall you, no scourge come near your tent."
    },
    {
      "verse": 11,
      "text": "For he will command his angels concerning you to guard you in all your ways."
    },
    {
      "verse": 12,
      "text": "On their hands they will bear you up, so that you will not dash your foot against a stone."
    },
    {
      "verse": 13,
      "text": "You will tread on the lion and the adder; the young lion and the serpent you will trample under foot."
    },
    {
      "verse": 14,
      "text": "Those who love me, I will deliver; I will protect those who know my name."
    },
    {
      "verse": 15,
      "text": "When they call to me, I will answer them; I will be with them in trouble; I will rescue them and honor them."
    },
    {
      "verse": 16,
      "text": "With long life I will satisfy them and show them my salvation."
    }
  ],
  "timestamp": "2025-08-08T15:49:59.710926"
}