{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 55,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.55",
  "verses": [
    {
      "verse": 1,
      "text": "Give ear to my prayer, O God; do not hide yourself from my supplication."
    },
    {
      "verse": 2,
      "text": "Attend to me and answer me; I am troubled in my complaint. I am distraught"
    },
    {
      "verse": 3,
      "text": "by the noise of the enemy, because of the clamor of the wicked. For they bring trouble upon me, and in anger they bear a grudge against me."
    },
    {
      "verse": 4,
      "text": "My heart is in anguish within me; the terrors of death have fallen upon me."
    },
    {
      "verse": 5,
      "text": "Fear and trembling come upon me, and horror overwhelms me."
    },
    {
      "verse": 6,
      "text": "And I say, “O that I had wings like a dove! I would fly away and be at rest;"
    },
    {
      "verse": 7,
      "text": "truly, I would flee far away; I would lodge in the wilderness; Selah"
    },
    {
      "verse": 8,
      "text": "I would hurry to find a shelter for myself from the raging wind and tempest.”"
    },
    {
      "verse": 9,
      "text": "Confuse, O Lord, confound their speech, for I see violence and strife in the city."
    },
    {
      "verse": 10,
      "text": "Day and night they go around it on its walls, and iniquity and trouble are within it;"
    },
    {
      "verse": 11,
      "text": "ruin is in its midst; oppression and fraud do not depart from its marketplace."
    },
    {
      "verse": 12,
      "text": "It is not enemies who taunt me— I could bear that; it is not adversaries who deal insolently with me— I could hide from them."
    },
    {
      "verse": 13,
      "text": "But it is you, my equal, my companion, my familiar friend,"
    },
    {
      "verse": 14,
      "text": "with whom I kept pleasant company; we walked in the house of God with the throng."
    },
    {
      "verse": 15,
      "text": "Let death come upon them; let them go down alive to Sheol, for evil is in their homes and in their hearts."
    },
    {
      "verse": 16,
      "text": "But I call upon God, and the Lord will save me."
    },
    {
      "verse": 17,
      "text": "Evening and morning and at noon I utter my complaint and moan, and he will hear my voice."
    },
    {
      "verse": 18,
      "text": "He will redeem me unharmed from the battle that I wage, for many are arrayed against me."
    },
    {
      "verse": 19,
      "text": "God, who is enthroned from of old, Selah will hear and will humble them, because they do not change and do not fear God."
    },
    {
      "verse": 20,
      "text": "My companion laid hands on a friend and violated a covenant with me"
    },
    {
      "verse": 21,
      "text": "with speech smoother than butter but with a heart set on war, with words that were softer than oil but in fact were drawn swords."
    },
    {
      "verse": 22,
      "text": "Cast your burden on the Lord, and he will sustain you; he will never permit the righteous to be moved."
    },
    {
      "verse": 23,
      "text": "But you, O God, will cast them down into the lowest pit; the bloodthirsty and treacherous shall not live out half their days. But I will trust in you."
    }
  ],
  "timestamp": "2025-08-08T15:49:54.102000"
}