{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 94,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.94",
  "verses": [
    {
      "verse": 1,
      "text": "O Lord, you God of vengeance, you God of vengeance, shine forth!"
    },
    {
      "verse": 2,
      "text": "Rise up, O judge of the earth; give to the proud what they deserve!"
    },
    {
      "verse": 3,
      "text": "O Lord, how long shall the wicked, how long shall the wicked exult?"
    },
    {
      "verse": 4,
      "text": "They pour out their arrogant words; all the evildoers boast."
    },
    {
      "verse": 5,
      "text": "They crush your people, O Lord, and afflict your heritage."
    },
    {
      "verse": 6,
      "text": "They kill the widow and the stranger; they murder the orphan,"
    },
    {
      "verse": 7,
      "text": "and they say, “The Lord does not see; the God of Jacob does not perceive.”"
    },
    {
      "verse": 8,
      "text": "Understand, O dullest of the people; fools, when will you be wise?"
    },
    {
      "verse": 9,
      "text": "He who planted the ear, does he not hear? He who formed the eye, does he not see?"
    },
    {
      "verse": 10,
      "text": "He who disciplines the nations, he who teaches knowledge to humankind, does he not chastise?"
    },
    {
      "verse": 11,
      "text": "The Lord knows our thoughts, that they are but an empty breath."
    },
    {
      "verse": 12,
      "text": "Happy are those whom you discipline, O Lord, and whom you teach out of your law,"
    },
    {
      "verse": 13,
      "text": "giving them respite from days of trouble, until a pit is dug for the wicked."
    },
    {
      "verse": 14,
      "text": "For the Lord will not forsake his people; he will not abandon his heritage;"
    },
    {
      "verse": 15,
      "text": "for justice will return to the righteous, and all the upright in heart will follow it."
    },
    {
      "verse": 16,
      "text": "Who rises up for me against the wicked? Who stands up for me against evildoers?"
    },
    {
      "verse": 17,
      "text": "If the Lord had not been my help, my soul would soon have lived in the land of silence."
    },
    {
      "verse": 18,
      "text": "When I thought, “My foot is slipping,” your steadfast love, O Lord, held me up."
    },
    {
      "verse": 19,
      "text": "When the cares of my heart are many, your consolations cheer my soul."
    },
    {
      "verse": 20,
      "text": "Can wicked rulers be allied with you, those who contrive mischief by statute?"
    },
    {
      "verse": 21,
      "text": "They band together against the life of the righteous and condemn the innocent to death."
    },
    {
      "verse": 22,
      "text": "But the Lord has become my stronghold and my God the rock of my refuge."
    },
    {
      "verse": 23,
      "text": "He will repay them for their iniquity and wipe them out for their wickedness; the Lord our God will wipe them out."
    }
  ],
  "timestamp": "2025-08-08T15:50:00.238653"
}