{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 104,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.104",
  "verses": [
    {
      "verse": 1,
      "text": "Bless the Lord, O my soul. O Lord my God, you are very great. You are clothed with honor and majesty,"
    },
    {
      "verse": 2,
      "text": "wrapped in light as with a garment. You stretch out the heavens like a tent;"
    },
    {
      "verse": 3,
      "text": "you set the beams of your chambers on the waters; you make the clouds your chariot; you ride on the wings of the wind;"
    },
    {
      "verse": 4,
      "text": "you make the winds your messengers, fire and flame your ministers."
    },
    {
      "verse": 5,
      "text": "You set the earth on its foundations, so that it shall never be shaken."
    },
    {
      "verse": 6,
      "text": "You cover it with the deep as with a garment; the waters stood above the mountains."
    },
    {
      "verse": 7,
      "text": "At your rebuke they flee; at the sound of your thunder they take to flight."
    },
    {
      "verse": 8,
      "text": "They rose up to the mountains, ran down to the valleys, to the place that you appointed for them."
    },
    {
      "verse": 9,
      "text": "You set a boundary that they may not pass, so that they might not again cover the earth."
    },
    {
      "verse": 10,
      "text": "You make springs gush forth in the valleys; they flow between the hills,"
    },
    {
      "verse": 11,
      "text": "giving drink to every wild animal; the wild asses quench their thirst."
    },
    {
      "verse": 12,
      "text": "By the streams the birds of the air have their habitation; they sing among the branches."
    },
    {
      "verse": 13,
      "text": "From your lofty abode you water the mountains; the earth is satisfied with the fruit of your work."
    },
    {
      "verse": 14,
      "text": "You cause the grass to grow for the cattle and plants for people to cultivate, to bring forth food from the earth"
    },
    {
      "verse": 15,
      "text": "and wine to gladden the human heart, oil to make the face shine and bread to strengthen the human heart."
    },
    {
      "verse": 16,
      "text": "The trees of the field are watered abundantly, the cedars of Lebanon that he planted."
    },
    {
      "verse": 17,
      "text": "In them the birds build their nests; the stork has its home in the fir trees."
    },
    {
      "verse": 18,
      "text": "The high mountains are for the wild goats; the rocks are a refuge for the coneys."
    },
    {
      "verse": 19,
      "text": "You have made the moon to mark the seasons; the sun knows its time for setting."
    },
    {
      "verse": 20,
      "text": "You make darkness, and it is night, when all the animals of the forest come creeping out."
    },
    {
      "verse": 21,
      "text": "The young lions roar for their prey, seeking their food from God."
    },
    {
      "verse": 22,
      "text": "When the sun rises, they withdraw and lie down in their dens."
    },
    {
      "verse": 23,
      "text": "People go out to their work and to their labor until the evening."
    },
    {
      "verse": 24,
      "text": "O Lord, how manifold are your works! In wisdom you have made them all; the earth is full of your creatures."
    },
    {
      "verse": 25,
      "text": "There is the sea, great and wide; creeping things innumerable are there, living things both small and great."
    },
    {
      "verse": 26,
      "text": "There go the ships and Leviathan that you formed to sport in it."
    },
    {
      "verse": 27,
      "text": "These all look to you to give them their food in due season;"
    },
    {
      "verse": 28,
      "text": "when you give to them, they gather it up; when you open your hand, they are filled with good things."
    },
    {
      "verse": 29,
      "text": "When you hide your face, they are dismayed; when you take away their breath, they die and return to their dust."
    },
    {
      "verse": 30,
      "text": "When you send forth your spirit, they are created, and you renew the face of the ground."
    },
    {
      "verse": 31,
      "text": "May the glory of the Lord endure forever; may the Lord rejoice in his works—"
    },
    {
      "verse": 32,
      "text": "who looks on the earth and it trembles, who touches the mountains and they smoke."
    },
    {
      "verse": 33,
      "text": "I will sing to the Lord as long as I live; I will sing praise to my God while I have being."
    },
    {
      "verse": 34,
      "text": "May my meditation be pleasing to him, for I rejoice in the Lord."
    },
    {
      "verse": 35,
      "text": "Let sinners be consumed from the earth, and let the wicked be no more. Bless the Lord, O my soul. Praise the Lord!"
    }
  ],
  "timestamp": "2025-08-08T15:50:01.701604"
}