{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 116,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.116",
  "verses": [
    {
      "verse": 1,
      "text": "I love the Lord because he has heard my voice and my supplications."
    },
    {
      "verse": 2,
      "text": "Because he inclined his ear to me, therefore I will call on him as long as I live."
    },
    {
      "verse": 3,
      "text": "The snares of death encompassed me; the pangs of Sheol laid hold on me; I suffered distress and anguish."
    },
    {
      "verse": 4,
      "text": "Then I called on the name of the Lord, “O Lord, I pray, save my life!”"
    },
    {
      "verse": 5,
      "text": "Gracious is the Lord and righteous; our God is merciful."
    },
    {
      "verse": 6,
      "text": "The Lord protects the simple; when I was brought low, he saved me."
    },
    {
      "verse": 7,
      "text": "Return, O my soul, to your rest, for the Lord has dealt bountifully with you."
    },
    {
      "verse": 8,
      "text": "For you have delivered my soul from death, my eyes from tears, my feet from stumbling."
    },
    {
      "verse": 9,
      "text": "I walk before the Lord in the land of the living."
    },
    {
      "verse": 10,
      "text": "I kept my faith, even when I said, “I am greatly afflicted”;"
    },
    {
      "verse": 11,
      "text": "I said in my consternation, “Everyone is a liar.”"
    },
    {
      "verse": 12,
      "text": "What shall I return to the Lord for all his bounty to me?"
    },
    {
      "verse": 13,
      "text": "I will lift up the cup of salvation and call on the name of the Lord;"
    },
    {
      "verse": 14,
      "text": "I will pay my vows to the Lord in the presence of all his people."
    },
    {
      "verse": 15,
      "text": "Precious in the sight of the Lord is the death of his faithful ones."
    },
    {
      "verse": 16,
      "text": "O Lord, I am your servant; I am your servant, the child of your serving girl. You have loosed my bonds."
    },
    {
      "verse": 17,
      "text": "I will offer to you a thanksgiving sacrifice and call on the name of the Lord."
    },
    {
      "verse": 18,
      "text": "I will pay my vows to the Lord in the presence of all his people,"
    },
    {
      "verse": 19,
      "text": "in the courts of the house of the Lord, in your midst, O Jerusalem. Praise the Lord!"
    }
  ],
  "timestamp": "2025-08-08T15:50:03.583874"
}