{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 88,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.88",
  "verses": [
    {
      "verse": 1,
      "text": "O Lord, God of my salvation, at night, when I cry out before you,"
    },
    {
      "verse": 2,
      "text": "let my prayer come before you; incline your ear to my cry."
    },
    {
      "verse": 3,
      "text": "For my soul is full of troubles, and my life draws near to Sheol."
    },
    {
      "verse": 4,
      "text": "I am counted among those who go down to the Pit; I am like those who have no help,"
    },
    {
      "verse": 5,
      "text": "like those forsaken among the dead, like the slain that lie in the grave, like those whom you remember no more, for they are cut off from your hand."
    },
    {
      "verse": 6,
      "text": "You have put me in the depths of the Pit, in the regions dark and deep."
    },
    {
      "verse": 7,
      "text": "Your wrath lies heavy upon me, and you overwhelm me with all your waves. Selah"
    },
    {
      "verse": 8,
      "text": "You have caused my companions to shun me; you have made me a thing of horror to them. I am shut in so that I cannot escape;"
    },
    {
      "verse": 9,
      "text": "my eye grows dim through sorrow. Every day I call on you, O Lord; I spread out my hands to you."
    },
    {
      "verse": 10,
      "text": "Do you work wonders for the dead? Do the shades rise up to praise you? Selah"
    },
    {
      "verse": 11,
      "text": "Is your steadfast love declared in the grave or your faithfulness in Abaddon?"
    },
    {
      "verse": 12,
      "text": "Are your wonders known in the darkness or your saving help in the land of forgetfulness?"
    },
    {
      "verse": 13,
      "text": "But I, O Lord, cry out to you; in the morning my prayer comes before you."
    },
    {
      "verse": 14,
      "text": "O Lord, why do you cast me off? Why do you hide your face from me?"
    },
    {
      "verse": 15,
      "text": "Wretched and close to death from my youth up, I suffer your terrors; I am desperate."
    },
    {
      "verse": 16,
      "text": "Your wrath has swept over me; your dread assaults destroy me."
    },
    {
      "verse": 17,
      "text": "They surround me like a flood all day long; from all sides they close in on me."
    },
    {
      "verse": 18,
      "text": "You have caused friend and neighbor to shun me; my companions are in darkness."
    }
  ],
  "timestamp": "2025-08-08T15:49:59.213224"
}