{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 27,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.27",
  "verses": [
    {
      "verse": 1,
      "text": "The Lord is my light and my salvation; whom shall I fear? The Lord is the stronghold of my life; of whom shall I be afraid?"
    },
    {
      "verse": 2,
      "text": "When evildoers assail me to devour my flesh— my adversaries and foes— they shall stumble and fall."
    },
    {
      "verse": 3,
      "text": "Though an army encamp against me, my heart shall not fear; though war rise up against me, yet I will be confident."
    },
    {
      "verse": 4,
      "text": "One thing I asked of the Lord; this I seek: to live in the house of the Lord all the days of my life, to behold the beauty of the Lord, and to inquire in his temple."
    },
    {
      "verse": 5,
      "text": "For he will hide me in his shelter in the day of trouble; he will conceal me under the cover of his tent; he will set me high on a rock."
    },
    {
      "verse": 6,
      "text": "Now my head is lifted up above my enemies all around me, and I will offer in his tent sacrifices with shouts of joy; I will sing and make melody to the Lord."
    },
    {
      "verse": 7,
      "text": "Hear, O Lord, when I cry aloud; be gracious to me and answer me!"
    },
    {
      "verse": 8,
      "text": "“Come,” my heart says, “seek his face!” Your face, Lord, do I seek."
    },
    {
      "verse": 9,
      "text": "Do not hide your face from me. Do not turn your servant away in anger, you who have been my help. Do not cast me off; do not forsake me, O God of my salvation!"
    },
    {
      "verse": 10,
      "text": "If my father and mother forsake me, the Lord will take me up."
    },
    {
      "verse": 11,
      "text": "Teach me your way, O Lord, and lead me on a level path because of my enemies."
    },
    {
      "verse": 12,
      "text": "Do not give me up to the will of my adversaries, for false witnesses have risen against me, and they are breathing out violence."
    },
    {
      "verse": 13,
      "text": "I believe that I shall see the goodness of the Lord in the land of the living."
    },
    {
      "verse": 14,
      "text": "Wait for the Lord; be strong, and let your heart take courage; wait for the Lord!"
    }
  ],
  "timestamp": "2025-08-08T15:49:49.749536"
}