{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 25,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.25",
  "verses": [
    {
      "verse": 1,
      "text": "To you, O Lord, I lift up my soul."
    },
    {
      "verse": 2,
      "text": "O my God, in you I trust; do not let me be put to shame; do not let my enemies exult over me."
    },
    {
      "verse": 3,
      "text": "Do not let those who wait for you be put to shame; let them be ashamed who are wantonly treacherous."
    },
    {
      "verse": 4,
      "text": "Make me to know your ways, O Lord; teach me your paths."
    },
    {
      "verse": 5,
      "text": "Lead me in your truth and teach me, for you are the God of my salvation; for you I wait all day long."
    },
    {
      "verse": 6,
      "text": "Be mindful of your mercy, O Lord, and of your steadfast love, for they have been from of old."
    },
    {
      "verse": 7,
      "text": "Do not remember the sins of my youth or my transgressions; according to your steadfast love remember me, for the sake of your goodness, O Lord!"
    },
    {
      "verse": 8,
      "text": "Good and upright is the Lord; therefore he instructs sinners in the way."
    },
    {
      "verse": 9,
      "text": "He leads the humble in what is right and teaches the humble his way."
    },
    {
      "verse": 10,
      "text": "All the paths of the Lord are steadfast love and faithfulness, for those who keep his covenant and his decrees."
    },
    {
      "verse": 11,
      "text": "For your name’s sake, O Lord, pardon my guilt, for it is great."
    },
    {
      "verse": 12,
      "text": "Who are they who fear the Lord? He will teach them the way that they should choose."
    },
    {
      "verse": 13,
      "text": "They will abide in prosperity, and their children shall possess the land."
    },
    {
      "verse": 14,
      "text": "The friendship of the Lord is for those who fear him, and he makes his covenant known to them."
    },
    {
      "verse": 15,
      "text": "My eyes are ever toward the Lord, for he will pluck my feet out of the net."
    },
    {
      "verse": 16,
      "text": "Turn to me and be gracious to me, for I am lonely and afflicted."
    },
    {
      "verse": 17,
      "text": "Relieve the troubles of my heart, and bring me out of my distress."
    },
    {
      "verse": 18,
      "text": "Consider my affliction and my trouble, and forgive all my sins."
    },
    {
      "verse": 19,
      "text": "Consider how many are my foes and with what violent hatred they hate me."
    },
    {
      "verse": 20,
      "text": "O guard my life and deliver me; do not let me be put to shame, for I take refuge in you."
    },
    {
      "verse": 21,
      "text": "May integrity and uprightness preserve me, for I wait for you."
    },
    {
      "verse": 22,
      "text": "Redeem Israel, O God, out of all its troubles."
    }
  ],
  "timestamp": "2025-08-08T15:49:49.512028"
}