{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 10,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.10",
  "verses": [
    {
      "verse": 1,
      "text": "Why, O Lord, do you stand far off? Why do you hide yourself in times of trouble?"
    },
    {
      "verse": 2,
      "text": "In arrogance the wicked persecute the poor— let them be caught in the schemes they have devised."
    },
    {
      "verse": 3,
      "text": "For the wicked boast of the desires of their heart; those greedy for gain curse and renounce the Lord."
    },
    {
      "verse": 4,
      "text": "In the pride of their countenance the wicked say, “God will not seek it out”; all their thoughts are, “There is no God.”"
    },
    {
      "verse": 5,
      "text": "Their ways prosper at all times; your judgments are on high, out of their sight; as for their foes, they scoff at them."
    },
    {
      "verse": 6,
      "text": "They think in their heart, “We shall not be moved; throughout all generations we shall not meet adversity.”"
    },
    {
      "verse": 7,
      "text": "Their mouths are filled with cursing and deceit and oppression; under their tongues are mischief and iniquity."
    },
    {
      "verse": 8,
      "text": "They sit in ambush in the villages; in hiding places they murder the innocent. Their eyes stealthily watch for the helpless;"
    },
    {
      "verse": 9,
      "text": "they lurk in secret like a lion in its den; they lurk that they may seize the poor; they seize the poor and drag them off in their net."
    },
    {
      "verse": 10,
      "text": "They stoop, they crouch, and the helpless fall by their might."
    },
    {
      "verse": 11,
      "text": "They think in their heart, “God has forgotten; he has hidden his face; he will never see it.”"
    },
    {
      "verse": 12,
      "text": "Rise up, O Lord; O God, lift up your hand; do not forget the oppressed."
    },
    {
      "verse": 13,
      "text": "Why do the wicked renounce God and say in their hearts, “You will not call us to account”?"
    },
    {
      "verse": 14,
      "text": "But you do see! Indeed, you note trouble and grief, that you may take it into your hands; the helpless commit themselves to you; you have been the helper of the orphan."
    },
    {
      "verse": 15,
      "text": "Break the arm of the wicked and evildoers; seek out their wickedness until you find none."
    },
    {
      "verse": 16,
      "text": "The Lord is king forever and ever; the nations shall perish from his land."
    },
    {
      "verse": 17,
      "text": "O Lord, you will hear the desire of the meek; you will strengthen their heart; you will incline your ear"
    },
    {
      "verse": 18,
      "text": "to do justice for the orphan and the oppressed, so that those from earth may strike terror no more."
    }
  ],
  "timestamp": "2025-08-08T15:49:47.146647"
}