{
  "book": "PSA",
  "book_name": "Psalms",
  "chapter": 115,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/PSA.115",
  "verses": [
    {
      "verse": 1,
      "text": "Not to us, O Lord, not to us, but to your name give glory, for the sake of your steadfast love and your faithfulness."
    },
    {
      "verse": 2,
      "text": "Why should the nations say, “Where is their God?”"
    },
    {
      "verse": 3,
      "text": "Our God is in the heavens; he does whatever he pleases."
    },
    {
      "verse": 4,
      "text": "Their idols are silver and gold, the work of human hands."
    },
    {
      "verse": 5,
      "text": "They have mouths, but they do not speak; they have eyes, but they do not see."
    },
    {
      "verse": 6,
      "text": "They have ears, but they do not hear; they have noses, but they do not smell."
    },
    {
      "verse": 7,
      "text": "They have hands, but they do not feel; they have feet, but they do not walk; they make no sound in their throats."
    },
    {
      "verse": 8,
      "text": "Those who make them are like them; so are all who trust in them."
    },
    {
      "verse": 9,
      "text": "O Israel, trust in the Lord! He is their help and their shield."
    },
    {
      "verse": 10,
      "text": "O house of Aaron, trust in the Lord! He is their help and their shield."
    },
    {
      "verse": 11,
      "text": "You who fear the Lord, trust in the Lord! He is their help and their shield."
    },
    {
      "verse": 12,
      "text": "The Lord has been mindful of us; he will bless us; he will bless the house of Israel; he will bless the house of Aaron;"
    },
    {
      "verse": 13,
      "text": "he will bless those who fear the Lord, both small and great."
    },
    {
      "verse": 14,
      "text": "May the Lord give you increase, both you and your children."
    },
    {
      "verse": 15,
      "text": "May you be blessed by the Lord, who made heaven and earth."
    },
    {
      "verse": 16,
      "text": "The heavens are the Lord ’s heavens, but the earth he has given to human beings."
    },
    {
      "verse": 17,
      "text": "The dead do not praise the Lord, nor do any who go down into silence."
    },
    {
      "verse": 18,
      "text": "But we will bless the Lord from this time on and forevermore. Praise the Lord!"
    }
  ],
  "timestamp": "2025-08-08T15:50:03.467672"
}