{
  "book": "REV",
  "book_name": "Revelation",
  "chapter": 11,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/REV.11",
  "verses": [
    {
      "verse": 1,
      "text": "Then I was given a measuring rod like a staff, and I was told, “Come and measure the temple of God and the altar and those who worship there,"
    },
    {
      "verse": 2,
      "text": "but do not measure the court outside the temple; leave that out, for it is given over to the nations, and they will trample over the holy city for forty-two months."
    },
    {
      "verse": 3,
      "text": "And I will grant my two witnesses authority to prophesy for one thousand two hundred sixty days, wearing sackcloth.”"
    },
    {
      "verse": 4,
      "text": "These are the two olive trees and the two lampstands that stand before the Lord of the earth."
    },
    {
      "verse": 5,
      "text": "And if anyone wants to harm them, fire pours from their mouth and consumes their foes; anyone who wants to harm them must be killed in this manner."
    },
    {
      "verse": 6,
      "text": "They have authority to shut the sky, so that no rain may fall during the days of their prophesying, and they have authority over the waters to turn them into blood and to strike the earth with every kind of plague, as often as they desire."
    },
    {
      "verse": 7,
      "text": "When they have finished their testimony, the beast that comes up from the bottomless pit will wage war on them and conquer them and kill them,"
    },
    {
      "verse": 8,
      "text": "and their dead bodies will lie in the street of the great city that is prophetically called Sodom and Egypt, where also their Lord was crucified."
    },
    {
      "verse": 9,
      "text": "For three and a half days members of the peoples and tribes and languages and nations will gaze at their dead bodies and refuse to let them be placed in a tomb,"
    },
    {
      "verse": 10,
      "text": "and the inhabitants of the earth will gloat over them and celebrate and exchange presents, because these two prophets tormented the inhabitants of the earth."
    },
    {
      "verse": 11,
      "text": "But after the three and a half days, the breath of life from God entered the two witnesses, and they stood on their feet, and those who saw them were terrified."
    },
    {
      "verse": 12,
      "text": "Then they heard a loud voice from heaven saying to them, “Come up here!” And they went up to heaven in a cloud while their enemies watched them."
    },
    {
      "verse": 13,
      "text": "At that moment there was a great earthquake, and a tenth of the city fell; seven thousand people were killed in the earthquake, and the rest were terrified and gave glory to the God of heaven."
    },
    {
      "verse": 14,
      "text": "The second woe has passed. The third woe is coming very soon."
    },
    {
      "verse": 15,
      "text": "Then the seventh angel blew his trumpet, and there were loud voices in heaven, saying, “The kingdom of the world has become the kingdom of our Lord and of his Messiah, and he will reign forever and ever.”"
    },
    {
      "verse": 16,
      "text": "Then the twenty-four elders who sit on their thrones before God fell on their faces and worshiped God,"
    },
    {
      "verse": 17,
      "text": "singing, “We give you thanks, Lord God Almighty, who are and who were, for you have taken your great power and begun to reign."
    },
    {
      "verse": 18,
      "text": "The nations raged, but your wrath has come, and the time for judging the dead, for rewarding your servants, the prophets and saints and all who fear your name, both small and great, and for destroying those who destroy the earth.”"
    },
    {
      "verse": 19,
      "text": "Then God’s temple in heaven was opened, and the ark of his covenant was seen within his temple, and there were flashes of lightning, rumblings, peals of thunder, an earthquake, and heavy hail."
    }
  ],
  "timestamp": "2025-08-08T15:52:39.985932"
}