{
  "book": "REV",
  "book_name": "Revelation",
  "chapter": 9,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/REV.9",
  "verses": [
    {
      "verse": 1,
      "text": "And the fifth angel blew his trumpet, and I saw a star that had fallen from heaven to earth, and he was given the key to the shaft of the bottomless pit;"
    },
    {
      "verse": 2,
      "text": "he opened the shaft of the bottomless pit, and from the shaft rose smoke like the smoke of a great furnace, and the sun and the air were darkened with the smoke from the shaft."
    },
    {
      "verse": 3,
      "text": "Then from the smoke came locusts on the earth, and they were given authority like the authority of scorpions of the earth."
    },
    {
      "verse": 4,
      "text": "They were told not to damage the grass of the earth or any green growth or any tree, but only those people who do not have the seal of God on their foreheads."
    },
    {
      "verse": 5,
      "text": "They were allowed to torment them for five months but not to kill them, and the agony suffered was like that caused by a scorpion when it stings someone."
    },
    {
      "verse": 6,
      "text": "And in those days people will seek death but will not find it; they will long to die, but death will flee from them."
    },
    {
      "verse": 7,
      "text": "In appearance the locusts were like horses equipped for battle. On their heads were what looked like crowns of gold; their faces were like human faces,"
    },
    {
      "verse": 8,
      "text": "their hair like women’s hair, and their teeth like lions’ teeth;"
    },
    {
      "verse": 9,
      "text": "they had scales like iron breastplates, and the noise of their wings was like the noise of many chariots with horses rushing into battle."
    },
    {
      "verse": 10,
      "text": "They have tails like scorpions, with stingers, and in their tails is their power to harm people for five months."
    },
    {
      "verse": 11,
      "text": "They have as king over them the angel of the bottomless pit; his name in Hebrew is Abaddon, and in Greek he is called Apollyon."
    },
    {
      "verse": 12,
      "text": "The first woe has passed. There are still two woes to come."
    },
    {
      "verse": 13,
      "text": "Then the sixth angel blew his trumpet, and I heard a voice from the horns of the golden altar before God,"
    },
    {
      "verse": 14,
      "text": "saying to the sixth angel who had the trumpet, “Release the four angels who are bound at the great River Euphrates.”"
    },
    {
      "verse": 15,
      "text": "So the four angels were released, who had been held ready for the hour, the day, the month, and the year, to kill a third of humankind."
    },
    {
      "verse": 16,
      "text": "The number of the troops of cavalry was two hundred million; I heard their number."
    },
    {
      "verse": 17,
      "text": "And this was how I saw the horses in my vision: the riders wore breastplates the color of fire and of sapphire and of sulfur; the heads of the horses were like lions’ heads, and fire and smoke and sulfur came out of their mouths."
    },
    {
      "verse": 18,
      "text": "By these three plagues a third of humankind was killed, by the fire and smoke and sulfur coming out of the horses’ mouths."
    },
    {
      "verse": 19,
      "text": "For the power of the horses is in their mouths and in their tails; their tails are like serpents, with heads, and with them they inflict harm."
    },
    {
      "verse": 20,
      "text": "The rest of humankind, who were not killed by these plagues, did not repent of the works of their hands or give up worshiping demons and idols of gold and silver and bronze and stone and wood, which cannot see or hear or walk."
    },
    {
      "verse": 21,
      "text": "And they did not repent of their murders or their sorceries or their prostitution or their thefts."
    }
  ],
  "timestamp": "2025-08-08T15:52:39.734381"
}