{
  "book": "ROM",
  "book_name": "Romans",
  "chapter": 16,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ROM.16",
  "verses": [
    {
      "verse": 1,
      "text": "I commend to you our sister Phoebe, a deacon of the church at Cenchreae,"
    },
    {
      "verse": 2,
      "text": "so that you may welcome her in the Lord, as is fitting for the saints, and help her in whatever she may require from you, for she has been a benefactor of many and of myself as well."
    },
    {
      "verse": 3,
      "text": "Greet Prisca and Aquila, my coworkers in Christ Jesus,"
    },
    {
      "verse": 4,
      "text": "who risked their necks for my life, to whom not only I give thanks but also all the churches of the gentiles."
    },
    {
      "verse": 5,
      "text": "Greet also the church in their house. Greet my beloved Epaenetus, who was the first convert in Asia for Christ."
    },
    {
      "verse": 6,
      "text": "Greet Mary, who has worked very hard for you."
    },
    {
      "verse": 7,
      "text": "Greet Andronicus and Junia, my fellow Israelites who were in prison with me; they are prominent among the apostles, and they were in Christ before I was."
    },
    {
      "verse": 8,
      "text": "Greet Ampliatus, my beloved in the Lord."
    },
    {
      "verse": 9,
      "text": "Greet Urbanus, our coworker in Christ, and my beloved Stachys."
    },
    {
      "verse": 10,
      "text": "Greet Apelles, who is approved in Christ. Greet those who belong to the family of Aristobulus."
    },
    {
      "verse": 11,
      "text": "Greet my fellow Israelite Herodion. Greet those in the Lord who belong to the family of Narcissus."
    },
    {
      "verse": 12,
      "text": "Greet those workers in the Lord, Tryphaena and Tryphosa. Greet the beloved Persis, who has worked hard in the Lord."
    },
    {
      "verse": 13,
      "text": "Greet Rufus, chosen in the Lord, and greet his mother—a mother to me also."
    },
    {
      "verse": 14,
      "text": "Greet Asyncritus, Phlegon, Hermes, Patrobas, Hermas, and the brothers and sisters who are with them."
    },
    {
      "verse": 15,
      "text": "Greet Philologus, Julia, Nereus and his sister, and Olympas, and all the saints who are with them."
    },
    {
      "verse": 16,
      "text": "Greet one another with a holy kiss. All the churches of Christ greet you."
    },
    {
      "verse": 17,
      "text": "I urge you, brothers and sisters, to keep an eye on those who create dissensions and hindrances, in opposition to the teaching that you have learned; avoid them."
    },
    {
      "verse": 18,
      "text": "For such people do not serve our Lord Christ but their own appetites, and by smooth talk and flattery they deceive the hearts of the simple-minded."
    },
    {
      "verse": 19,
      "text": "For your obedience is known to all; therefore, I rejoice over you, but I want you to be wise in what is good and guileless in what is evil."
    },
    {
      "verse": 20,
      "text": "The God of peace will shortly crush Satan under your feet. The grace of our Lord Jesus Christ be with you."
    },
    {
      "verse": 21,
      "text": "Timothy, my coworker, greets you; so do Lucius and Jason and Sosipater, my fellow Israelites."
    },
    {
      "verse": 22,
      "text": "I Tertius, the writer of this letter, greet you in the Lord."
    },
    {
      "verse": 23,
      "text": "Gaius, who is host to me and to the whole church, greets you. Erastus, the city treasurer, and our brother Quartus greet you."
    },
    {
      "verse": 25,
      "text": "Now to God who is able to strengthen you according to my gospel and the proclamation of Jesus Christ, according to the revelation of the mystery that was kept secret for long ages"
    },
    {
      "verse": 26,
      "text": "but is now disclosed and through the prophetic writings is made known to all the gentiles, according to the command of the eternal God, to bring about the obedience of faith—"
    },
    {
      "verse": 27,
      "text": "to the only wise God, through Jesus Christ, to whom be the glory forever! Amen."
    }
  ],
  "timestamp": "2025-08-08T15:51:52.442180"
}