{
  "book": "ROM",
  "book_name": "Romans",
  "chapter": 8,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ROM.8",
  "verses": [
    {
      "verse": 1,
      "text": "Therefore there is now no condemnation for those who are in Christ Jesus."
    },
    {
      "verse": 2,
      "text": "For the law of the Spirit of life in Christ Jesus has set you free from the law of sin and of death."
    },
    {
      "verse": 3,
      "text": "For God has done what the law, weakened by the flesh, could not do: by sending his own Son in the likeness of sinful flesh and to deal with sin, he condemned sin in the flesh,"
    },
    {
      "verse": 4,
      "text": "so that the just requirement of the law might be fulfilled in us, who walk not according to the flesh but according to the Spirit."
    },
    {
      "verse": 5,
      "text": "For those who live according to the flesh set their minds on the things of the flesh, but those who live according to the Spirit set their minds on the things of the Spirit."
    },
    {
      "verse": 6,
      "text": "To set the mind on the flesh is death, but to set the mind on the Spirit is life and peace."
    },
    {
      "verse": 7,
      "text": "For this reason the mind that is set on the flesh is hostile to God; it does not submit to God’s law—indeed, it cannot,"
    },
    {
      "verse": 8,
      "text": "and those who are in the flesh cannot please God."
    },
    {
      "verse": 9,
      "text": "But you are not in the flesh; you are in the Spirit, since the Spirit of God dwells in you. Anyone who does not have the Spirit of Christ does not belong to him."
    },
    {
      "verse": 10,
      "text": "But if Christ is in you, then the body is dead because of sin, but the Spirit is life because of righteousness."
    },
    {
      "verse": 11,
      "text": "If the Spirit of him who raised Jesus from the dead dwells in you, he who raised Christ Jesus from the dead will give life to your mortal bodies also through his Spirit that dwells in you."
    },
    {
      "verse": 12,
      "text": "So then, brothers and sisters, we are obligated, not to the flesh, to live according to the flesh—"
    },
    {
      "verse": 13,
      "text": "for if you live according to the flesh, you will die, but if by the Spirit you put to death the deeds of the body, you will live."
    },
    {
      "verse": 14,
      "text": "For all who are led by the Spirit of God are children of God."
    },
    {
      "verse": 15,
      "text": "For you did not receive a spirit of slavery to fall back into fear, but you received a spirit of adoption. When we cry, “Abba! Father!”"
    },
    {
      "verse": 16,
      "text": "it is that very Spirit bearing witness with our spirit that we are children of God,"
    },
    {
      "verse": 17,
      "text": "and if children, then heirs: heirs of God and joint heirs with Christ, if we in fact suffer with him so that we may also be glorified with him."
    },
    {
      "verse": 18,
      "text": "I consider that the sufferings of this present time are not worth comparing with the glory about to be revealed to us."
    },
    {
      "verse": 19,
      "text": "For the creation waits with eager longing for the revealing of the children of God,"
    },
    {
      "verse": 20,
      "text": "for the creation was subjected to futility, not of its own will, but by the will of the one who subjected it, in hope"
    },
    {
      "verse": 21,
      "text": "that the creation itself will be set free from its enslavement to decay and will obtain the freedom of the glory of the children of God."
    },
    {
      "verse": 22,
      "text": "We know that the whole creation has been groaning together as it suffers together the pains of labor,"
    },
    {
      "verse": 23,
      "text": "and not only the creation, but we ourselves, who have the first fruits of the Spirit, groan inwardly while we wait for adoption, the redemption of our bodies."
    },
    {
      "verse": 24,
      "text": "For in hope we were saved. Now hope that is seen is not hope, for who hopes for what one already sees?"
    },
    {
      "verse": 25,
      "text": "But if we hope for what we do not see, we wait for it with patience."
    },
    {
      "verse": 26,
      "text": "Likewise the Spirit helps us in our weakness, for we do not know how to pray as we ought, but that very Spirit intercedes with groanings too deep for words."
    },
    {
      "verse": 27,
      "text": "And God, who searches hearts, knows what is the mind of the Spirit, because the Spirit intercedes for the saints according to the will of God."
    },
    {
      "verse": 28,
      "text": "We know that all things work together for good for those who love God, who are called according to his purpose."
    },
    {
      "verse": 29,
      "text": "For those whom he foreknew he also predestined to be conformed to the image of his Son, in order that he might be the firstborn within a large family."
    },
    {
      "verse": 30,
      "text": "And those whom he predestined he also called, and those whom he called he also justified, and those whom he justified he also glorified."
    },
    {
      "verse": 31,
      "text": "What then are we to say about these things? If God is for us, who is against us?"
    },
    {
      "verse": 32,
      "text": "He who did not withhold his own Son but gave him up for all of us, how will he not with him also give us everything else?"
    },
    {
      "verse": 33,
      "text": "Who will bring any charge against God’s elect? It is God who justifies."
    },
    {
      "verse": 34,
      "text": "Who is to condemn? It is Christ who died, or rather, who was raised, who is also at the right hand of God, who also intercedes for us."
    },
    {
      "verse": 35,
      "text": "Who will separate us from the love of Christ? Will affliction or distress or persecution or famine or nakedness or peril or sword?"
    },
    {
      "verse": 36,
      "text": "As it is written, “For your sake we are being killed all day long; we are accounted as sheep to be slaughtered.”"
    },
    {
      "verse": 37,
      "text": "No, in all these things we are more than victorious through him who loved us."
    },
    {
      "verse": 38,
      "text": "For I am convinced that neither death, nor life, nor angels, nor rulers, nor things present, nor things to come, nor powers,"
    },
    {
      "verse": 39,
      "text": "nor height, nor depth, nor anything else in all creation will be able to separate us from the love of God in Christ Jesus our Lord."
    }
  ],
  "timestamp": "2025-08-08T15:51:51.209548"
}