{
  "book": "TIT",
  "book_name": "Titus",
  "chapter": 1,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/TIT.1",
  "verses": [
    {
      "verse": 1,
      "text": "Paul, a servant of God and an apostle of Jesus Christ, for the sake of the faith of God’s elect and the knowledge of the truth that is in accordance with godliness,"
    },
    {
      "verse": 2,
      "text": "in the hope of eternal life that God, who never lies, promised before the ages began—"
    },
    {
      "verse": 3,
      "text": "in due time he revealed his word through the proclamation with which I have been entrusted by the command of God our Savior,"
    },
    {
      "verse": 4,
      "text": "Grace and peace from God the Father and Christ Jesus our Savior."
    },
    {
      "verse": 5,
      "text": "I left you behind in Crete for this reason, so that you should put in order what remained to be done and should appoint elders in every town, as I directed you:"
    },
    {
      "verse": 6,
      "text": "someone who is blameless, married only once, whose children are believers, not accused of debauchery and not rebellious."
    },
    {
      "verse": 7,
      "text": "For a bishop, as God’s steward, must be blameless; he must not be arrogant or quick-tempered or addicted to wine or violent or greedy for gain,"
    },
    {
      "verse": 8,
      "text": "but he must be hospitable, a lover of goodness, self-controlled, upright, devout, and restrained,"
    },
    {
      "verse": 9,
      "text": "holding tightly to the trustworthy word of the teaching, so that he may be able both to exhort with sound instruction and to refute those who contradict it."
    },
    {
      "verse": 10,
      "text": "There are also many rebellious people, idle talkers and deceivers, especially those of the circumcision;"
    },
    {
      "verse": 11,
      "text": "they must be silenced, since they are upsetting whole families by teaching for sordid gain what it is not right to teach."
    },
    {
      "verse": 12,
      "text": "It was one of them, their very own prophet, who said, “Cretans are always liars, vicious brutes, lazy gluttons.”"
    },
    {
      "verse": 13,
      "text": "That testimony is true. For this reason rebuke them sharply, so that they may become sound in the faith,"
    },
    {
      "verse": 14,
      "text": "not paying attention to Jewish myths or to commandments of those who reject the truth."
    },
    {
      "verse": 15,
      "text": "To the pure all things are pure, but to the corrupt and unbelieving nothing is pure; their very minds and consciences are corrupted."
    },
    {
      "verse": 16,
      "text": "They profess to know God, but they deny him by their actions; they are detestable, disobedient, unfit for any good work."
    }
  ],
  "timestamp": "2025-08-08T15:52:18.297119"
}