{
  "book": "ZEC",
  "book_name": "Zechariah",
  "chapter": 1,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ZEC.1",
  "verses": [
    {
      "verse": 1,
      "text": "In the eighth month, in the second year of Darius, the word of the Lord came to the prophet Zechariah son of Berechiah son of Iddo, saying:"
    },
    {
      "verse": 2,
      "text": "“The Lord was very angry with your ancestors."
    },
    {
      "verse": 3,
      "text": "Therefore say to them: Thus says the Lord of hosts: Return to me, says the Lord of hosts, and I will return to you, says the Lord of hosts."
    },
    {
      "verse": 4,
      "text": "Do not be like your ancestors, to whom the former prophets proclaimed, ‘Thus says the Lord of hosts: Return from your evil ways and from your evil deeds.’ But they did not hear or heed me, says the Lord."
    },
    {
      "verse": 5,
      "text": "Your ancestors, where are they? And the prophets, do they live forever?"
    },
    {
      "verse": 6,
      "text": "But my words and my statutes, which I commanded my servants the prophets, did they not overtake your ancestors? So they repented and said, ‘The Lord of hosts has dealt with us according to our ways and deeds, just as he planned to do.’ ”"
    },
    {
      "verse": 7,
      "text": "On the twenty-fourth day of the eleventh month, the month of Shebat, in the second year of Darius, the word of the Lord came to the prophet Zechariah son of Berechiah son of Iddo:"
    },
    {
      "verse": 8,
      "text": "In the night I saw a man mounted on a red horse! He was standing among the myrtle trees in the shadows, and behind him were red, sorrel, and white horses."
    },
    {
      "verse": 9,
      "text": "Then I said, “What are these, my lord?” The angel who spoke with me said to me, “I will show you what they are.”"
    },
    {
      "verse": 10,
      "text": "So the man who was standing among the myrtle trees answered, “They are those whom the Lord has sent to patrol the earth.”"
    },
    {
      "verse": 11,
      "text": "Then they spoke to the angel of the Lord who was standing among the myrtle trees, “We have patrolled the earth, and the whole earth remains at peace.”"
    },
    {
      "verse": 12,
      "text": "Then the angel of the Lord said, “O Lord of hosts, how long will you withhold mercy from Jerusalem and the cities of Judah, with which you have been angry these seventy years?”"
    },
    {
      "verse": 13,
      "text": "Then the Lord replied with gracious and comforting words to the angel who spoke with me."
    },
    {
      "verse": 14,
      "text": "So the angel who spoke with me said to me, “Proclaim this message: Thus says the Lord of hosts: I am very zealous for Jerusalem and for Zion,"
    },
    {
      "verse": 15,
      "text": "and I am extremely angry with the nations that are at ease, for while I was only a little angry, they made the disaster worse."
    },
    {
      "verse": 16,
      "text": "Therefore, thus says the Lord: I have returned to Jerusalem with compassion; my house shall be built in it, says the Lord of hosts, and a measuring line shall be stretched out over Jerusalem."
    },
    {
      "verse": 17,
      "text": "Proclaim further: Thus says the Lord of hosts: My cities shall again overflow with prosperity; the Lord will again comfort Zion and again choose Jerusalem.”"
    },
    {
      "verse": 18,
      "text": "And I looked up and saw four horns."
    },
    {
      "verse": 19,
      "text": "I asked the angel who spoke with me, “What are those?” And he answered me, “Those are the horns that have scattered Judah, Israel, and Jerusalem.”"
    },
    {
      "verse": 20,
      "text": "Then the Lord showed me four blacksmiths."
    },
    {
      "verse": 21,
      "text": "And I asked, “What are they coming to do?” He answered, “Those are the horns that scattered Judah, so that no head could be raised, but these have come to terrify them, to strike down the horns of the nations that lifted up their horns against the land of Judah to scatter its people.”"
    }
  ],
  "timestamp": "2025-08-08T15:51:19.659559"
}