{
  "book": "ZEC",
  "book_name": "Zechariah",
  "chapter": 3,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ZEC.3",
  "verses": [
    {
      "verse": 1,
      "text": "Then he showed me the high priest Joshua standing before the angel of the Lord and the accuser standing at his right hand to accuse him."
    },
    {
      "verse": 2,
      "text": "And the Lord said to the accuser, “The Lord rebuke you, O accuser! The Lord who has chosen Jerusalem rebuke you! Is not this man a brand plucked from the fire?”"
    },
    {
      "verse": 3,
      "text": "Now Joshua was wearing filthy clothes as he stood before the angel."
    },
    {
      "verse": 4,
      "text": "The angel said to those who were standing before him, “Take off his filthy clothes.” And to him he said, “See, I have taken your guilt away from you, and I will clothe you with festal apparel.”"
    },
    {
      "verse": 5,
      "text": "And he said, “Let them put a clean turban on his head.” So they put a clean turban on his head and clothed him with apparel, and the angel of the Lord was standing by."
    },
    {
      "verse": 6,
      "text": "Then the angel of the Lord warned Joshua, saying"
    },
    {
      "verse": 7,
      "text": "“Thus says the Lord of hosts: If you will walk in my ways and keep my requirements, then you shall rule my house and have charge of my courts, and I will give you the right of access among those who are standing here."
    },
    {
      "verse": 8,
      "text": "Now listen, Joshua, high priest, you and your colleagues who sit before you! For they are an omen of things to come: I am going to bring my servant the Branch."
    },
    {
      "verse": 9,
      "text": "For on the stone that I have set before Joshua, on a single stone with seven facets, I will engrave its inscription, says the Lord of hosts, and I will remove the guilt of this land in a single day."
    },
    {
      "verse": 10,
      "text": "On that day, says the Lord of hosts, you shall invite each other to come under your vine and fig tree.”"
    }
  ],
  "timestamp": "2025-08-08T15:51:19.856578"
}