{
  "book": "ZEC",
  "book_name": "Zechariah",
  "chapter": 8,
  "version_id": 3523,
  "url": "https://www.bible.com/bible/3523/ZEC.8",
  "verses": [
    {
      "verse": 1,
      "text": "The word of the Lord of hosts came to me, saying:"
    },
    {
      "verse": 2,
      "text": "“Thus says the Lord of hosts: I am zealous for Zion with great zeal, and I am zealous for her with great wrath."
    },
    {
      "verse": 3,
      "text": "Thus says the Lord: I will return to Zion and will dwell in the midst of Jerusalem; Jerusalem shall be called the faithful city, and the mountain of the Lord of hosts shall be called the holy mountain."
    },
    {
      "verse": 4,
      "text": "Thus says the Lord of hosts: Old men and old women shall again sit in the streets of Jerusalem, each with staff in hand because of their great age."
    },
    {
      "verse": 5,
      "text": "And the streets of the city shall be full of boys and girls playing in its streets."
    },
    {
      "verse": 6,
      "text": "Thus says the Lord of hosts: Even though it seems impossible to the remnant of this people in these days, should it also seem impossible to me, says the Lord of hosts?"
    },
    {
      "verse": 7,
      "text": "Thus says the Lord of hosts: I will save my people from the east country and from the west country,"
    },
    {
      "verse": 8,
      "text": "and I will bring them to live in Jerusalem. They shall be my people and I will be their God, in faithfulness and in righteousness.”"
    },
    {
      "verse": 9,
      "text": "“Thus says the Lord of hosts: Let your hands be strong—you who have recently been hearing these words from the mouths of the prophets who were present when the foundation was laid for the rebuilding of the temple, the house of the Lord of hosts."
    },
    {
      "verse": 10,
      "text": "For before those days there were no wages for people or for animals, nor was there any safety from the foe for those who went out or came in, and I set them all against one another."
    },
    {
      "verse": 11,
      "text": "But now I will not deal with the remnant of this people as in the former days, says the Lord of hosts."
    },
    {
      "verse": 12,
      "text": "For there shall be a sowing of peace; the vine shall yield its fruit, the ground shall give its produce, and the skies shall give their dew, and I will cause the remnant of this people to possess all these things."
    },
    {
      "verse": 13,
      "text": "Just as you have been a cursing among the nations, O house of Judah and house of Israel, so I will save you, and you shall be a blessing. Do not be afraid, but let your hands be strong.”"
    },
    {
      "verse": 14,
      "text": "“For thus says the Lord of hosts: Just as I purposed to bring disaster upon you when your ancestors provoked me to wrath, and I did not relent, says the Lord of hosts,"
    },
    {
      "verse": 15,
      "text": "so again I have purposed in these days to do good to Jerusalem and to the house of Judah; do not be afraid."
    },
    {
      "verse": 16,
      "text": "These are the things that you shall do: speak the truth to one another, render in your gates judgments that are true and make for peace,"
    },
    {
      "verse": 17,
      "text": "do not devise evil in your hearts against one another, and love no false oath, for all these are things that I hate, says the Lord.”"
    },
    {
      "verse": 18,
      "text": "The word of the Lord of hosts came to me, saying:"
    },
    {
      "verse": 19,
      "text": "“Thus says the Lord of hosts: The fast of the fourth month, and the fast of the fifth, and the fast of the seventh, and the fast of the tenth shall be seasons of joy and gladness and cheerful festivals for the house of Judah; therefore love truth and peace.”"
    },
    {
      "verse": 20,
      "text": "“Thus says the Lord of hosts: Peoples shall yet come, the inhabitants of many cities;"
    },
    {
      "verse": 21,
      "text": "the inhabitants of one city shall go to another, saying, ‘Come, let us go to entreat the favor of the Lord and to seek the Lord of hosts; I myself am going.’"
    },
    {
      "verse": 22,
      "text": "Many peoples and strong nations shall come to seek the Lord of hosts in Jerusalem and to entreat the favor of the Lord."
    },
    {
      "verse": 23,
      "text": "Thus says the Lord of hosts: In those days ten men from nations of every language shall take hold of a Jew, grasping his garment and saying, ‘Let us go with you, for we have heard that God is with you.’ ”"
    }
  ],
  "timestamp": "2025-08-08T15:51:20.589466"
}